{
  "jobs": [
    {
      "title": "Software Developer, Desktop Apps (Remote Option)",
      "company_name": "AccuWeather",
      "location": "State College, PA, USA",
      "via": "via Startup Jobs",
      "description": "COMPANY\n\nAccuWeather, recognized and documented as the most accurate source of weather forecasts and warnings in the world, has saved tens of thousands of lives, prevented hundreds of thousands of injuries and tens of billions of dollars in property damage. With global headquarters in State College, Pennsylvania; a severe weather center in Wichita, Kansas; and offices in New York City and... elsewhere around the world, AccuWeather serves more than 1.5 billion people daily to help them plan their activities and get more out of their day through innovative digital media properties, such as AccuWeather.com and mobile, as well as AccuWeather For Business (AFB), radio, television, newspapers, digital out of home, the 24/7 AccuWeather Network channel and AccuWeather NOW streaming service. Additionally, AccuWeather produces and distributes news, weather content, and video for more than 180,000 third-party websites.\n\nAccuWeather's innovation-first promise has led to the development of many award-winning and propriety features that are available free to the public, including AccuWeather MinuteCast® Minute by Minute™ forecasts with Superior Accuracy ™, the exclusive AccuWeather RealFeel® Temperature, and AccuWeather RealImpact™ Scale for Hurricanes, among many other revolutionary products for the greater safety, convenience and comfort of our users. Further, AccuWeather serves more than half of the Fortune 500 and thousands of other businesses in the U.S. and globally.\n\nDr. Joel N. Myers, Founder and Chief Executive Officer, established AccuWeather in 1962 and is considered the “father of modern commercial meteorology.” Dr. Myers, a leading creative thinker and visionary, has been named “the most accurate man in weather” by The New York Times and one of the top entrepreneurs in American history by Entrepreneur’s Encyclopedia of Entrepreneurs.\n\nSUMMARY\n\nThe Software Developer of Desktop Apps will be responsible for the developing and maintaining the AccuWeather for Business forecasting desktop application and associated integrations. Leveraging modern technologies and architectural approaches, you will translate forecasting and meteorological needs into world class production code.\n\nThis position will work cross-functionally with Forecasting, Development, Product and other groups, in an Agile-based development environment, to deliver both real-time data and best of breed experiences that cater to a global audience.\n\nRemote candidates are being considered for this mid-level opportunity.\n\nRESPONSIBILITIES\n\n• Develop functional, efficient, and well-structured code, and test artifacts\n• Work closely with design teams to graduate mockups to functional interfaces/features\n• Leverage client and server-side technologies to build modern components for desktop applications\n• Work closely with Forecasting, Product, and Design to develop innovative user experiences\n• Prototype, test, and iterate upon new features\n\nQUALIFICATIONS\n\n• BS/BA in related discipline with 3+ years’ experience in related field\n• Proficient in modern programming languages such as C++, Google Go, C#, and Java\n• Proficient in modern scripting languages such as CSS and JavaScript\n• Proficient in Geographic Information Systems (GIS) such as Esri, MapBox, and Leaflet\n• Self-driven; good problem-solving skills; adaptable and willing to take ownership\n• Good verbal and written communication and collaboration skills\n• Experience building desktop applications (C++, SQL, Google Go) and desktop UI (Qt framework)\n• Experience with hardware accelerated rendering (OpenGL)\n• Demonstrates critical thinking and analysis in bringing successful resolution to small-to-moderate projects\n• Experience with version control systems and CI/CD processes (Git, Mercurial, SVN – Jenkins, Azure DevOps, etc.)\n• Understanding of unit testing frameworks and tools\n• Understanding of security principles, standards, and conventions\n• In the United States, AccuWeather is only able to hire team members in the following states due to taxation purposes: CA, CO, CT, DE, DC, FL, GA, IL, IN, KS, KY, MD, MN, MO, NE, NV, NJ, NY, NC, OH, OK, PA, SC, SD, TN, TX, VA, WA, WI and WY.\n\nAccuWeather is proud to be an Equal Opportunity/Affirmative Action Employer. We are committed to equal employment opportunity to all applicants and existing employees and we evaluate qualified applicants without regard to race, creed, color, national origin, sex (including pregnancy and gender identity/expression), sexual orientation, age, ancestry, physical or mental disability, marital status, political affiliation, religion, citizenship status, genetic information, veteran status, or any other basis protected under applicable federal, state, or local law. View the EEO is the Law poster here and its supplement here. The pay transparency policy is available here.\n\nAccuWeather is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to human.resources@accuweather.com and let us know the nature of your request and your contact information",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIsIERlc2t0b3AgQXBwcyAoUmVtb3RlIE9wdGlvbikiLCJodGlkb2NpZCI6IjV0Sm5PSXZyUlpJQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU3RhcnR1cCBKb2JzIiwibGluayI6Imh0dHBzOi8vc3RhcnR1cC5qb2JzL3NvZnR3YXJlLWRldmVsb3Blci1kZXNrdG9wLWFwcHMtcmVtb3RlLW9wdGlvbi1hY2N1d2VhdGhlci0yMjAwMjc0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Desktop Application support / Site application coordinator",
      "company_name": "Xforia",
      "location": "Hawaii, USA",
      "via": "via Salary.com",
      "description": "Job Details:\n\nTitle: - Site application coordinator...\n\nLocation: - Travel Position (Sedona, AZ / Park City, UT / Las Vegas, NV / MAUI, Hawaii / British Columbia, Canada)\n\nDuration: 3 Months Contract\n\nStart Date: 04/02/2022\n\nBelow are the locations and dates that you'll be travelling: (Expenses will be paid)\n\n03/14/2022 to 04/01/2022 - Training - Work From Home\n\n04/02/2022 to 04/10/2022 - Sedona, AZ - Onsite\n\n04/11/2022 to 04/15/2022 - Park City, UT - Onsite\n\n04/16/2022 to 04/22/2022 - Sedona, AZ - Onsite\n\n04/23/2022 to 04/24/2022 - Sedona, AZ OR Las Vegas, NV - Onsite\n\n04/25/2022 to 05/01/2022 - Las Vegas, NV - Onsite\n\n05/02/2022 to 06/10/2022 - Work From Home\n\n06/11//2022 to 06/19/2022 - British Columbia, Canada - Onsite\n\n06/20/2022 to 07/01/2022 - Work From Home\n\n07/02/2022 to 07/10/2022 - MAUI, Hawaii - Onsite\n\n07/11/2022 to 07/17/2022 - Work From Home\n\nRole description -\n• Onsite coordination (during Hypercare) between users and service desk / field agents to identify, prioritize and follow up on issues to support users with understanding what is manual versus automated, business process issues, application specific access issues, application level bugs, etc.\n• Manage and monitor critical issues raised by users at the site level and escalate to the right stakeholders (including IT command center) to ensure speedy resolution.\n• Provide daily reporting stats for the issue queue, and review data in ServiceNow as required.\n\nTypical experience (in years) - 5-7 years\n\nSkills -\n\nKnowledge / understanding of typical business applications and being able to quickly understand the end user perspective for each application (supporting sales, marketing, membership), knowledge of service management process, reporting and communication skills\n\nJob Type: Full-time\n\nSalary: $45.00 - $50.00 per hour\n\nSchedule:\n• Weekend availability\n\nApplication Question(s):\n• Are you interested to travel this location? (Yes/No) - (Sedona, AZ / Park City, UT / Las Vegas, NV / MAUI, Hawaii / British Columbia, Canada)\n\nExperience:\n• Desktop support: 1 year (Preferred)\n• Application support: 1 year (Preferred)\n\nWork Location: One location\n\nSpeak with the employer\n91 6382847242",
      "extensions": [
        "5 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "5 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEFwcGxpY2F0aW9uIHN1cHBvcnQgLyBTaXRlIGFwcGxpY2F0aW9uIGNvb3JkaW5hdG9yIiwiaHRpZG9jaWQiOiJOaC01RmxuenJxb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNhbGFyeS5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2FsYXJ5LmNvbS9qb2IveGZvcmlhL2Rlc2t0b3AtYXBwbGljYXRpb24tc3VwcG9ydC1zaXRlLWFwcGxpY2F0aW9uLWNvb3JkaW5hdG9yL2oyMDIyMDIxMDEyMTk0MjYyMDk1NTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Desktop Application Developer with leading eye-tracking tech fir",
      "company_name": "CyberCoders",
      "location": "Mesa, AZ, USA",
      "via": "via Tarta.ai",
      "description": "Desktop Application Developer with leading eye-tracking tech fir We're a venture-backed high tech company building cutting edge hardware and software that is changing the way the world interacts with technology. Now we're embarking on an exciting new journey that requires some of the best minds in software development. Think that might be you?\nWhat You Will Be DoingWhat You'll Be Doing\n...\nWere building a whole new ambitious experience utilizing an exciting technology thats so cutting edge we cant mention it in a job posting. Youll initially be converting an existing application to another framework that will lay the foundations for a paradigm shift in user interface. Youll be responsible for scaling the software to integrate system-wide, proprietary technologies, and future technologies.\n\nEssential Skills:\n\nÏMid-level experience with Unity 3D\nÏExtensive C#/.Net programming experience (4+ years)\nÏExtensive knowledge of desktop application development\nÏMVVM and data binding development experience, preferably in WPF or strong experience with adjacent paradigms (i.e. MVP/MVC, Silverlight/UWP)\nÏExperience with XAML-based application development\nÏExperience balancing efficiency and reliability with a reasonable deadline\n\nBonus Experience:\n\nÏWriting libraries for reuse\nÏTest-driven development\nÏExperience with C++\nÏExperience with UI/UX\nWhat You Need for this Position- Unity 3D\n- C#\n- .NET\n- MVVM\n- Desktop Application Developer\nSo, if you are a Desktop Application Developer with leading eye-tracking tech fir with experience, please apply today! Or, if you prefer, please send along your resume and application to kyle.westhorpe@cybercoders.com.\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Kyle Westhorpe\n-\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhOqMj01kyhagxjN0oQJlous-x6_WGmG-2af_uX20&s",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEFwcGxpY2F0aW9uIERldmVsb3BlciB3aXRoIGxlYWRpbmcgZXllLXRyYWNraW5nIHRlY2ggZmlyIiwiaHRpZG9jaWQiOiJnY2c4WTlTUzEwb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRhcnRhLmFpIiwibGluayI6Imh0dHBzOi8vdGFydGEuYWkvai9jUVBBd1gwQldYTDR4dFM3TTZHMS1kZXNrdG9wLWFwcGxpY2F0aW9uLWRldmVsb3Blci13aXRoLWxlYWRpbmctZXllLXRyYWNraW5nLXRlY2gtZmlyLWluLW1lc2EtYXotYXQtY3liZXJjb2RlcnM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Desktop, Applications",
      "company_name": "Custom Group Companies",
      "location": "New York, NY, USA",
      "via": "via BeBee",
      "description": "We are looking for a Desktop Application and Mobile Support Manager for our client located in New York City.\n\nNote: Selected individual should have previous experience working in a law firm or in a legal department...\n\nThis is a Direct Hire position, with great salary and benefits (up to 175k)\n\nThis position will be remote until Jan 2022 and then will require you to work onsite 100% in New York City\n\nLooking for Candidates that live in a Commutable Distance to New York City\n\nPlease email your resume in a WORD doc to [Email available when viewing the job]\n\nThe Desktop, Application and Mobile Support Manager is responsible for managing and overseeing all technology operations for the Desktop, Applications, Mobility and Conferencing Technology Services teams, with focus on high level customer service, responsiveness to business needs and devising and establishing IT policies to support the needs of the firm.\n\nDesktop & Mobility Services - deploys and supports all end points, 2nd level support for all applications, mobile device configuration and remote access support.\n\nConferencing Technology - design, implementation and delivery of all conference room technology, audio, video and web conferencing setup and support.\n\nAbility to work independently and ensure availability at all times in a customer centric, high service level and continually evolving environment.\n\nWork closely with Help Desk Manager to manage escalations and tickets.\n\nReporting Structure:\n\nThe Desktop, Application, and Mobile Support Manager will report directly to the Director of User Support and Education\n\nPrincipal Duties and Responsibilities\n• Planning, execution and support of end points and conference technology deployments for the firm.\n• Maintain the highest level of customer support for the customer base through proactive management and implementation of continuous improvement initiatives; provide high-touch white-glove service\n• Provide technical and business leadership, mentorship and support to the team.\n• Oversee operations of second level escalations by creating a business focused and responsive environment for quick turnaround and resolution.\n• Act as a key interface to the Desktop & Mobility Services, Conferencing Technology Services, Infrastructure, Applications development and other departments throughout the firm.\n• Work effectively, efficiently and collaboratively with others throughout IS and the firm to deliver the objectives of the department and the firm.\n• Formulate performance plans and provide regular feedback throughout the year to direct reports.\n• Oversee and guide professional development and coaching for team members with an emphasis on acquiring soft skills and business focus in addition to technical knowledge.\n• Metrics and Reporting - Responsible for reporting on groups KPIs. Develops process for regular metric analysis and reporting. Review performance metrics with leadership and stakeholders. Makes recommendations for performance improvement based on metric data.\n• Process Improvement Regularly reviews support processes and works to streamline and automate where applicable. Seeks to expand overall services provided to users and looks for opportunities to shift routine work from other technology teams to the desktop support team when possible. Responsible for the IT Service Management (ITSM) tools, including implementation and automation of service and support processes'.\n• Knowledge Management - Ensures that knowledge is captured in the appropriate context, is accurate and published timely for use within the Desktop Support team and other operational teams with a focus on improving service delivery to customers. Coaches Desktop Support Team on the knowledge management workflow. Works with second and third level teams and facilitates appropriate knowledge capture and training.\n\nPosition Specific Skills and Requirements\n• Bachelor's degree, and/or a minimum of three year's managerial level experience in related systems support preferably in a law firm environment.\n• ITIL service delivery qualification foundation level preferred.\n\nEducation and General Requirements\n• Attributes expected of all candidates include: responsibility, honesty, reliability, initiative, patience, attention to detail, determination, taking pride in one's work, and a desire to learn.\n• Interpersonal skills necessary to interact and work productively as part of the Information Systems team, delivering high quality services to the Firm and our clients.\n• Ability to meet deadlines and effectively complete operational and project based assignments.\n• Ability to communicate effectively, in person and in writing, with Firm personnel at all levels and outside parties as necessary.\n• Ability to work independently.\n• Attendance Requirements:\n• On site during normal working hours and available as necessary before or after normal working hours to work at the Firm, over the telephone, or at off-site meetings, in order to meet the demands of the job and the needs of the Firm.\n• Expected to carry a wireless email device and respond when necessary",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSERNIV6KuLymkaz4fFHaJdfD6jYfTpN3UK8UpnTinDtKuvicWA9RLxA&s",
      "extensions": [
        "5 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "5 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wLCBBcHBsaWNhdGlvbnMiLCJodGlkb2NpZCI6IjUzUFhMeXRDTy1jQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVZCRk1rZFhRMlV3UVZGTU0zaGpaMDVFV2xadE5VbElUM1pzV1RGRFJIaFpYM2R4WVhkbVdFRnFhWGxDU0ZOcU5Xb3pZVWhqZWpNdFJuTjJWRTFhVkRCWFZISnRRMVJGU1ZKTk1WSmFTR1ZwVURkSE5EQllNa1Y0Ym1SRGExRTVWRGRDU0hKRVRHbFBaMUkwT0VNM1prZDZRMHRMVW1JdGRVNUhXbE0zTWxsRU5VbEhZVFZJVm5JMGJWTlVOamg1T0RBNE0xSXhSV0Z4V2sxRFZraHpRV0o0U21JeGR6TlRXa2xHWmtGQmVWSktkVlIzYkRNMlNtTkdWRFpQT1VKV2JUQk9TMUpUZW5wMVJVZDFFaFpoT1RCTldYRkllazVrTFcxd2RGRlFieTAyVTFWQkdpSkJSR3BYWHpOS1dqQmFiMWhxZFRCRGFscEtjWFpIWjI1MGJWZFdhbXhoWTJsQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly91cy5iZWJlZS5jb20vam9iLzIwMjIwMjExLTA4MWMzMWVkYWMxNTM4ZTIyYmQ2NGFiNjkzZWEwMDg5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Software Engineer, Desktop Developer Experience - Slack",
      "company_name": "Salesforce",
      "location": "Denver, CO, USA",
      "via": "via BeHired.in",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nProducts and Technology\n\nJob Details\nAbout the Team\n\nThe Slack Internal Tools team makes the development and release of new code safe and enjoyable for our developers. We maintain Slack's deploy pipeline, continuous integration infrastructure, and code review process.\n\nThe Desktop DevXP team is part of the Slack Internal Tools team. This team builds tools to ensure that desktop engineers at Slack can develop, test and deploy high-quality code safely and at scale. Our work is to make the Desktop Development team more productive. We’re infrastructure engineers who value craftsmanship, quality and empathy.\n\nSoftware Engineers at Slack work in a highly collaborative environment, and that is particularly true within Developer Productivity where we are focused on improving the working lives of our fellow engineers across the company. One size does not fit all so please bring your bag of tricks and ability to teach them to others.\n\nSlack has a positive, diverse, and supportive culture—we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking and, above all, collaborative. If this sounds like a good fit for you, why not say hello?\n\nWhat you will be doing\n• Understand desktop releases and infrastructure\n• Translate new requirements into designs that align with team and company goals.\n• Evaluate, implement, and maintain high-quality tools and automation processes to support continuous delivery and developer productivity.\n\nWhat you should have\n• Bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience\n• 2+ years of relevant experience.\n• Firm grasp of computer science fundamentals: data structures, algorithms, programming languages, distributed systems, and information retrieval\n• You are a team player and get motivated by helping other engineers succeed. When things break — and they will — you are eager and able to help fix things. You like thinking of ways to improve efficiency or bring delight to the people you work with\n• You are a strong communicator. Explaining complex technical concepts to designers, support, and other engineers is no problem for you\n• You listen to your mentor and senior engineer, provide your input and move fast\n• You are a quick learner, and able to learn and apply best practices for unit tests, code review, design documentation, debugging, and troubleshooting quickly\n• You are someone that others enjoy working with due to your positive attitude and technical competence\n• You have curiosity about how things work\n• You can work with whichever programming language is required to get the job done—Python, PHP, TypeScript, or others—and are proficient in at least one.\n\nPreferred Qualifications\n• You have good knowledge with git version control system and Github APIs\n• You are familiar with CI/CD system such as Circleci or Jenkins\n• You are familiar with Docker and Kubernetes\n• You have experience with administration of different operating systems including MacOS, Linux and Windows\n• You have experience with cross platform desktop application release process\n• You have experience with application error tracking and analysis tool such as Sentry or Bugsnag\n• You've used Slack and are excited to make it better.\n\nSlack is registered as an employer in many, but not all, states. If you are not located in or able to work from a state where Slack is registered, you will not be eligible for employment.Visa sponsorship may not be available in certain remote locations.\n\nVisa sponsorship is not available for candidates living outside the country of this position.\n\nFor Colorado-based roles: Minimum annual salary of $121,000. You may also be entitled to receive incentive compensation: bonus, restricted stock units, and benefits.\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.\n\nSalesforce welcomes all",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxfO6XXpmiyK9C2_mJrVlkI5_k-rewGwi5-kHz&s=0",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgRGVza3RvcCBEZXZlbG9wZXIgRXhwZXJpZW5jZSAtIFNsYWNrIiwiaHRpZG9jaWQiOiJkbk9kLTZ2R3lWWUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFWQkZNa2RYUkRCRldYaGtNazFqUW1rNVprUnJRMmh3VWpKUVEyRlpaRk5SWlc5UmVsSlVhbmc0UlRoeVZYWnplV3cyVlhaUk1FWnFZMWd0WTFabmJuZExOREZKU0ZKemFtNW9aMmxQYkhNMlZUQlpNalJaYUMxemVFWlNlalJ4Y0RKUGVHWkRhak14U1RoRU1YTXdNVGt4WVRKdmRsbGhSMDVyZHpKMWNtRjFTazQzZDE5UlVVbHRMVmN5WDFGZmMzWnFlbmxLTVZkd2IzVTFWRnBpV2tSbkVoWmhPVEJOV1hGSWVrNWtMVzF3ZEZGUWJ5MDJVMVZCR2lKQlJHcFhYek5KVlMxM1MxbEdVRU5EVjB4VlN6bDNVVXd4UTFaV09VdHVTbEJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUhpcmVkLmluIiwibGluayI6Imh0dHBzOi8vc2FsZXNmb3JjZS5iZWhpcmVkLmluL2pvYnMvU29mdHdhcmUtRW5naW5lZXItRGVza3RvcC1EZXZlbG9wZXItRXhwZXJpZW5jZS1TbGFjay1KUlMwMDgzNi5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Ubuntu Desktop Software Engineer",
      "company_name": "Canonical - Jobs",
      "location": "Portland, OR, USA",
      "via": "via Monster",
      "description": "The Ubuntu Desktop Team is responsible for delivering Ubuntu Desktop, which is one of the most popular Linux operating systems available for desktops today. Ubuntu strives to be the best free software operating system in existence. Along with delivering Ubuntu Desktop, the team is also charged with leading the way in the application ecosystem necessary for external app developers to bring high... quality applications to the Linux desktop.\n\nWe are seeking a Software Engineer to join the Ubuntu Desktop Team to build the best open source operating system in the world. Candidates should have engineering experience with two or more of Ubuntu Desktop, Flutter, Dart, GNOME, GTK, Python, Go, C, Debian or Snap packaging.\nWhat you’ll do\n• Collaborate proactively with a distributed team\n• Write high quality code to create new features\n• Debug issues and produce high quality code to fix them\n• Review code produced by other engineers\n• Discuss ideas and collaborate on finding good solutions\n• Work from home with global travel 2 to 4 weeks for internal and external events\nWho you are\n• You love technology and working with brilliant people\n• You are curious, flexible, articulate, and accountable\n• You value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n• You have a Bachelor’s or equivalent in Computer Science, STEM or similar degree\n\nCanonical is proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background lead to a better environment for our employees and a better platform for our users and customers",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSoKDCZKH0kclmwL6klD-d5SYdjz7GfCgjQMw9u&s=0",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJVYnVudHUgRGVza3RvcCBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiSE9hYmlZdjZpNmNBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVkJGTWtkWFFqVlNUMlJLTXprd2NUVjVVa0ZmYzNka1NGZDVUMTgzYkRsbVEyWmFNREprZVdoWlNucDZSWE42YW5aTGJVRTJaRFF4ZVZBd1JsRnRSRGRXYzJWeE0ydHlhM2RFV1dFdFpIRk9ORkpXY0ZaR1pVTjZlVkJrTlU5Sk1qVmpUbnBJV1hocE5UaERabFJXV0hWcVNrSnFTMWhtVTJGR1puRlZNekJxTkVKaFNuaFlTMHBmWTA1ZmNqZ3hielJ6WkdNM1dHWm5YMDA1YUc5NGRFUm9WRU5NUW14blJuRndUV2xxWkY5ME1HMTJiMGRCRWhaaE9UQk5XWEZJZWs1a0xXMXdkRkZRYnkwMlUxVkJHaUpCUkdwWFh6Tk1kelpKTFd3MVQyRkhaMjFCT0RGMk1GVnBTbXREUTFsMmRXNTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20vam9iLW9wZW5pbmdzL3VidW50dS1kZXNrdG9wLXNvZnR3YXJlLWVuZ2luZWVyLW9yLS1iYTYxZGQ5NC0xN2U0LTQ0N2YtYjRkMC0zMDM5OGRhM2QwNmQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Windows Application Developer - Junior",
      "company_name": "Kforce",
      "location": "Fort Collins, CO, USA",
      "via": "via The Muse",
      "description": "Responsibilities\n\nKforce has a client that is seeking multiple Windows Application Developers - Junior for an enterprise client who is looking to bring new ways for their gaming community to interact with each other on a remote basis. This role is remote right now due to COVID-19.Summary:This exciting opportunity will enable a Windows Developer to join a team of engineers that are creating... maintaining and enhancing this large gaming platform to their customers. Right now, they are making tweaks and enhancements to current features, but they are also looking to add in some new elements to help the gaming community interact with social media. This application is one of the top gaming applications in the app store!In this role as a Windows Application Developer, you'll be joining a great team of fellow visionaries - a development team whose mission is to design some of the most exciting, gamer-focused applications and products on the market. We'll look to you to not only analyze what works well, but have you help us our products and applications work better, cleaner, faster, stronger, and more attuned to gaming-focused tech lovers.Kforce offers a robust benefit package which includes medical, dental and vision. We also offer career development courses, employee discount programs and consultant recognition. While on assignment at this customer you will also have access to our PTO program as well as paid holidays. If you are interested in this position, please apply ASAP.\n\nSkills\n• 2-3 years of development experience\n• Experience working with Win32 and/or UWP\n• C# experience (with some Java experience)\n• Highly motivated and eager to learn and contribute to a fast-paced team\n• Experience working on desktop applications\n• Experience working in an agile environment\n• Able to work with a fast-paced team, great communicator\nNice to Have:\n• Mobile Application experience (iOS or Android)\n• Prism experience\n• Passion and/or gaming enthusiast\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n\nKforce is a professional staffing services firm offering Technology and Finance & Accounting jobs with top employers nationwide. We specialize in providing contract, contract-to-hire and direct placement opportunities, with over 50 years of experience in the staffing industry. Kforce offers many consultants comprehensive benefits depending on employment status, including medical, dental, 401(K), life insurance and disability. Our vision is to be \"the firm most respected by those we serve",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQQ4qSV-TpV9gSI76GfTkxlARWqNp7hIKyVX1HaALaKVlpFAemhz_LUVl0&s",
      "extensions": [
        "10 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "10 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJXaW5kb3dzIEFwcGxpY2F0aW9uIERldmVsb3BlciAtIEp1bmlvciIsImh0aWRvY2lkIjoiYU5POEo1RTh4cDBBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVkJGTWtkWFFsUTRSMmN4YjJabVRtWnhjWGhOVVZwdGRXSlJhVWcyTW5wclFuaEhSWEpWZWpVdGRrOVhZMVl3WkdJdFpIaHpOVUp6TW04ellVSkZUVkJsZUdob1lqQmZkREZxTnpkMVRFaEhSazVXY0hkblJWa3paRUYxVWtKblNGbGxVVlZ6VjFWNVJtNDNaekJhY2tJd2NFSktlV05EVm5SMlJYTkxVMTlYU1MxU01UUjNOSEJJZUd3U0ZtRTVNRTFaY1VoNlRtUXRiWEIwVVZCdkxUWlRWVUVhSWtGRWFsZGZNMHhqZWpOTk9VOU9hVEJrYW1KSGRFOVZYMlZHTVVwNU4xUTVZbEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRoZSBNdXNlIiwibGluayI6Imh0dHBzOi8vd3d3LnRoZW11c2UuY29tL2pvYnMva2ZvcmNlL3dpbmRvd3MtYXBwbGljYXRpb24tZGV2ZWxvcGVyLWp1bmlvcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Sr. Software Engineer - Desktop - Slack",
      "company_name": "Slack",
      "location": "Arizona, USA",
      "via": "via Getwork",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\n\nProducts and Technology\n\nJob Details\n\nThe team behind Slack's Desktop Application is looking for a Senior Engineer to join us in building one of the most heavily used pieces of software in the world.\n\nAs a team member, you'll be strategizing, designing and building solutions that lie at the heart of Slack's most used client. You and the team are responsible for a critical layer of infrastructure between Electron – the open source framework that powers our app – and the frontend of Slack. Your work will empower the tens of millions of people that rely on Slack every day. You'll focus on bringing the latest native capabilities to our platform, ensuring consistent integration with the OS, and laying a high-performing foundation for frontend engineers throughout the organization.\n\nWhat You Will Be Doing:\n• Designing and implementing well-tested, scalable, and high performance code impacting millions of users every day.\n• Fixing technical inefficiencies within our code and architecture.\n• Evaluating and implementing new technologies to improve performance and stability across the desktop ecosystem.\n• Part of the team that owns the Desktop application infrastructure, leading its long-term health and expanding on its underlying systems.\n• Assisting our skilled support team and operations team to triage and resolve production issues.\n\nWhat You Should Have:\n• Strong understanding of TypeScript or JavaScript and in depth knowledge of the web ecosystem.\n• You have worked on Electron-based applications.\n• Experience building web or native applications.\n• Understanding of frameworks like React and Redux.\n• Comfort with the shell and a variety of operating systems.\n• The ability to model standard methodologies for unit tests, code review, design documentation, debugging, and troubleshooting\n• Strong interpersonal skills, e.g. ability to convey complex technical concepts to designers, support, and other engineers\n• Excellent communication skills and a collaborative mindset.\n\nBonus points If You Have:\n• You've worked on a native desktop app before and have a strong understanding of the internals of Windows, MacOS or Linux\n• You've written Objective-C or C++ integrating with native APIs\n• You've used Slack and are excited to make it better for millions of users\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.\n\nSalesforce welcomes all.\n\nAs a federal contractor, Salesforce is required to verify that all US-based employees are fully vaccinated against COVID-19. If you receive an offer and are unable to get vaccinated for religious or medical reasons, you may request a reasonable accommodation",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZDRSD0JqHrdp2y-92hNPPPDajGb50n3CKiFEzH-w&s",
      "extensions": [
        "20 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "20 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgLSBEZXNrdG9wIC0gU2xhY2siLCJodGlkb2NpZCI6IkFnYVpIZDZwa2xVQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVZCRk1rZFhRalZOVmtaVGRXNW5ORWRoYTJ4SFUwY3hUWHB3ZW5Ca1YzRklkVlJSYkZsaWRtMXFhMWh3VjBoMmVXSlpSbW8zYUZkbmRrUTRMWEZqWTJScGJHOVJSR0U1WDNSb2FFNUZkM1JzZEZkSllraGFVbUp6Y0dkQ2RGSXdlRWhUVFd0VFYzaEZSWGszVTBScFYxWktPWE4yZHpkYWJFODJMVnB6VEU1YVUwWjBVM0o2U0hkcExWVVNGbUU1TUUxWmNVaDZUbVF0YlhCMFVWQnZMVFpUVlVFYUlrRkVhbGRmTTBsUVRGbHdXSEJRWkc1bGNUUnFTVnBZWjJrd2JFSjRlVGRvTVhjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHZXR3b3JrIiwibGluayI6Imh0dHBzOi8vZ2V0d29yay5jb20vZGV0YWlscy9hNjE4ODIzMGI2ZWM5Y2UxNmYyNDMwYmQ2YmQxZDdmYz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Windows Application Developer - UWP",
      "company_name": "Diverse Lynx",
      "location": "Houston, TX, USA",
      "via": "via LinkedIn",
      "description": "• Experience in developing Web based applications using angular 2 +\n• Experience in designing and developing Windows based applications with Microsoft Universal Windows Platform (UWP), WinForms, WPF, REST API, and C#\n• Implementation knowledge on GRPC (Data Synchronization Framework...\n• Ability to understand business requirements and translate them into technical requirements\n• Strong knowledge and Experience in PL SQL and a relational database, including the design and development of stored procedures (Oracle database preferred)\n• Familiarity with code versioning tools, such as TFS\n• Strong object-oriented design and development skills\n• Ability to work both independently and in a team environment\n\nDiverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQFiGluAatYXN1-7lUuN4PGltUj1Ebz2r49mrx0WxM&s",
      "extensions": [
        "Contractor"
      ],
      "detected_extensions": {
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJXaW5kb3dzIEFwcGxpY2F0aW9uIERldmVsb3BlciAtIFVXUCIsImh0aWRvY2lkIjoieTZYWFVQanVtT2dBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3d3dy5saW5rZWRpbi5jb20vam9icy92aWV3L3dpbmRvd3MtYXBwbGljYXRpb24tZGV2ZWxvcGVyLXV3cC1hdC1kaXZlcnNlLWx5bngtMjg4MzgzNDY4Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Sr. Software Engineer - Desktop Apps",
      "company_name": "Smartsheet Inc",
      "location": "Washington, DC, USA",
      "via": "via USA Job Central",
      "description": "The Desktop Applications team is developing Smartsheet solutions that enable customers to experience Smartsheet as a desktop application on Mac and Windows environments. Our engineering teams are small, efficient, and driven by results. We work in an Agile environment that stays focused on building great software and solutions. Smartsheet is a place where people love what they do and are... empowered to make an impact everyday. We support one another and achieve our goals as a team, not as individuals.\n\nOur team rewards ownership, transparency, and collaboration. You will report to an Engineering leader based from our Bellevue, WA office and will have the option to work remotely from any Smartsheet registered location within the United States. Learn more about Smartsheet platform here: Smartsheet Overview Video\n\nYou will:\n• Participate in the entire development life cycle, from concept to release\n• Implement new features and improve the ones we have already built\n• Write clean and efficient code based on product specifications and participate in all phases of quality assurance and defect resolution\n• Develop and maintain CI/CD pipeline implementations\n• Work closely with other software engineers, partner teams, SRE, and product managers\n\nYou have:\n• 5+ years for Sr Engineers software development experience\n• Knowledge of professional software engineering best practices for the full software development life cycle including coding standards, code reviews, source control management, build processes, deployment, testing, operations, and monitoring\n• Experience building scalable back-end services\n• Experience building REST based APIs\n• Legally eligible to work in the U.S. on an ongoing basis\n• BS or MS in Computer Science, a related field, equivalent industry experience, or equivalent educational experience.\n• HSA, 100% employer-paid premiums, or Buy-up medical/vision and dental coverage options for full-time employees\n• Equity - Restricted Stock Units (RSUs) with all offers\n• Lucrative Employee Stock Purchase Program (15% discount)\n• 401k Match to help you save for your future (50% of your contribution up to the first 6% of your eligible pay)\n• Monthly stipend to support your work and productivity\n• Up to 24 weeks of Parental Leave\n• Personal paid Volunteer Day to support our community\n• Opportunities for professional growth and development including access to LinkedIn Learning online courses\n• Company Funded Perks, including a counseling membership, primary care membership, local retail discounts, and your own personal Smartsheet account\n• Teleworking options from any registered location in the U.S. (role specific)\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports, and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job description-if your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovative-join us",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5wLEsTIgfGdjRk4thv7ljjAU72RuU9HLgufBf&s=0",
      "extensions": [
        "25 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "25 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgLSBEZXNrdG9wIEFwcHMiLCJodGlkb2NpZCI6InAzWEtVNjU4R1NFQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVZCRk1rZFhRMGxXVGpSNlIxaERVMlJUVlVGZmVYVXRPVGRQYjFOSFNWSk9UbVZLZVhSNmQySlNTSGhZWVVKU2NYZDZaVEpUY3pCcWNGUlhhalZIYzA1UlpGSkNUMmd0WVdOYVltTnpaMWN6TURkb0xXaGtSWFZCVFRsSFRrcFRhRTlHVjFobVVsZDZkV2RmZGw5ME5YcFpVMDlMV0dWdk1YRm5ablZrUmxndE1uUnpabmhrVW1kRVdqTjZaRUZwYUhKWmJuVlBYelJzUmpsWWFucDRYelpCRWhaaE9UQk5XWEZJZWs1a0xXMXdkRkZRYnkwMlUxVkJHaUpCUkdwWFh6TkpZMU5vU0hkTFpIWm5iall0VjBrM1RsZExOazkwVm5wMmVrNTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFVTQSBKb2IgQ2VudHJhbCIsImxpbmsiOiJodHRwczovL3d3dy51c2Fqb2JjZW50cmFsLmNvbS9qb2Ivc3Itc29mdHdhcmUtZW5naW5lZXItZGVza3RvcC1hcHBzLWluLXdhc2hpbmd0b24td2FzaGluZ3Rvbi1kYy81ODM2LTE0NzA3NDc2MDBEMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Support",
      "company_name": "Marathon TS",
      "location": "Merrifield, VA",
      "via": "via Adzuna",
      "description": "Job Description Desktop Support Arlington VA - Onsite Marathon TS is seeking a Desktop Support Technician to support a program at the Pentagon. In order to be considered for this position, candidates will be required to work onsite. Essential Functions Provide on-site support for the Integration and Technology Division, functional CIO, and Unit IT Requirements Officer in planning and executing support for SAF/IA's information sharing and collaboration needs Support newcomer and recurring training to users on applicable sites and tools, desktop applications, and other hardware as necessary Support IT hardware installation, maintenance, and break-fix support, including COTs desktop, laptop, and notebook computers, tablet PCs, scanners, printers, docking stations, and other computer peripheral equipment and accessories Provide support for COTS desktop and laptop operating and application software to include Microsoft Windows OS like Windows 10 and any legacy MS Windows OS, MS Office... suite of applications, Internet browsers, Adobe Acrobat Professional, scanning software, antivirus software, and any other software applications that can be installed on Windows OS Support for NIPRNET, SIPRNET, remote desktop, CITRIX, CISCO client support, Oracle database support, online meeting/conference support, SAF/IA website and SharePoint administration and maintenance, network outage issues, and any other network support issues as required Support communications equipment installment, maintenance, and break-fix support, including telephones to include VOIP phones, iPhones, Blackberries, facsimile, WAN access point equipment, and other communications equipment and mobile devices as required Qualifications Bachelor's degree with a desired emphasis in IT, computer science, or related curriculum Active SECRET security clearance required CompTIA Security certification with CE preferred or at a minimum IAT Level I Experience with CMMI ML3 Experience with ISO/IEC 2000 Expertise in various IT disciplines, including but not limited to: CM, requirements management, IT break-fix, and maintenance procedures, and help desk support All newly hired employees are required to be fully vaccinated against COVID-19 (two weeks after the last required dose) as a condition of employment or obtain approval of a medical or religious exemption prior to their start date. Proof of an exemption or vaccination status will be required during the pre-employment onboarding process. New employees who obtain an exemption from the vaccine mandate for medical or sincerely held religious beliefs will still be subject to the weekly testing requirement. Vaccinated employees and employees with a medical or religious exemption will complete the attestation online on their first day of employment or shortly thereafter. #cjjobsMarathon TS is committed to the development of a creative, diverse and inclusive work environment. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at Marathon TS will be based on merit, qualifications, and abilities. Marathon TS does not discriminate against any person because of race, color, creed, religion, sex, national origin, disability, age or any other characteristic protected by law (referred to as \"protected status ",
      "extensions": [
        "Full-time"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQiLCJodGlkb2NpZCI6IlRzZnp5NHNROVJBQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRblEyVTBkV1JVTXRkVzVaT1ZCRWRWQk5MWE5rZUhaV1JYRlNZVGQ1YTE5UE56SmxlVFZ2YkVJMVVVbGZXbE5PTkhSTFZYTXdPVkpvU0U1bldtMTBWa3AyTjBzeUxWazBTblU0Y1hRNU1sQllkVlV0UW05aFVpMTZjVjg0UjJOM1VrRjVhSGRPUTBWMVVtVm9NVEZqUlVGc01HRlRORWhLVWpab1NFWTNVRWxFY2xSUllXUkJlbXROZEdKd2NrNUlVRVZQWkhJek5GUlpjV3gzRWhjM2RYTk5XWFZpTkVjMk0wNTVkRTFRYVhaNVdIVkJWUm9pUVVScVYxOHpTWFpqYVRKNlYzTmFiR2xPVVVSaWVHRjZRa1V6YXkxTGJFVkxRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWR6dW5hIiwibGluayI6Imh0dHBzOi8vd3d3LmFkenVuYS5jb20vZGV0YWlscy8yNzg2ODY0NjA2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Sr. Software Engineer - Desktop Apps",
      "company_name": "Smartsheet Inc",
      "location": "Washington, DC",
      "via": "via USA Job Central",
      "description": "The Desktop Applications team is developing Smartsheet solutions that enable customers to experience Smartsheet as a desktop application on Mac and Windows environments. Our engineering teams are small, efficient, and driven by results. We work in an Agile environment that stays focused on building great software and solutions. Smartsheet is a place where people love what they do and are... empowered to make an impact everyday. We support one another and achieve our goals as a team, not as individuals.\n\nOur team rewards ownership, transparency, and collaboration. You will report to an Engineering leader based from our Bellevue, WA office and will have the option to work remotely from any Smartsheet registered location within the United States. Learn more about Smartsheet platform here: Smartsheet Overview Video\n\nYou will:\n• Participate in the entire development life cycle, from concept to release\n• Implement new features and improve the ones we have already built\n• Write clean and efficient code based on product specifications and participate in all phases of quality assurance and defect resolution\n• Develop and maintain CI/CD pipeline implementations\n• Work closely with other software engineers, partner teams, SRE, and product managers\n\nYou have:\n• 5+ years for Sr Engineers software development experience\n• Knowledge of professional software engineering best practices for the full software development life cycle including coding standards, code reviews, source control management, build processes, deployment, testing, operations, and monitoring\n• Experience building scalable back-end services\n• Experience building REST based APIs\n• Legally eligible to work in the U.S. on an ongoing basis\n• BS or MS in Computer Science, a related field, equivalent industry experience, or equivalent educational experience.\n• HSA, 100% employer-paid premiums, or Buy-up medical/vision and dental coverage options for full-time employees\n• Equity - Restricted Stock Units (RSUs) with all offers\n• Lucrative Employee Stock Purchase Program (15% discount)\n• 401k Match to help you save for your future (50% of your contribution up to the first 6% of your eligible pay)\n• Monthly stipend to support your work and productivity\n• Up to 24 weeks of Parental Leave\n• Personal paid Volunteer Day to support our community\n• Opportunities for professional growth and development including access to LinkedIn Learning online courses\n• Company Funded Perks, including a counseling membership, primary care membership, local retail discounts, and your own personal Smartsheet account\n• Teleworking options from any registered location in the U.S. (role specific)\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports, and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job description-if your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovative-join us",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5wLEsTIgfGdjRk4thv7ljjAU72RuU9HLgufBf&s=0",
      "extensions": [
        "26 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance"
      ],
      "detected_extensions": {
        "posted_at": "26 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgLSBEZXNrdG9wIEFwcHMiLCJodGlkb2NpZCI6InAzWEtVNjU4R1NFQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRMWhTYlV0bFZGQkNXVzVvVmpWS1dqUjZkMmMxWkhGWlduVkxVV28wUTNWbUxYWlFRekp3UmxJMFFWSnhSbE4wTVRoekxXaERlRU5HWDJoa2RrbFhTSFZJZG5OTVdXZHNSblJOVDBOTU0yOWpaelJxZG5OaVJreDBiMk5qYUdOclRWOXVOSEJYWHpSRVVXNTJTVk0yTkRZdFRuZEhjbVYzVDE4NWFFOTRXWFZCTlZseVZUZEphMlZ2UnkxaFkxQjBkRkJmVVV0Nk9ERnhkMnRSRWhjM2RYTk5XWFZpTkVjMk0wNTVkRTFRYVhaNVdIVkJWUm9pUVVScVYxOHpTazFDUkdNMmEyYzBjbTh4TkRWcFMySkhiR2RpWkdOWk1YQlZkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVVNBIEpvYiBDZW50cmFsIiwibGluayI6Imh0dHBzOi8vd3d3LnVzYWpvYmNlbnRyYWwuY29tL2pvYi9zci1zb2Z0d2FyZS1lbmdpbmVlci1kZXNrdG9wLWFwcHMtaW4td2FzaGluZ3Rvbi13YXNoaW5ndG9uLWRjLzU4MzYtMTQ3MDc0NzYwMEQwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Windows Application Developer - Junior",
      "company_name": "Kforce",
      "location": "Fort Collins, CO",
      "via": "via The Muse",
      "description": "Responsibilities\n\nKforce has a client that is seeking multiple Windows Application Developers - Junior for an enterprise client who is looking to bring new ways for their gaming community to interact with each other on a remote basis. This role is remote right now due to COVID-19.Summary:This exciting opportunity will enable a Windows Developer to join a team of engineers that are creating... maintaining and enhancing this large gaming platform to their customers. Right now, they are making tweaks and enhancements to current features, but they are also looking to add in some new elements to help the gaming community interact with social media. This application is one of the top gaming applications in the app store!In this role as a Windows Application Developer, you'll be joining a great team of fellow visionaries - a development team whose mission is to design some of the most exciting, gamer-focused applications and products on the market. We'll look to you to not only analyze what works well, but have you help us our products and applications work better, cleaner, faster, stronger, and more attuned to gaming-focused tech lovers.Kforce offers a robust benefit package which includes medical, dental and vision. We also offer career development courses, employee discount programs and consultant recognition. While on assignment at this customer you will also have access to our PTO program as well as paid holidays. If you are interested in this position, please apply ASAP.\n\nSkills\n• 2-3 years of development experience\n• Experience working with Win32 and/or UWP\n• C# experience (with some Java experience)\n• Highly motivated and eager to learn and contribute to a fast-paced team\n• Experience working on desktop applications\n• Experience working in an agile environment\n• Able to work with a fast-paced team, great communicator\nNice to Have:\n• Mobile Application experience (iOS or Android)\n• Prism experience\n• Passion and/or gaming enthusiast\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n\nKforce is a professional staffing services firm offering Technology and Finance & Accounting jobs with top employers nationwide. We specialize in providing contract, contract-to-hire and direct placement opportunities, with over 50 years of experience in the staffing industry. Kforce offers many consultants comprehensive benefits depending on employment status, including medical, dental, 401(K), life insurance and disability. Our vision is to be \"the firm most respected by those we serve",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQQ4qSV-TpV9gSI76GfTkxlARWqNp7hIKyVX1HaALaKVlpFAemhz_LUVl0&s",
      "extensions": [
        "11 days ago",
        "Full-time",
        "No degree mentioned",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "11 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJXaW5kb3dzIEFwcGxpY2F0aW9uIERldmVsb3BlciAtIEp1bmlvciIsImh0aWRvY2lkIjoiYU5POEo1RTh4cDBBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVkJGTWtkWFFYRklURkJmU0hKVk1FbGphelpOWDJkdmRtTmhlVmhmZDJ4NlZIVjRSRnA1VEV0aFFVWnFPRTlLV2pSVlVFNUJZV3RUYlRGbGFYZHBWMmxuVjFNd2MwcE5ialZFVTA4ME9WQkxOVmhvWjJaSldWcHZUV2R0TkZndFZFdG1aVVp1UzFsUlNURlFPVlp1ZW5CUmJFSlNNVmgzWHpRNGFqTkhlbG8zWWtaa1dtMWFVVWg0YzNrU0Z6ZDFjMDFaZFdJMFJ6WXpUbmwwVFZCcGRubFlkVUZWR2lKQlJHcFhYek5NYVVGYWNrcFdjelZuTVRORFNERnRYMUp1VFV0M2NEUTRhVlIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUaGUgTXVzZSIsImxpbmsiOiJodHRwczovL3d3dy50aGVtdXNlLmNvbS9qb2JzL2tmb3JjZS93aW5kb3dzLWFwcGxpY2F0aW9uLWRldmVsb3Blci1qdW5pb3I/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Desktop Java Developer",
      "company_name": "Tata Consultancy Services",
      "location": "Wright, AR",
      "via": "via AllJobs",
      "description": "Location: Remote / Work from Home\n\nRequirements...\n• Minimum 2+ years of experience in Java Development / JEE\n• Strong hands-on experience in Java (11), Spring Boot, Angular, Mongo, Java Microservice Infrastructure Tools, Microservice Architecture Pattern, REST API\n• Knowledge and experience in Scrum/Agile methodologies\n• Independent and highly motivated individual with high impact communication and great problem-solving skills\n• Great leadership skills and equivalent experience\n• Fluent English\n\nMust-Have Skills\n• Programing experience with Java with an understanding of OOP, Java EE\n• Knowledge of web application development using JavaScript, HTML and CSS\n• Spring, REST Services, Microservices, AWS, SQL\n\nWork Authorization\n• US Citizen or a Green Card Holder is a Must\n• H4 Visa\n\nBenefits\n• Medical and Insurance benefits\n• Annual Bonus\n• Joining Bonus (depends upon project)\n• 401(k) Plan\n• 10 days Paid Holidays\n\nEducation\n\nBS or MS in one of the following\n• Computer Science (CS)\n• Computer Engineering (CE)\n• Information Technology (IT)\n• Information Systems (IS)\n• Electrical Engineering (EE)\n• Informatics of Software Engineering, other related majors.\n• Cumulative GPA 3.0 or higherA\n\nRemote till COVID and then should be flexible to relocate.\n\n\"Java/J2EE\",\" Solution Design\", \"Spring Boot\", \"Web Services\", \"Oracle",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRRa2_AOgUmWnyP8AaoXm2o-DiCWlYCXIPVqR1T&s=0",
      "extensions": [
        "13 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "13 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEphdmEgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJ6dlpZTDZvRlFOa0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUkZOWFVHRXhhREJ5UkZFMlltZG1ZV3hqTUhaZmREVXlWbFptTldsM00wWmFPRFpJZWxaekxVTjNRbUY2WlVsVk5ISkxSRzlsWVdjelRXMWtlR1ZSUmpBMWVYTnZhalpwTldabWRVcHpkSEkzTm5oa1pHNXFWME5sWVUxTVlUQk1kSFUxVkZJNVZITmxhRFE1ZG1GVWNWY3RNbXRFU25aWGVWZGlhalZOUlVSalJTMW5TMnQ1Ukhkb1NIazFTM2xFWWtGQmJscERWVFZTYWxselZrdHBTRVI1U2tNeFR6ZE1RVTgyUzJacU5FNWxTbTVpYjJKR016UlZUbU5CYUVselRFRmxYMmhPRWhjM2RYTk5XWFZpTkVjMk0wNTVkRTFRYVhaNVdIVkJWUm9pUVVScVYxOHpTWE5ZT0RJMlRsOWxOakJEYlZCd1ZYWk5VekpoVDFKUmJ5MDNkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWxsSm9icyIsImxpbmsiOiJodHRwczovL2FsbGpvYnMuYWkvam9icy9saXN0aW5nL3RhdGEtY29uc3VsdGFuY3ktc2VydmljZXMtZGVza3RvcC1qYXZhLWRldmVsb3Blci13cmlnaHQtYXJrYW5zYXMtNjFmOGNkZGUzOTU5MTYwNTJhNDE0M2Q1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Desktop, Applications",
      "company_name": "Custom Group Companies",
      "location": "New York, NY",
      "via": "via BeBee",
      "description": "We are looking for a Desktop Application and Mobile Support Manager for our client located in New York City.\n\nNote: Selected individual should have previous experience working in a law firm or in a legal department...\n\nThis is a Direct Hire position, with great salary and benefits (up to 175k)\n\nThis position will be remote until Jan 2022 and then will require you to work onsite 100% in New York City\n\nLooking for Candidates that live in a Commutable Distance to New York City\n\nPlease email your resume in a WORD doc to [Email available when viewing the job]\n\nThe Desktop, Application and Mobile Support Manager is responsible for managing and overseeing all technology operations for the Desktop, Applications, Mobility and Conferencing Technology Services teams, with focus on high level customer service, responsiveness to business needs and devising and establishing IT policies to support the needs of the firm.\n\nDesktop & Mobility Services - deploys and supports all end points, 2nd level support for all applications, mobile device configuration and remote access support.\n\nConferencing Technology - design, implementation and delivery of all conference room technology, audio, video and web conferencing setup and support.\n\nAbility to work independently and ensure availability at all times in a customer centric, high service level and continually evolving environment.\n\nWork closely with Help Desk Manager to manage escalations and tickets.\n\nReporting Structure:\n\nThe Desktop, Application, and Mobile Support Manager will report directly to the Director of User Support and Education\n\nPrincipal Duties and Responsibilities\n• Planning, execution and support of end points and conference technology deployments for the firm.\n• Maintain the highest level of customer support for the customer base through proactive management and implementation of continuous improvement initiatives; provide high-touch white-glove service\n• Provide technical and business leadership, mentorship and support to the team.\n• Oversee operations of second level escalations by creating a business focused and responsive environment for quick turnaround and resolution.\n• Act as a key interface to the Desktop & Mobility Services, Conferencing Technology Services, Infrastructure, Applications development and other departments throughout the firm.\n• Work effectively, efficiently and collaboratively with others throughout IS and the firm to deliver the objectives of the department and the firm.\n• Formulate performance plans and provide regular feedback throughout the year to direct reports.\n• Oversee and guide professional development and coaching for team members with an emphasis on acquiring soft skills and business focus in addition to technical knowledge.\n• Metrics and Reporting - Responsible for reporting on groups KPIs. Develops process for regular metric analysis and reporting. Review performance metrics with leadership and stakeholders. Makes recommendations for performance improvement based on metric data.\n• Process Improvement Regularly reviews support processes and works to streamline and automate where applicable. Seeks to expand overall services provided to users and looks for opportunities to shift routine work from other technology teams to the desktop support team when possible. Responsible for the IT Service Management (ITSM) tools, including implementation and automation of service and support processes'.\n• Knowledge Management - Ensures that knowledge is captured in the appropriate context, is accurate and published timely for use within the Desktop Support team and other operational teams with a focus on improving service delivery to customers. Coaches Desktop Support Team on the knowledge management workflow. Works with second and third level teams and facilitates appropriate knowledge capture and training.\n\nPosition Specific Skills and Requirements\n• Bachelor's degree, and/or a minimum of three year's managerial level experience in related systems support preferably in a law firm environment.\n• ITIL service delivery qualification foundation level preferred.\n\nEducation and General Requirements\n• Attributes expected of all candidates include: responsibility, honesty, reliability, initiative, patience, attention to detail, determination, taking pride in one's work, and a desire to learn.\n• Interpersonal skills necessary to interact and work productively as part of the Information Systems team, delivering high quality services to the Firm and our clients.\n• Ability to meet deadlines and effectively complete operational and project based assignments.\n• Ability to communicate effectively, in person and in writing, with Firm personnel at all levels and outside parties as necessary.\n• Ability to work independently.\n• Attendance Requirements:\n• On site during normal working hours and available as necessary before or after normal working hours to work at the Firm, over the telephone, or at off-site meetings, in order to meet the demands of the job and the needs of the Firm.\n• Expected to carry a wireless email device and respond when necessary",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSERNIV6KuLymkaz4fFHaJdfD6jYfTpN3UK8UpnTinDtKuvicWA9RLxA&s",
      "extensions": [
        "5 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "5 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wLCBBcHBsaWNhdGlvbnMiLCJodGlkb2NpZCI6IjUzUFhMeXRDTy1jQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVZCRk1rZFhSR3BNWjNaSk1GUk1Oa3B4T1hGc0xWZDNjMVYyY2xsUlVuWlNWek5WWWxwaU5FSmlRVXcwVFZGV2VHTjJOMVJMWkRGVE5HbEJabE4wYW05U2RGTndOR3R5Ylc4NFEyRmxYMUpFVmpGS2RGUlpiMnBYUmpSaFJtTnZaVEE1VDNSWlZ6RlhXVGRMWTBKNmJWVm1Sek5OT0RWMmIzTm1XRk5pYkd0TmNsQnVSVVE1Y1U1WE9FNDNUVWxqUTNSeFdFRk5Ta0p6Y2tKZlEycDRNVFpCWm1jeWFqbHZlRUZXUVRWMU1sZHVlVkY0YjBwck0wOTVVMHhDWkVGWlZHNXdMVmRJUkVsR2VGbFZFaGMzZFhOTldYVmlORWMyTTA1NWRFMVFhWFo1V0hWQlZSb2lRVVJxVjE4elRITmFUVVZCTWxnNGEwRkxlVjgxTW1kcU1WQkRSVjg1Tm1relVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3VzLmJlYmVlLmNvbS9qb2IvMjAyMjAyMTEtMDgxYzMxZWRhYzE1MzhlMjJiZDY0YWI2OTNlYTAwODk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Windows Application Developer - UWP",
      "company_name": "Diverse Lynx",
      "location": "Houston, TX",
      "via": "via LinkedIn",
      "description": "• Experience in developing Web based applications using angular 2 +\n• Experience in designing and developing Windows based applications with Microsoft Universal Windows Platform (UWP), WinForms, WPF, REST API, and C#\n• Implementation knowledge on GRPC (Data Synchronization Framework...\n• Ability to understand business requirements and translate them into technical requirements\n• Strong knowledge and Experience in PL SQL and a relational database, including the design and development of stored procedures (Oracle database preferred)\n• Familiarity with code versioning tools, such as TFS\n• Strong object-oriented design and development skills\n• Ability to work both independently and in a team environment\n\nDiverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQFiGluAatYXN1-7lUuN4PGltUj1Ebz2r49mrx0WxM&s",
      "extensions": [
        "Contractor",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJXaW5kb3dzIEFwcGxpY2F0aW9uIERldmVsb3BlciAtIFVXUCIsImh0aWRvY2lkIjoieTZYWFVQanVtT2dBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3d3dy5saW5rZWRpbi5jb20vam9icy92aWV3L3dpbmRvd3MtYXBwbGljYXRpb24tZGV2ZWxvcGVyLXV3cC1hdC1kaXZlcnNlLWx5bngtMjg4MzgzNDY4Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Ubuntu Desktop Software Engineer",
      "company_name": "Canonical - Jobs",
      "location": "New York, NY",
      "via": "via Tarta.ai",
      "description": "The Ubuntu Desktop Team is responsible for delivering Ubuntu Desktop, which is one of the most popular Linux operating systems available for desktops today. Ubuntu strives to be the best free software operating system in existence. Along with delivering Ubuntu Desktop, the team is also charged with leading the way in the application ecosystem necessary for external app developers to bring high... quality applications to the Linux desktop.\n\nWe are seeking a Software Engineer to join the Ubuntu Desktop Team to build the best open source operating system in the world. Candidates should have engineering experience with two or more of Ubuntu Desktop, Flutter, Dart, GNOME, GTK, Python, Go, C, Debian or Snap packaging.\nWhat you’ll do\n• Collaborate proactively with a distributed team\n• Write high quality code to create new features\n• Debug issues and produce high quality code to fix them\n• Review code produced by other engineers\n• Discuss ideas and collaborate on finding good solutions\n• Work from home with global travel 2 to 4 weeks for internal and external events\nWho you are\n• You love technology and working with brilliant people\n• You are curious, flexible, articulate, and accountable\n• You value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n• You have a Bachelor’s or equivalent in Computer Science, STEM or similar degree\n\nCanonical is proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background lead to a better environment for our employees and a better platform for our users and customers",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSoKDCZKH0kclmwL6klD-d5SYdjz7GfCgjQMw9u&s=0",
      "extensions": [
        "Full-time"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJVYnVudHUgRGVza3RvcCBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiTFhPcEZEODdadzhBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFFrcFJTMWROVm5CRmR6bEJRbHB6VW1oV1JDMWtTR2R6U0hVMlYzbzJORkJoUmpGTlZubDBkMDFRVUd3eVJ6VkhNM1pSY3poa1pTMUdhMlpyYTFaRFZtZG9UVTlITmw5WVQzYzFRbVJFU2pSdGRGSnRjM05wWDAxMVNXWmlWVFZtWW5rMU5uVmZVRXhoTFRnMk4ybG5aMU5GZW5GTU5FSlBOMmxpYVZGclIxTmFXR3RoVlZwcE0xSkxaalpOU1VoRU1rMU9MV2RzUTFjelFWWnNibFp4TlVaUVVsUTVMVTk2ZFVGU1MyMUdOV1ozRWhjM2RYTk5XWFZpTkVjMk0wNTVkRTFRYVhaNVdIVkJWUm9pUVVScVYxOHpTMGRqZVZvNFNXSm1NRE0yTkVWWFdFMHlUa2xuWlROcU5sZDRadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGFydGEuYWkiLCJsaW5rIjoiaHR0cHM6Ly90YXJ0YS5haS9qL28xcDlBSDRCV1hMNHh0UzdNUlFxLXVidW50dS1kZXNrdG9wLXNvZnR3YXJlLWVuZ2luZWVyLWluLW5ldy15b3JrLWNpdHktbmV3LXlvcmstdW5pdGVkLXN0YXRlcy1ueS1hdC1jYW5vbmljYWwtam9icz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Java Developer",
      "company_name": "Tata Consultancy Services",
      "location": "PRS, DC",
      "via": "via AllJobs",
      "description": "Location: Remote / Work from Home\n\nRequirements...\n• Minimum 2+ years of experience in Java Development / JEE\n• Strong hands-on experience in Java (11), Spring Boot, Angular, Mongo, Java Microservice Infrastructure Tools, Microservice Architecture Pattern, REST API\n• Knowledge and experience in Scrum/Agile methodologies\n• Independent and highly motivated individual with high impact communication and great problem-solving skills\n• Great leadership skills and equivalent experience\n• Fluent English\n\nMust-Have Skills\n• Programing experience with Java with an understanding of OOP, Java EE\n• Knowledge of web application development using JavaScript, HTML and CSS\n• Spring, REST Services, Microservices, AWS, SQL\n\nWork Authorization\n• US Citizen or a Green Card Holder is a Must\n• H4 Visa\n\nBenefits\n• Medical and Insurance benefits\n• Annual Bonus\n• Joining Bonus (depends upon project)\n• 401(k) Plan\n• 10 days Paid Holidays\n\nEducation\n\nBS or MS in one of the following\n• Computer Science (CS)\n• Computer Engineering (CE)\n• Information Technology (IT)\n• Information Systems (IS)\n• Electrical Engineering (EE)\n• Informatics of Software Engineering, other related majors.\n• Cumulative GPA 3.0 or higherA\n\nRemote till COVID and then should be flexible to relocate.\n\n\"Java/J2EE\",\" Solution Design\", \"Spring Boot\", \"Web Services\", \"Oracle",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRRa2_AOgUmWnyP8AaoXm2o-DiCWlYCXIPVqR1T&s=0",
      "extensions": [
        "15 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "15 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEphdmEgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJydHVfR05HZWhzMEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUVV4QlZqSkNNMmx0ZDI1RFFtdGFiMHAzV2pkbU1uSTVMVGxoU2t0MVdGcHdaMWhWUTNSYVpYcHhNMTlOYmtSc1ozVm1TblJHVjNFM2JVRkxZbmx1VDJ0TU1qSklTbWswY0VFeldUTkdXVmx5WTB4alVHZHFXRkV5VGtNeVZWbFFabmh2TjJWRWFrOW5WVUl0UWpkTU1HVTRSa1Z6UTBWdmNURlNZMGx3YVhsbFdXWnNhbFpSV25KRlgyVkJUbFY2WlZGV00yOTZValUzY1RCTGMwRk1jbVZ5VEhCTk4wUXlaVTFzYTFaNU5raGFkVzV0WmpKcVEyaDVaREJRTFc1WGRuaEtNVXBIRWhjM2RYTk5XWFZpTkVjMk0wNTVkRTFRYVhaNVdIVkJWUm9pUVVScVYxOHpTakp3V0ZsMlJUWnJPSE13UkVaVlVVcGlNME5NZW1oYVdsWXhVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWxsSm9icyIsImxpbmsiOiJodHRwczovL2FsbGpvYnMuYWkvam9icy9saXN0aW5nL3RhdGEtY29uc3VsdGFuY3ktc2VydmljZXMtZGVza3RvcC1qYXZhLWRldmVsb3Blci1wYXJjZWwtcmV0dXJuLXNlcnZpY2UtZGMtNjFmOGNkZTAyMmNlMjQwNTM2YTE2YmRlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "C++ Windows Application Developer",
      "company_name": "Mitchell Martin",
      "location": "Portland, OR",
      "via": "via Jobs.com",
      "description": "Description Our client is seeking a C Windows Application Developer. Location: Portland, OR Position Type: Right to Hire Job Description: Are you a strong windows application developer who's looking to build something that's redefining the desktop? We're creating the next generation of a product that redefines how users Client and manage their desktop software. We're a very independent part of a... big company so it's the best of both worlds - a fast-moving secure environment. We've already got millions of current users, and are on Client to have tens of millions of users before the end of the year. Everyone you know will be using and loving this software that you helped create. Need to have experience building real-world windows applications. This app will be used by millions of people, so you have to have a proven track record of building high quality, high performance applications. There's also back-end infrastructure that's a part of the system so that experience is a plus. The rest of our core infrastructure is all SOA, built in Java and MySQL, running on Linux. This position can be either contract-to-hire or full time - we're flexible. The position is located in downtown Portland, blocks from Pioneer Square. Requirements: Required experience: - Building a commercial windows application - Working on Internet-enabled application Required skills: - C and C# - MFC and .NET - MySQL - XML and DOM processing - Visual Studio Preferred but not required skills: - Managing and controlling VMware instances - Java/Linux development - System utility programming - Installers and automation - Cross platform development experience",
      "extensions": [
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJDKysgV2luZG93cyBBcHBsaWNhdGlvbiBEZXZlbG9wZXIiLCJodGlkb2NpZCI6IlZBOTFqRGJWOHVJQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icy5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuam9icy5jb20vZW4tdXMvam9icy9jd2luZG93cy1hcHBsaWNhdGlvbi1kZXZlbG9wZXItcG9ydGxhbmQtb3ItLTA2Yjc1N2UxLTQ3MzYtNDAxYi04YmM2LWI0Zjg5MTcxZTMyYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Application Developer with leading eye-tracking tech fir",
      "company_name": "CyberCoders",
      "location": "Mesa, AZ",
      "via": "via Tarta.ai",
      "description": "Desktop Application Developer with leading eye-tracking tech fir We're a venture-backed high tech company building cutting edge hardware and software that is changing the way the world interacts with technology. Now we're embarking on an exciting new journey that requires some of the best minds in software development. Think that might be you?\nWhat You Will Be DoingWhat You'll Be Doing\n...\nWere building a whole new ambitious experience utilizing an exciting technology thats so cutting edge we cant mention it in a job posting. Youll initially be converting an existing application to another framework that will lay the foundations for a paradigm shift in user interface. Youll be responsible for scaling the software to integrate system-wide, proprietary technologies, and future technologies.\n\nEssential Skills:\n\nÏMid-level experience with Unity 3D\nÏExtensive C#/.Net programming experience (4+ years)\nÏExtensive knowledge of desktop application development\nÏMVVM and data binding development experience, preferably in WPF or strong experience with adjacent paradigms (i.e. MVP/MVC, Silverlight/UWP)\nÏExperience with XAML-based application development\nÏExperience balancing efficiency and reliability with a reasonable deadline\n\nBonus Experience:\n\nÏWriting libraries for reuse\nÏTest-driven development\nÏExperience with C++\nÏExperience with UI/UX\nWhat You Need for this Position- Unity 3D\n- C#\n- .NET\n- MVVM\n- Desktop Application Developer\nSo, if you are a Desktop Application Developer with leading eye-tracking tech fir with experience, please apply today! Or, if you prefer, please send along your resume and application to kyle.westhorpe@cybercoders.com.\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Kyle Westhorpe\n-\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhOqMj01kyhagxjN0oQJlous-x6_WGmG-2af_uX20&s",
      "extensions": [
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEFwcGxpY2F0aW9uIERldmVsb3BlciB3aXRoIGxlYWRpbmcgZXllLXRyYWNraW5nIHRlY2ggZmlyIiwiaHRpZG9jaWQiOiJnY2c4WTlTUzEwb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRhcnRhLmFpIiwibGluayI6Imh0dHBzOi8vdGFydGEuYWkvai9jUVBBd1gwQldYTDR4dFM3TTZHMS1kZXNrdG9wLWFwcGxpY2F0aW9uLWRldmVsb3Blci13aXRoLWxlYWRpbmctZXllLXRyYWNraW5nLXRlY2gtZmlyLWluLW1lc2EtYXotYXQtY3liZXJjb2RlcnM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Desktop Support",
      "company_name": "Marathon TS",
      "location": "Merrifield, VA, USA",
      "via": "via Adzuna",
      "description": "Job Description Desktop Support Arlington VA - Onsite Marathon TS is seeking a Desktop Support Technician to support a program at the Pentagon. In order to be considered for this position, candidates will be required to work onsite. Essential Functions Provide on-site support for the Integration and Technology Division, functional CIO, and Unit IT Requirements Officer in planning and executing support for SAF/IA's information sharing and collaboration needs Support newcomer and recurring training to users on applicable sites and tools, desktop applications, and other hardware as necessary Support IT hardware installation, maintenance, and break-fix support, including COTs desktop, laptop, and notebook computers, tablet PCs, scanners, printers, docking stations, and other computer peripheral equipment and accessories Provide support for COTS desktop and laptop operating and application software to include Microsoft Windows OS like Windows 10 and any legacy MS Windows OS, MS Office... suite of applications, Internet browsers, Adobe Acrobat Professional, scanning software, antivirus software, and any other software applications that can be installed on Windows OS Support for NIPRNET, SIPRNET, remote desktop, CITRIX, CISCO client support, Oracle database support, online meeting/conference support, SAF/IA website and SharePoint administration and maintenance, network outage issues, and any other network support issues as required Support communications equipment installment, maintenance, and break-fix support, including telephones to include VOIP phones, iPhones, Blackberries, facsimile, WAN access point equipment, and other communications equipment and mobile devices as required Qualifications Bachelor's degree with a desired emphasis in IT, computer science, or related curriculum Active SECRET security clearance required CompTIA Security certification with CE preferred or at a minimum IAT Level I Experience with CMMI ML3 Experience with ISO/IEC 2000 Expertise in various IT disciplines, including but not limited to: CM, requirements management, IT break-fix, and maintenance procedures, and help desk support All newly hired employees are required to be fully vaccinated against COVID-19 (two weeks after the last required dose) as a condition of employment or obtain approval of a medical or religious exemption prior to their start date. Proof of an exemption or vaccination status will be required during the pre-employment onboarding process. New employees who obtain an exemption from the vaccine mandate for medical or sincerely held religious beliefs will still be subject to the weekly testing requirement. Vaccinated employees and employees with a medical or religious exemption will complete the attestation online on their first day of employment or shortly thereafter. #cjjobsMarathon TS is committed to the development of a creative, diverse and inclusive work environment. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at Marathon TS will be based on merit, qualifications, and abilities. Marathon TS does not discriminate against any person because of race, color, creed, religion, sex, national origin, disability, age or any other characteristic protected by law (referred to as \"protected status ",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQiLCJodGlkb2NpZCI6IlRzZnp5NHNROVJBQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRVEpPYlhKVFJYQnlVamwyT1RGV2RUTmhRMlZZTVY5ak5sOXVjMDU0WXkxd1p6SXpZbmQ1UzBnM1lXMTJRazFGY2tSdVRtaFNVblZLYVhGTU0zUlRWeTB5ZERCTldsUkRPVU5IV1hsWWIxOHRXbk5XWTJkRlMwWklVWEZTU1cxZkxYZDJla3hSVFZCRVQzWklNMFpmY0dOdlRGRm5iSEZUWWpsNFkyUlBVakJOYUdOTFlrOTJWalZYY2sxbGFHWkNka3cxVDJkelpraFFWM0ozRWhkamREQk5XWFppUzAxSmJXZHdkRkZRY3poMVVUWkJXUm9pUVVScVYxOHpTWG8wTWtZeVVuWk9ialJYVTBaWVdWQm1ZMkpFWWpCaFFWOVZVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWR6dW5hIiwibGluayI6Imh0dHBzOi8vd3d3LmFkenVuYS5jb20vZGV0YWlscy8yNzg2ODY0NjA2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Seattle, WA, USA",
      "via": "via Jobs Trabajo.org",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nTim.Sugrue@CyberCoders.com\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930L450 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRFx-V5p96Y4zT-PrDy7-lcQv190QntBHMQeMt5AM4&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiJLbEZSLWszYTZoc0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUVhwMGMzaE9ha1oyWjBSeVRXWkpNV1kzWkZSa1ZGWkhla3N4TFMxclVVdDBhV2RHWVRWWVMwZFlVVGwyZEdsS1kwRllTMDVXZEZWSGJIY3piMVZWVWtoS2RUVldhakJ2YjJwQ1gzQktXRFJ5YjB0RGFIUjRSSFF6YmtWd2FqTnFabk4wTFdod01WOUxkMVJvYXpOWVgxcGhlRk0zU0ZneFZGSmZSM2d0YUhGS2MydExTa1pvYUdKVFIxSk5ZbXczUWxJdFRHZFZVRTE1Vm1WbkVoZGpkREJOV1haaVMwMUpiV2R3ZEZGUWN6aDFVVFpCV1JvaVFVUnFWMTh6UzJwNFNtWjBhRGRoY2psTWFtTkRPR1YwUVhjM2RFVkdSRUUxVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgVHJhYmFqby5vcmciLCJsaW5rIjoiaHR0cHM6Ly91cy50cmFiYWpvLm9yZy9qb2ItOTcyLTIwMjIwMjEwLTYzMmJhYmUwMTQ1MWQ2ZmI2MjAwZDMyM2FhOTlhMGEzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Orlando, FL, USA",
      "via": "via BeBee",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930L450 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6XpjBwa-cwBs6wILb8ZbdKF47eOqfs88rVx27Hoc&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiJJZXJZMVRnYWpCb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUW1FeVdEaG1SM2REVGpjeWN6RXhiMEZqWXpJdFFYWkNTRlF5VW5KbGRETmFRVlZJU1ZCUlVtdGxaWEpQU0V3MFlWOVBNalptZDFWSmFYbzBXalpCTkdkWlRreHFlbkpDT0RGd2NtWktUWEJSTlRsMU16VjRORTF1T0d4VlVsUTRUVEJDUm1wNFMyZDFUVkZuWDJGQk5sZHVZek5WWjB4NWRrSkNaSFpLVlUxNFNHeFhUR0ZJTUZCZlpFNXRTVU5aWXpGdVJuTnJVa2gwZURKUkVoZGpkREJOV1haaVMwMUpiV2R3ZEZGUWN6aDFVVFpCV1JvaVFVUnFWMTh6VEVKSWJuWjZhRFEzWTB4UFZuazRZMUptTkVkQ1ZXOVZZbk5WVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDIxMC05ZTM1MzdjMWNhZDMwOGM3YzU0OTIwOTc5MDc3MGZlNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Support Administrator",
      "company_name": "HumanIT Solutions",
      "location": "Dayton, OH, USA",
      "via": "via Job\\Searcher",
      "description": "• This position assists staff with technical support of desktop computers, applications, and related technology.\n• Support includes specification, installation, and testing of computer systems, peripherals, and office 365 technologies.\n• Activities require interaction with application software, operating systems, and cloud technologies to diagnose and resolve unique, non-recurring problems...\n• The position utilizes one-on-one consultancy to end users and staff.\n• The employee in this position also assists in the maintenance and testing of workstations and associated desktop equipment.\n• This position will need to be adept at identifying and monitoring the ongoing operation of the Windows 10 environment.\n• This includes identify problems and implementing corrective actions as needed.\n• This position also requires maintaining 100% accountability of Desktop related assets via inventory control and asset management.\n• s responsibilities require independent analyses, communications, and problem solving.\n• Work is performed with little supervision and requires initiative and judgment.\n• Job Type: Full-time",
      "extensions": [
        "12 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "12 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQgQWRtaW5pc3RyYXRvciIsImh0aWRvY2lkIjoiek5OVTBJTFJ1dkFBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JcXFNlYXJjaGVyIiwibGluayI6Imh0dHBzOi8vam9ic2VhcmNoZXIuY29tL2ovZGVza3RvcC1zdXBwb3J0LWFkbWluaXN0cmF0b3ItYXQtaHVtYW5pdC1zb2x1dGlvbnMtaW4tZGF5dG9uLW9oLThEZzVuZWs/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Chicago, IL, USA",
      "via": "via BeBee",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930L450 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6XpjBwa-cwBs6wILb8ZbdKF47eOqfs88rVx27Hoc&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiJIWG9NMFZEb1VFd0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUVVKS2EyMWtVbWsxZGpaMU1YSm9TVkpsTjFJNFRrMVVaVmhwYVhwcWJqRklVRmhrTjNKVVNFcGxlbGM0VkVSTmRFMTNVak5qUjFjNWVGcHJiMHh0ZGtFM2FVUm1iWEZTVlZKTmNIZEpRVkp3U0VGTldtaGpUR1U0YzFKSk5sZ3RlRGhEU0hScWJuVnJSVXN6WmtaNVMzTnNjSEZZTUV4U1RrTlpOWGxFY2paT1IwUnlOa3QxT1ZkclVrUlFORzVYYUZOVGMxSkdjblZwU1hkbkVoZGpkREJOV1haaVMwMUpiV2R3ZEZGUWN6aDFVVFpCV1JvaVFVUnFWMTh6U2pKSU9VUjJORTg1VTBNdE1uSmxSRXM0TWw4dFVFcFlReTEzWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDIxMC1iZTg5NjA1YWNiNjRlNjllODQxYzQzMTQzZTI0NmJiZD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Support Technician/onsite Required",
      "company_name": "TEKsystems",
      "location": "Longmont, CO, USA",
      "via": "via Apply 4 IT Jobs",
      "description": "Description\n: Our client is looking for someone to come in and understand their processes and procedures and continue to support their internal team. ServiceNow experience is a plus but open to other ticketing systems.\n\nThere are currently 4 technicians in this group, 3 of which have been there for 2-3 years. This person will image computers, get things set up for end users in the lab. 5 days/week onsite. ? Diagnose and resolve unique, non-recurring problems associated with application software, networking and operating systems within Factory/Lab environments ? Prioritize desktop tickets and determine the source of problems using a cloud based digital tracking workflow tool, like ServiceNow or Remedy ? Configure, deploy, maintain, troubleshoot and support computer workstations, laptops, and other computer equipment ? Research, maintain, install and troubleshoot all aspects of laptop and desktop hardware and associated software ? Troubleshoot technical issues while interfacing directly... with users.\n\nInstalls, configures, analyzes, resolves and repairs all hardware and software issues involving Windows and other operating systems o Provides total support of the desktop environment in accordance with defined standards and procedures o Follow processes and testing procedures to ensure a high quality of work is delivered to the end-user with minimal disruptions o Document procedures, standards, best practice configurations, settings and installation sequences o Partner with extended teams to ensure Flexera Inventory Manager (FIM) application is installed on all Pilot Line systems and support Patch and Vulnerability management activities in the Pilot Line and labs o Ensure that all laptops and desktops are configured to connect to the correct network environment (Windows) o Maintain password security, data integrity, and file system security for the computer environment o Communicate with customers, peers, and management concerning the status of cases, problems, or suggestions o Factory Information System (FIS) Application Support and troubleshooting o Completing other tasks as assigned by the Engineering Technical Lead and Engineering Program Manager Your Experience Includes: o Excellent oral and written communication skills and should be able to demonstrate these skills during the job interview o Experience providing excellent customer service to stakeholders o Maintains strong attention to detail in high-pressure situations o Experience using critical thinking skills to identify and resolve technical issues o Experience with Active Directory o 3+ years of experience preferred working directly with customers in a desktop support role to resolve technical hardware issues o Broad knowledge of Office 365 online applications (Word, Excel, PowerPoint, Outlook, Sharepoint, Teams, OneDrive, Forms, Stream, Tasks, Video and OneNote) Education Includes: o Associate Degree or its equivalent plus 3 to 4 years' experience. o Relevant Technical Certifications a plus, A+, MCP or HDI preferred. Additional Skills & Qualifications: o Associate Degree or its equivalent plus 3 to 4 years' experience.\n\no Relevant Technical Certifications a plus, A+, MCP or HDI preferred..\n\nThis is not a help desk position- it is hands on, software/hardware desktop tech. About TEKsystems: We're partners in transformation.\n\nWe help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change.\n\nThat's the power of true partnership. TEKsystems is an Allegis Group company. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.\n\nWe are an equal opportunity employers and will consider all applications without regard to race, genetic information, sex, age, color, religion, national origin, veteran status, disability or any other characteristic protected by law. To view the EEO is the law poster click here. Applicants with disabilities that require an accommodation or assistance a position, please call 888-472-3411 or email mpowers@teksystems.com.\n\nThis is a dedicated line designed exclusively to assist job seekers whose disability prevents them from being able to apply online. Messages left for other purposes will not receive a response..\n\nWeb Reference : AJF/275925234-31\nPosted Date : Thu, 10 Feb 2022\n\nTo apply for this position you will complete an application form on another website provided by or on behalf of TEKsystems. Please note Apply 4 IT Jobs is not responsible for the application process on any external website",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT1qGSbbS6XOGrJSA5ZSAlzT7CTN3mnV0MZXyu-&s=0",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQgVGVjaG5pY2lhbi9vbnNpdGUgUmVxdWlyZWQiLCJodGlkb2NpZCI6IlE1S1F5bldWd0ZVQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRMkpqVFRsZmRuaHJTVk4xTkZkeWNrMUtSRkpQWWxWR09FRmplbW90YzNCQ1RDMTJXVWRPV1VWQ1VreHBWa0U1YkVkamVHZzVObVpFUmtRME16TnZTRVJxWjFaVWFsWlZTRVJtUmtOU2RHdDNkRVZSTmpadE5YRTBORnBWT0hCcWVEZFRkVGMxYzBSUlgxUkthRjluV0c0eVYwWkNkalI0UXpoamFXdFFjVkJzUkdVd1lXWlNhek5aYTJSRVQxZDFObGhQUWpsRlRsVnpZMjVCRWhkamREQk5XWFppUzAxSmJXZHdkRkZRY3poMVVUWkJXUm9pUVVScVYxOHpTV1EzV1VNeFgzZHllREV0VUhSNU9FWkZXSFF5V1ZOQ1IyRnZkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQXBwbHkgNCBJVCBKb2JzIiwibGluayI6Imh0dHBzOi8vd3d3LmFwcGx5NGl0am9icy5jb20vam9iLWluLUxvbmdtb250LUNvbG9yYWRvLVVTQS9ERVNLVE9QLVNVUFBPUlQtVEVDSE5JQ0lBTi1PTlNJVEUtUkVRVUlSRUQtMGE5Y2RkMTk3MzIxM2UzZWE5L3YyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Support Technician",
      "company_name": "AGCO",
      "location": "Jackson, MN, USA",
      "via": "via JobzHQ",
      "description": "Desktop Technician II\n\nThe Desktop Services Technician II is responsible for troubleshooting and maintaining desktop computing environments used by AGCO employees and contractors...\n\nThis position is responsible for all aspects of incident managements including logging, analyzing, resolving, and follow up on hardware and software issues.\n\nThis includes installing, diagnosing, repairing, maintaining, and upgrading all hardware and equipment (including but not limited to desktops, laptops, thin clients, printers, scanners, copiers and smart phones) to ensure optimal workstation performance.\n\nThe person will also troubleshoot problem areas (in person, by telephone, or via remote access) in a timely and accurate fashion, and provide end-user assistance where required This position is also responsible for providing Desktop Services to C-Level and SVP-Level positions.\n\nJob Responsibilities\n\nDiagnose and quickly resolve all Windows applications and networking problems reported to help minimize downtime Install, Upgrade, Support and troubleshoot Windows 10, Apple MacBook, Microsoft Office 2013/O365 and any other AGCO approved desktop application.\n\nFollow AGCO's approved processes and procedures for Asset Management (Hardware and Software) Educate end users on basic software, hardware and peripheral device operation Document all support related activities in AGCO’s approved Service Desk application.\n\nMobile device support (smart phones and tablets) Provides site support and assistance to the Central IT Support Teams (Network, Storage, Telecom) as needed Troubleshoot and Support Audio and Video (A/V) technical issues in Conference Rooms, including Video Conference equipment.\n\nRecommend suggestions, modifications, and additions to current standards for future modifications then communicate recommendations to Global Desktop Team.\n\nOther duties as assigned by Management.\n\nMinimum Requirements\n\nAssociate degree in related field 6-8 Years of experience in the field or related area.\n\nAny of the following technical certifications: Microsoft Windows or higher certifications (MCP, MTA, MCSA, MCSE) Familiar with standard concepts, practices, and particular within a particular field.\n\nAbility to lift and carry up to 50 pounds of equipment short distances",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpO5Gqqvlvnl5YUZD_SVeUKDOywbWzgYZ0GwK-wU0&s",
      "extensions": [
        "16 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "16 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQgVGVjaG5pY2lhbiIsImh0aWRvY2lkIjoiaFg5NU1FNVBDcGNBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVkJGTWtkWFJERnRablZQVW1oclZVWkxiV3RVYXpCVWVGaGZkV0YxY1c4MVNHcERRa3hyY1c5RVptUjNYM2w0YmtsUk5EUkpjWFJaYzFSUlJVNU5VbkYwVFdwSGNsOTNNR3RZWjNWNWNIRm5XR05xVTNsS2VDMHlVbVpWYm5wRFVISkNVRkV6VG5GaVJrVk1kRWx1Y25rNWVraENjMWwyU2t0WFJVbzNPWGh2Y1hGNllVOHhhbEpKTjB3U0YyTjBNRTFaZG1KTFRVbHRaM0IwVVZCek9IVlJOa0ZaR2lKQlJHcFhYek5NUnkxSlJsQkpiV0Y2Y3poUlNXODRWMUZwWjJsbGN6UkJXRGQzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2J6SFEiLCJsaW5rIjoiaHR0cHM6Ly9qb2J6aHEuY29tL2pvYnMvZGVza3RvcC1zdXBwb3J0LXRlY2huaWNpYW5fYTUxNjA3OTNhODIwYWM1OV8wXzA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Nashville, TN, USA",
      "via": "via BeBee",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6XpjBwa-cwBs6wILb8ZbdKF47eOqfs88rVx27Hoc&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiI1TEI2OFljcGJGVUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUVU5akxVVnJXWFZaYVZsWFlXUlBOVEF0UmxSRU1sTnlNa296TVdsM1JUaFZlbUozT0VJM2Jra3paVkJLYTNKelFrUmFOQzB5TlZOSFZWRnNWVnBMVGt0NVVWRnpTblpoWWw4dFpEZHdXSEYyYzJaUU9WUkdiVEpFU210aVRXSmtZVEZ4YmpCeVQwazJiMHN3V0c5MVJFZFRUVTFuYjFObWNIUXdObUpJTFdJMmQxOW5VMVZvTWtWdmN6VmtWeTEyVERWeWFEZHFVMGxJYkdWUkVoZGpkREJOV1haaVMwMUpiV2R3ZEZGUWN6aDFVVFpCV1JvaVFVUnFWMTh6U1c5a0xYWk1hMWwxTlZKVFVUaExRMFY0ZFdsQlRuZEVNRUZqWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDIxMC05NDY5ZDA1ODM2MThkOWVlMGVlNmI2YzBkMTYxZTc1NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Infrastructure Architect / Azure Cloud WVD",
      "company_name": "Avanade Inc.",
      "location": "Jersey City, NJ, USA",
      "via": "via Apply 4 IT Jobs",
      "description": "Job Description\nThe Infrastructure Consulting team designs, installs and configures enterprise technology architecture for Avanade clients. Its expertise spans security, availability/fail-over, operating system/compute, storage, database, networking, and operations infrastructure, typically involving Microsoft or multi-vendor technologies\n...\nAs an Infrastructure Consultant with expertise in Endpoint Transformation/Modernization especially focusing on Windows Virtual Desktop (WVD), Citrix/VDI, and desktop/application publishing solutions (computers and mobile devices), you will participate in and sometimes lead the development of complex infrastructure solutions. You will work directly with clients to identify opportunities to transform their information technology landscapes and, as client business requirements change, help modify Avanade-designed infrastructure solutions. With a thorough understanding of both client and Avanade businesses, you will oversee people and project management for projects of moderate size and complexity. Day-to-day, you will:.\n\nExecute large-scale desktop deployment, platform migration and mobile endpoint management. Partner with cross-functional technology and design teams to integrate technology, operations and solution requirements into solution strategies. Design and conduct systems integration testing, component integration testing and user acceptance testing.\n\nCreate project deliverable documentation, including design, build and operations guides About you You are a technologist with strong business skills. You are as comfortable working with a technical team as with client business users, and you know how to build bridges between the two. With your excellent communications skills, you are adept at mapping business needs to technology solutions and helping non-technical audiences understand the benefits of these solutions.\n\nYour technical skillset likely includes:. Knowledge of several of the following areas: System Center Configuration Manager(SCCM), Microsoft Intune, Microsoft Endpoint Manager, Desktop Transformation, Operating System Deployment (OSD), Windows 10, Windows Virtual Desktop (WVD)/VDI, Non-Microsoft Mobility Management platforms (AirWatch etc),. Knowledge of operation management, systems security, testing, and mobility considerations.\n\nYour non-technical experience likely includes:. Interacting with clients. Assisting in proposal writing and solutions.\n\nWorking with global teams and offshore resources. Communicating and presenting complex information to technical and non-technical stakeholders, both verbally and in written form. Technical and procedural documentation including designs.\n\nYou likely have at least three years of relevant experience and a Bachelor's Degree in computer science, computer engineering, management information systems or a related field. MCSA or MCSE certifications preferred..\n\n3+ years' experience with System Center Configuration Management (SCCM) design/architecture and implementation experience is a must..\n\n2+ years' experience with Intune (MDM/MAM-WE, etc.) and other mobility solutions is required..\n\n3+ years' experience with transforming Windows Desktop operating systems within customer environments.\n\nExperience of mobile device platforms, including Windows, Android, iOS and Knox is required. 2+ years' of Application & Desktop Virtualization technologies (Citrix/VMware/VDI/WVD). Experience with Windows Server/2016/2019, Active Directory, Windows 10 desktop transformation/desktop modernization.\n\n1+ years' experience with Microsoft Azure, specifically Identity & Access Management (IAM), Infrastructure-as-a-Service (IaaS), Platform-as-a-Service (PaaS) and Software-as-a-Service (SaaS). O365/M365 experience strongly preferred. PowerShell scripting. Application Packaging processes and technologies.\n\nOperating System Deployment and Windows Image creation. Strong knowledge of Windows-as-a-Service. Windows Virtual Desktop (WVD) experience preferred..\n\nStrong understanding of network protocols/services and network infrastructure. Strong technical troubleshooting and analytical skills Education: Bachelor's Degree in Information Technology, Business, Sales or Marketing strongly preferred. About Avanade: Avanade is the leading provider of innovative digital and cloud services, business solutions and design-led experiences delivered through the power of people and the Microsoft ecosystem.\n\nOur professionals bring bold, fresh thinking combined with technology, business and industry expertise to help fuel transformation and growth for our clients and their customers. Avanade has 30,000 digitally connected people across 24 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. At Avanade, we are committed to a diverse and inclusive workplace where our people can be the best at what they do.\n\nWe are proud be among leading organizations who are taking a stand for gender equity, both in and outside the workplace. This includes teaming with like-minded partners who are as passionate as we are about strengthening the role of women in the workplace, including Women in Technology International, Anita Borg Institute and Catalys Avanade requires all new hires to be fully vaccinated against COVID-19 as a condition of employment. Avanade will consider requests for medical or religious accommodation to this vaccination requirement on an individual basis.\n\nEmployment TransparencyAvanade® Is An Equal Opportunity Employer. Avanade prohibits discrimination and harassment against any employee or applicant for employment because of race, color, age, religion, sex, national origin, gender identity or expression, sexual orientation, disability, veteran, military or marital status, genetic information or any other protected status. The EEO is the Law poster is available here and poster supplement is available here The Pay Transparency Policy is available here Avanade is committed to working with and providing reasonable accommodations to individuals with disabilities.\n\nIf you need a reasonable accommodation due to a disability for any part of the employment process, please send an e-mail to Avanade at careers@avanade.com or call (206) 239-5610 and let us know the nature of your request and your contact information. By using this site, you agree that we can place Cookies on your device.\n\nSee our Job Applicant Data Privacy Statement and Cookies statement..\n\nWeb Reference : AJF/192582497-31\nPosted Date : Wed, 09 Feb 2022\n\nTo apply for this position you will complete an application form on another website provided by or on behalf of Avanade Inc.. Please note Apply 4 IT Jobs is not responsible for the application process on any external website",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAk87ZfjJS5LdhqQQMk9quguDx9KVK0V9mXmsC&s=0",
      "extensions": [
        "7 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "7 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSBBcmNoaXRlY3QgLyBBenVyZSBDbG91ZCBXVkQiLCJodGlkb2NpZCI6ImozcDgySHBrclp3QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRMU0yUVVRMWJqUXlWMU4xWlRWU1dYbFdjV1pzWjBOcU1EVnhPUzAyTVdsQk9XSlhkMWxoY0dwcFZXVlRSV3R3UjNKZloybzNiVGt5Y0VaM2VYSlRVbTFMUkhGSFRGUjZabTFPWkZKb1NYTXhiMVV5YldsNmEyMDVhVU13ZDA1a2FuaFhibDh4VWt0Q2REZElUSFp6V25CcVQyTmhWM2hVTmxrdGJYWnBNM0pSV1hsclEwUklUbmxxUWxZMVh6aEZha0phY2xSZlZUTm9WVzUzRWhkamREQk5XWFppUzAxSmJXZHdkRkZRY3poMVVUWkJXUm9pUVVScVYxOHpTa0pXVVhKeVlYQjZXamhxUkZwWVlWWXdiMHRuY2xsaFRXMTRkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQXBwbHkgNCBJVCBKb2JzIiwibGluayI6Imh0dHBzOi8vd3d3LmFwcGx5NGl0am9icy5jb20vam9iLWluLUplcnNleS1DaXR5LU5ldy1KZXJzZXktVVNBL0lORlJBU1RSVUNUVVJFLUFSQ0hJVEVDVC1BWlVSRS1DTE9VRC1XVkQtNTQ0N2Y5OTc3MGFmNDdlYjdmLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Desktop Support - Senior",
      "company_name": "Partners HealthCare",
      "location": "Oak Bluffs, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "DescriptionThe Network Admin Specialist provides the highest level technical support as well as consultative service to the Mass General Brigham Information Systems (IS) departments, Medical Departments, and end user community in regards to system, infrastructure and application integration and interoperability. Responsibilities include planning and developing, elevated operational support for production systems, i.e., key business applications, network resources, securing Mass General Brigham enterprise environment. Principal Duties and Responsibilities Under direction of the Senior Manager, MGH/MGPO IS Planning and Management provides technical support to MVH in-house staff, user departments and vendors regarding all networked applications and systems. Enterprise Infrastructure Initiatives: The position will be responsible for working with the MVH leaderships and staffs in concert with MGB IS for initiatives such as desktop hardware and software upgrades, support of the voice... systems, and wired/wireless data infrastructure support and deployment. Departmental / Facilities / Real Estate Coordination: The incumbent will be responsible for working with the MVH leadership, MGB IS, MVH Facilities/Planning & Real Estate to facilitate the fit-out of new construction as well as renovations and back-fill renovations. This site position will participate in the purchase, provisioning, inventory, and support for the following “Low Voltage” systems which including Information Systems (applications, hardware, voice/data infrastructure), Biomedical Equipment, Audio Visual, Patient Entertainment/Educations, Telemedicine, Nurse Call, Security Systems, as well as various clinical systems. Tasks will include the implementation and support activities related to the above-mentioned Low Voltage systems or services at MVH adhering to MGB IS standards. This position may be included in all phases of the project life cycles including requirements gathering, business process design, documentation, quality assurance testing, training, implementation and ongoing support while working closely with MVH clinical and administrative department heads and staff. Responsible for the installation, maintenance and support of the PC network infrastructure, Voice Over IP phone systems, including onsite client and server hardware and software installation. Primary site liaison at the highest technical level to various MGB IS departments regarding process of network, desktop, voice systems, Intranet and application and biomedical device integration. Participate in the evaluation, testing, installation and configuration of new IS technologies and network based applications for site Clinical and Administrative Departments. Occasional after hours and weekend work to perform tasks that cannot be done during business hours. Primary on call responsible for site Low Voltage Systems and Technical Infrastructure. 24X7 responsibilities requiring on call and evening, night, weekend hours as needed. Performs other duties and special projects as assigned by Department Management. Qualifications BS in Computer Science or equivalent experience preferred. Certification in related field – Microsoft, Cisco, Citrix. Skills/Abilities/Competencies Required Great understanding of Operating Systems: Windows7, Windows10, Windows Server OS Expert knowledge of supported software: MS Office Suite, MS Internet Explorer Experience with Active Directory Administration, AGPM Understanding of typical network topologies, IP networking, and security Scripting Experience required, Application development background a plus Web technology knowledge System Center Configuration Manager Experience with application packaging, application distribution disciplines and techniques Experience with SQL, Oracle, and MS Access databases Excellent project management skills Independent and self-starter Ability to multitask and prioritize work requirements Excellent interpersonal, communication and customer service skills Test/ QA experience Experience of Epic applications not required but a plus",
      "extensions": [
        "6 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIFN1cHBvcnQgLSBTZW5pb3IiLCJodGlkb2NpZCI6IkIyZ1JRWmxfMl9nQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVZCRk1rZFhRVEJETmpkdFpWVkJRVTF6TmxsdVdHMUdSRVpPUW5aR1FsOU5SblE1Y0hGd1ZIZGFMV1JIWVdWTFV6WkNVRmhVYUhwNVprb3hOM0pmVjFWM2NVeFBiMkZVYTJSWmIySk5OR2haV0ZCS1NVbDNVa3A2TVRGbVRtbEtTR3d3T0ZKclJWUlhOVk5qWlhWTGMxZDNSVE5aZUhoUlVuUmtORlUyTkVNNVFsRkVaMUUyUW1VNWJFczFVVW81VUUxNlpIbGZWMXBHTVRScWJ5MHphVVpGZVVjNVdVSkNUMFZKYjJkRFExWkZVVkZaUVZkbkVoZGtkREJOV1hWeWRVdExNakJ4ZEhOUWN5MHlWRGhCYnhvaVFVUnFWMTh6UzBGdVZHMXBhVkY1Y2tOSmMwWjJaMUZ4T0ZseVoycG9OVU5HWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNlYXJjaCBBbmQgRmluZCBZb3VyIE5ldyBKb2IgVG9kYXkgV2l0aCBCam9ieiIsImxpbmsiOiJodHRwczovL2Itam9iei5jb20vdXMvd2ViL2pvYnBvc3RpbmcvMGU4ZGM0OWIyN2IxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Desktop Engineer 1",
      "company_name": "AmeriHome",
      "location": "Thousand Oaks, CA",
      "via": "via Jobs | Fidanto",
      "description": "What you'll do:The Desktop Endpoint Engineer supports the design and builds, administer and maintains the infrastructure, and works on projects with a focus towards Windows based architecture, Azure/Active Directory, Office 365, MECM in a heterogenous environment virtual, mobile, and physical machines. Performs systems maintenance, planned upgrades, capacity planning, and administration. Develops, documents, and standardizes preventative maintenance routines to increase system availability, scalability, security and performance standards on production and lower environment systems. Investigates, troubleshoots, and resolves incidents and problems. Accountable for delivery, management and lifecycle of endpoint devices; physical, virtual, mobile devices and its underlying services, ensuring continual delivery of a world-class user experience. Collaborates with other cross-functional team to ensure infrastructure capability is optimized.What we are looking for: DESKTOP ENGINEER... RESPONSIBLITIES:Administer, and maintain Microsoft MECM leading the charge in bringing forth technologies such as Device Join and Autopilot to support the local and remote workforce landscape.Administer and maintain the Azure/AD group policies, Office 365 and inTunes or equivalent enterprise management toolAdminister and maintain the Citrix VDI Workspace and or AWS WorkspacePrepare, test, document, release, and update OS and software applications.Troubleshoot complex application and hardware issues; act as level two escalation points to IT Help Desk and Desktop Support teams, including documentation, analysis, and resolution of escalated issues, providing high-quality solutions to IT problems quickly.Maintain standard desktop configurations (Windows and macOS) and automated software packages to ensure the enterprise desktop systems can be supported and patched in a remote workforce.Maintain the control and process environment for the organization's endpoint encryption and standard operating system image library ensuring client configuration integrity, controlled access, and incremental versioning.Administer and maintain software distribution, application and security patch management, desktop security, remote support tools, and other enterprise desktop management, monitoring, and troubleshooting utilities.Participate in Endpoint projects working with local and remote teammates, technicians, engineers, and other employees across the companyMaintain and document desktop configuration standards that support organizational security policies and create technical and standard operating procedure documentation.Administer and maintain the client system testing environment for evaluating desktop hardware, operating systems, hosted applications, service packs and patches, security configurations, and image deployment. Work with team members to schedule and report upon the execution of testing and validation efforts as part of a formal release management process.Craft reports that provide insight and analysis of desktop software license usage, software and hardware compliance, operating systems, and hosted application software distributionCollaborate with the Asset Management team to implement processes and integrate platforms to support software and hardware asset information for the enterprise desktop environment.Represent team recommendations to management, demonstrate influence over governance bodies, and communicate technical issues, impact, and risk mitigation strategies in business terminology that non-technical resources can understand.Act as the point of contact for status updates regarding vulnerabilities across multiple platforms and multiple business groupsDevelop, document and maintain operation processes and procedures to conform with Enterprise Security Control Standards.Build strong relationships with vendors, business, and technology leaders.Keep ahead of emerging trends, understand business area opportunities and challenges, process or system impacts to all related business or systems areas when implementing recommended solutions to achieve business objectives.Performs other duties as assigned.QUALIFICATIONS & EXPERIENCE:Bachelor’s degree and/or some relevant work experience in vulnerability management, cyber security and system/network administration is preferredMinimum of 1 year hands on experience with MECM, Intune, MDM and or experience with Citrix, NetScaler and FsLogix architectureMinimum of 1 year supporting and configuring Citrix Application Delivery products, XenApp, XenDesktop and Citrix Provisioning Services communicationMinimum of 1 year of implementing enterprise IT solutionsStrong knowledge of Microsoft Windows Operating System; 2019 & 10Strong knowledge of network, proxy, firewall and VPN technologyKnowledge of Azure servicesKnowledge of Active Directory, including policies, LDAP, SAML, federated ServicesKnowledge of Office 365Experience Scripting with PowerShell and Bash experience preferredAnalytical and problem-solving skills for troubleshooting are requiredStrong knowledge using Office 365; Excel, Word, PowerPoint, Power BI and TEAMSFamiliarity with issue/ticket tracking systems (Jira, ServiceNow, etc.)Excellent oral and written communication skills are requiredDemonstrated understanding of infrastructure and cloud vulnerability scanning and configurationKnowledge of security technologies and architecture. Knowledge of IDS/IPS, DNS, DCHP, DMZ architecture, Active Directory, Proxies, Cloud architecture technologies and VPNs to name a few.Strong understanding of network services, vulnerabilities and attacks.Knowledge of application exploits and vulnerabilities. Knowledge of ports and services typical in configuration of web servers, file servers, and workstationsCandidates must be familiar with CVEs, CVSS, and Mitre as well as other industry specific vulnerability classification standards, frameworks, and best-practicesCOMMITENT & DEPENDABILITY:Willingness to be an integral member of a successful teamDedication to provide the highest levels of serviceExcellent attendance and reliabilityAdherence to company policies and proceduresDedicated to maintaining confidentiality in every aspect of the jobLimited traveling as neededProvide on-call supportBenefits you’ll love:We offer all the important things you'd want — like competitive salaries, an ownership stake in the company, medical and dental insurance, time off, a great 401k matching program, tuition assistance program, an employee volunteer program, and a wellness program. In addition, you’ll have the opportunity to bolster your business knowledge, learning the ins and outs of how successful companies operate and manage their finances, giving you invaluable hands-on experience to help grow your career!About the company:Western Alliance Bank is a wholly owned subsidiary of Western Alliance Bancorporation. Alliance Bank of Arizona, Alliance Association Bank, Bank of Nevada, Bridge Bank, First Independent Bank, and Torrey Pines Bank are divisions of Western Alliance Bank; Member FDIC. AmeriHome Mortgage is a Western Alliance Bank company.© Western Alliance Bancorporation",
      "extensions": [
        "6 days ago",
        "Full-time",
        "Dental insurance"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJEZXNrdG9wIEVuZ2luZWVyIDEiLCJodGlkb2NpZCI6Ikt0cGNaZXRvV0FRQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVZCRk1rZFhRMWxqVVRGNE9HbERMVmRSWmpnNU4wY3piVGxTVkVzd2FYWkRhRTlKTWxaRllXaFdkVmxwTlhCbWFuRnVUVlJoVldkQ1UzaEdVbk55U1Rkb1JYSkpXRVJrVldaZlVWaFpaMWcxY0RabmVVWndYMHg1ZVhKRFQxSmtkMUZYTTBGNVQwNDVZM1JUVDJzMFJWRkViR2xMVWpSQmMxSmtkM28wZDBNdFkyZzViM010WW5SeFRXNTVSazVWY0Y5WlJDMWlhakpyYnpKYVVXcHJhbUpCRWhka2REQk5XWFZ5ZFV0TE1qQnhkSE5RY3kweVZEaEJieG9pUVVScVYxOHpTVEJmTjFSMFkxWmFVa3BWUTJOaGVpMUNaa1ZmTjNGcVNHdFdkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly91cy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2VuZ2luZWVycy1hbGwtb3RoZXIvZGVza3RvcC1lbmdpbmVlci0xLTk3NDMzNDE1ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Chicago, IL",
      "via": "via BeBee",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930L450 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6XpjBwa-cwBs6wILb8ZbdKF47eOqfs88rVx27Hoc&s",
      "extensions": [
        "6 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiJIWG9NMFZEb1VFd0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUVdKWGFHRk1SbVl3VERBM1NsRmZZemxRVGxkaGVHRlZiVFZSWVhacGRYbzVYMTg1UTE5YWJFeHFWemc0UzBoS01ITnFRM1ZDUVdweFZsRldWR0V6ZWt0NWRrSnJlWGxWUWxkR1RpMXJjR3BFUVZsSE5YcHFOMDF5VjNkbmQxUXlSV1ZmWkdKTWFWOXlRbE5PY2psbmMwSnlWbEJ4WTNOdVJHZERlRVp6TkhoRkxUTnBWRXBxVmtGcFdVeGtNVXRWWm5GdFoxZFdlWGxwVW5aM0VoZGtkREJOV1hWeWRVdExNakJ4ZEhOUWN5MHlWRGhCYnhvaVFVUnFWMTh6U25OR1lsSktWVXhoTkhGcVVubHpSRlJWTTBOcWVsRmZNVFJUVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDIxMC1iZTg5NjA1YWNiNjRlNjllODQxYzQzMTQzZTI0NmJiZD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "REMOTE Sr. Software Engineer",
      "company_name": "CyberCoders",
      "location": "Minneapolis, MN",
      "via": "via BeBee",
      "description": "Job Title: Sr. Software Engineer - Desktop Application\n\nLocation: REMOTE...\n\nSalary: $130-170K+ DOE\n\nRequirements: Java, Desktop Applications, Hibernate, Spring, MySQL\n\nAs a leader in manufacturing and WMS software offerings to small and mid-size organizations, we are rapidly growing, both on-site, hybrid on-site, and remotely.\n\nWe are adding bright and motivated individuals to our team across our three products. Desktop Application, Web Application, and Service-Oriented Product on AWS. So if you have Java development and experience in one of these areas, let's talk\n\nWhat You Will Be Doing\n\nAs a Sr. Software Engineer working on our Java-based client/server desktop application, you will be directly involved in architecture, development, and delivery of products, applying your experience building desktop application software and collaborating with others to drive agile development processes throughout your team.\n\nResponsibilities\n• Work within a team of Software Engineers, onshore and potentially offshore, focusing on producing and delivering products.\n• Build our flagship desktop product: Java-based client/server application running in thousands of our customers' warehouses and within our own application-hosting environment.\n• Apply agile development practices, working closely with your team to rapidly deliver high-value features.\n• Support and adhere to coding and unit test standards applied by the team. Always be a driver of the highest quality products.\n• Work within the team to address and resolve escalated production issues in a timely manner, participating in postmortems and root cause analysis and assisting to identify and implement mitigation strategies based on what was learned.\n• Mentor and share knowledge with other engineers to lift the team and products.\n\nWhat You Need for this Position\n\nQualifications\n• BS Degree\n• 3-5+ years' Java Development\n• Experience building desktop applications/java-based client/server apps\n• Java, Hibernate, Spring, MySQL\n\nBonus\n• Manufacturing, WMS, ERP, Inventory, or similar\n\nWhat's In It for You\n• Competitive Compensation (130-170K+ DOE)\n• Vacation/PTO - 15 Days, increasing to 20 at 3 years\n• Comprehensive Benefits (Medical, Dental, Vision, Life, ST/LTD\n• 401k with a match of 4% on first 5 %\n• Onsite Gym\n\nBenefits\n• Vacation/PTO\n• Medical\n• Dental\n• Vision\n• 401k\n\nSo, if you are a REMOTE Sr. Software Engineer with Java-based desktop application product experience, please apply today\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Tim Sugrue\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1670930 -- in the email subject line for your application to be considered.***\n\nTim Sugrue - Recruiting Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6XpjBwa-cwBs6wILb8ZbdKF47eOqfs88rVx27Hoc&s",
      "extensions": [
        "6 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSRU1PVEUgU3IuIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiI2MFF3RHMyUnBvb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUVVsZlFqYzRNbE52UmxKclJVaDBjbWxWVjNSRVNrSXlkRkJRTlhCMGRHZ3dZV1kwWnpjM09VVnlURXh0YUZCQ2IyOVZkazR0UWw5S05XVkxjMGxuWjNkcVRUaGxMVlZHYXpFM1RYUjNaR2RRWVRWM1EzaGtXbmRrWmprNVpURnpRMkYwTldoc1IyNXRMVTlLTkVSdWJrbzFOR0pSYnpkUGJUQjNjV2RaYzBScE5qTnRRMVYyTlVSMFVUTjVia1ZOT1ZsNlVVWnRlWGsxU1hobkVoZGtkREJOV1hWeWRVdExNakJ4ZEhOUWN5MHlWRGhCYnhvaVFVUnFWMTh6U2t0dk5sOUlWMFpGYXpoYWQzQmlZVU5rV0doYVZESmpWblpHUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDIxMC1hNjJjNGEzZjYwZjRlZGRkN2U5MmU4YzM3MjcxMDIxZj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": ".NET WPF Developer - Applications (Conover)",
      "company_name": "Drake Software LLC",
      "location": "Conover, NC",
      "via": "via Rapid Interviews",
      "description": "OPPORTUNITY:\n\n.NET WPF Developer...\n\nAbout Us and Problem Definition\n\nWe are an industry leader in the development of Tax Preparation Software, with a large customer base of loyal tax professionals and a growing user base of consumer tax filers. As part of an overall re-platforming strategy, we are modernizing our flagship desktop-installed products.\n\nPreserving core user experiences, while integrating modern technology stacks and capitalizing on the opportunities those frameworks present, is critical to our success.\n\nStrategic Goals for a .NET WPF Developer\n• Establish a strong foundation for building products using software development best practices\n• Achieve high customer satisfaction by ensuring all product features are coded to user requirements\n• Achieve high user adoption by effectively translating a highly proven user experience\n• Extend testability of presentation technology, working with DevOps Engineers to integrate automated testing into release pipelines\n• Work effectively as a member in our Scrum Agile process\n• Participate in peer-reviews of software design and implementation\n• Create clear and descriptive technical documentation for knowledge transfer\n\nYou should possess:\n• A Bachelor s Degree (or equivalent) in Computer Science, Computer Engineering or a related discipline\n• 3+ years experience in desktop application development using the .NET Framework\n• 3+ years experience working with C#/VB .NET with WPF and MVVM\n• Working knowledge of Github & Azure DevOps a plus\n• Effective communication skills, both written and verbal\n• Strong problem-solving and troubleshooting skills\n\nWork Location:\n\nMultiple Locations in Western North Carolina, Nashville, TN and Virginia Beach, VA\n\nRemote positions also available.\n\nAssociated topics: .net, application, back end, c++, develop, devops, java, php, software development engineer, software programmer",
      "extensions": [
        "6 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiIuTkVUIFdQRiBEZXZlbG9wZXIgLSBBcHBsaWNhdGlvbnMgKENvbm92ZXIpIiwiaHRpZG9jaWQiOiJfS3dPN3Zja1ZTQUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUVZZNGFUVllTWE5MZG5wMFdFcERabE5vZVRaelNVcEZNek55T0dORFYwOW9jbEJEZW5GblRuSkVVbGh2YWxSME1VOTJiWEZsY1dzMmJsWjZaRGRrTjFCWGVWZHlkelJQZEhWQk9FcFdRblpFUXpVNGJVOWljVGt4YUVRekxYRkhiVmMyTlZJdFQyeDJUMjExWVV4SVVHYzJlWFpNY0hZdGRGSnVXak5mUkd0SlVHMWhVVFpFTkVSWE5tTnRNM2QwVkROaGNsWm5UMGxPT1ZRelZWYzJWelpPWkRsU1N6QTRSbWg0UWpsVmEyWkpFaGRrZERCTldYVnlkVXRMTWpCeGRITlFjeTB5VkRoQmJ4b2lRVVJxVjE4elNrdDJhM2hwWldkZlJsWjFla1JQWVUxVk1UUkxaMnhhVlZWYVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSYXBpZCBJbnRlcnZpZXdzIiwibGluayI6Imh0dHBzOi8vd3d3LnJhcGlkaW50ZXJ2aWV3cy5jb20vam9iL25ldC13cGYtZGV2ZWxvcGVyLWFwcGxpY2F0aW9ucy1jb25vdmVyLXdpdGgtZHJha2Utc29mdHdhcmUtbGxjLWluLWNvbm92ZXItajJjLTIxODQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    }
  ]
}