{
  "jobs": [
    {
      "title": "Mobile Applications Developer",
      "company_name": "Fawkes IDM",
      "location": "Washington, DC",
      "via": "via Trabajo.org",
      "description": "Seeking a full-time mobile applications developer for a remote role. Candidate MUST live within 50 miles of DC, NYC, Chicago, LA, SF, Houston, or Denver.\n\nResponsibilities...\n• Building Enterprise-level solutions within Arnold & Porter M365 and Azure environments, including form creation, workflow customization, process automation, report development, dashboard creation, and system configuration.\n• Designing and developing Office 365 applications and solutions (Power Automate (Flow), Power Apps, Power BI, Dynamics 365, SharePoint Online).\n• Creating and customizing mobile applications using 3rd party mobile application development platforms (e.g. Microsoft Power Platform, Fliplet)\n• Analyzing the business requirements by collaborating with the stakeholders and IT Management, studying systems flow, data usage, and work processes.\n• Performing software design using software development fundamentals and processes, debugging, testing, and deploying software solutions.\n• Designing, developing and maintaining key components of the software suite using Azure and Office 365 APIs.\n• Implementing custom solutions that leverage various Azure and Office 365 services.\n• Documenting and demonstrating solutions by developing documentation, flowcharts, layouts, diagrams, etc.\n• Creating and maintaining application solution documentation.\n\nRequirements\n• Four-year college degree required, equivalent experience will be considered.\n• 5+ years of experience in the following:\n• Designing and developing enterprise-wide applications using Office 365/PowerApps and other Mobile Apps development platforms for iOS and Android devices.\n• Web development, including JavaScript, front-end frameworks (React, Angular), Dynamics 365 APIs, HTML5, CSS and JSON.\n• Net or equivalent scripting language.\n• Must have extensive experience building Office 365-connected solutions, including Power Automate (Flow), Power Apps, Power BI, Dynamics 365, SharePoint Online.\n• Expert knowledge of building web parts, apps, page layouts and content types using the O365 API.\n• Experience with Visual Studio and Azure DevOps, Git, TFS, or other source control management tools.\n• Solid understanding of relational database development and SQL experience.\n• Experience with IDEs and Visual Studio and Visual Studio Code as well as experience with source control tools such as Bitbucket, Azure DevOps, and Github.\n• Experience with Azure resources such as Azure functions, Azure logic apps, and Azure SQL DB.\n• Experience with PowerBI, SQL Server Reporting Services, SQL Server Analysis Services, and/or SQL Server Integration Services a plus\n• Experience in applying software development lifecycle, including analysis, design, configuration, development, and unit testing using Microsoft technologies.\n• High-level understanding of Active Directory, AD security, TCP/IP, DNS, Load balancers, Firewall, and SMTP",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2FBRb6yedSWxy5LGA3oSLIiJmAJFfpI0xiKUWRwQ&s",
      "extensions": [
        "4 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "4 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb25zIERldmVsb3BlciIsImh0aWRvY2lkIjoiUk9vWGI0VWNGQjRBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFFWTjBTblJDVG5WSU1ISTVVVms1UVhabU5GTnVNMUl0VHpoeFVFcDVaVk0xVTFkVE1tVXRlbkZPUzJGVVdscDFjVzkwYlZBd1FsRllWV1l6YkhGM1ZXRkJhM2xMTVhCa1IxVnllRWR6TTFBMk0xbEdSV05uVVhsNGNqTnhObUZGWVU1V1ZqSnhNQzFGVnpoVWJtcG1WVzV1UkcwNFRWTllOQzFJUVRkd09IRTNUREJXVjFZdGJTMUtibFl5UkRWRGNVNWlkMjlvYm1nNFMwbEJabXBrUlZVek0yOU5jRlJQZWpSaldVUTFNVXhCRWhkSWRrWm1XWE5mU2t3MVZFRjVkRTFRTlhZMlpqSkJNQm9pUVVScVYxOHpTVTVTTURCZlNGcGZjVXMwZWxWNE1GUjRiVUl0VFV4elZsTnNkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVHJhYmFqby5vcmciLCJsaW5rIjoiaHR0cHM6Ly91cy50cmFiYWpvLm9yZy9qb2ItMTQ0OC0yMDIyMDQxNi1kN2VhNmMwMmM5MWYxMTQxZWNlNGI0OTFmY2MyYzQxMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Senior Mobile Application Developer (Android & Ios)",
      "company_name": "OmegaHires",
      "location": "Herndon, VA",
      "via": "via OmegaHires - JazzHR",
      "description": "One of our top clients has an immediate need for Senior Mobile Application Developer (Android & Ios)\n\nJob Description...\n• 10+ years of demonstrable experience\n• Demonstrable portfolio of released applications on the App store or the Android market\n• Extensive knowledge of at least one programming language like Android & iOS (Kotlin and Swift) and Java\n• Familiarity with OOP design principles\n• Experience with third-party libraries and APIs\n• Superior analytical skills with a good problem-solving attitude\n• Ability to perform in a team environment\n• Strong oral and written communication skills\n• Ability to interpret and follow technical plans\n• Identify and plan for new features\n• Develop application programming interfaces (APIs) to support mobile functionality\n• Suggest and implement new mobile products, applications and protocols\n• Remain up to date with the terminology, concepts and best practices for coding mobile apps\n• Work closely with colleagues to constantly innovate app functionality and design\n• Use and adapt existing web applications for apps\n• Write unit and UI tests to identify malfunctions\n• Communicate with users to understand their needs and experiences",
      "extensions": [
        "1 day ago",
        "Contractor",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "1 day ago",
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIEFwcGxpY2F0aW9uIERldmVsb3BlciAoQW5kcm9pZCBcdTAwMjYgSW9zKSIsImh0aWRvY2lkIjoiaW5XMFlXYnhENU1BQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVkJGTWtkWFFYZFJVMmxMVUVGM04xbEtla3RIYVRWb04xZFVObTVRYmt0dWNFd3pZVmhVUzBkVVZtcDRVbmt3Um01Q1JrWnVVMloxYlRFMGVVOW9VRlJ0YzB4Q2JFMUxVakIxTkd4Sk1sb3pXRVJTV25aTVZUWkxZblZtVmpaS0xVTXRTa3d3Wm01bWRGaFVYMGxGTW1zM2NuTnhRekZ3VnpkTGJYTXRibWQzZHpKQlNWbGhTamhHT0RORGRucGhTWE54UTFoVE1GQTRXWEJRT1dOSFRISk9lakJTZERWRFJtMTFVMlZhUm1abFFrNUZSUzF3ZFc4eFozWmhUbVJ1YkVwRmJFcEZlVWRoVEdwREVoZElka1ptV1hOZlNrdzFWRUY1ZEUxUU5YWTJaakpCTUJvaVFVUnFWMTh6U1ZnMVRrMTVURmx4TkdoV1NITnBiMWs1U1ZSVVUyVktXR2RYVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE9tZWdhSGlyZXMgLSBKYXp6SFIiLCJsaW5rIjoiaHR0cHM6Ly9vbWVnYWhpcmVzLmFwcGx5dG9qb2IuY29tL2FwcGx5L0lkZnFMa2poVEMvU2VuaW9yLU1vYmlsZS1BcHBsaWNhdGlvbi1EZXZlbG9wZXItQW5kcm9pZC1Jb3M/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "Jobot",
      "location": "Landover Hills, MD",
      "via": "via Trabajo.org",
      "description": "We are hiring a Mobile App Developer to work in Germantown, MD. Responsibilities: Participate in complete SDLC for features enhancements for Hughess B2B and B2C Mobile Applications Participate in design discussions with internal and external stake holders, document the design and interface specifications for development Participate in the development of features in coordination with small cohesive onsite and offshore development team in agile and traditional SDLC methodologies Participate in deployment, debugging and support of field and QA issues Requirements: BS in computer science or related field 3-4 years of experience in design and development of Mobile Applications following application development standards and quality processes 2-3 years of experience in native iOS mobile frameworks, XCode, Core Data/Sqlite/Realm, network connectivity through Web services, Push notifications 2-3 years hands on experience on both Swift & Objective-C 3-4 years of development experience in iOS... Firebase/GCP, Native and Hybrid App frameworks, UI/UX frameworks Preferred Experience: 1-2 years of experience in CI/CD Pipelines using Jenkins, Firebase configurations 1-2 years of experience in JIRA, Confluence Mobile App Test Automation iOS/Hybrid app development awareness Position Details: Clearance: N/A US Citizenship or Authorization to work in US required Travel: < 10% (CONUS) Centurion Consulting Group, LLC is an Equal Opportunity Employer EOE M/F/D/V No third parties or subcontractors\n\nby Jobble",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSm8jUv1InoMPOopNGMO4Owg9piJGHtADevcDLVRxM&s",
      "extensions": [
        "3 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJwakwwS2E4bmNSMEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUTFsemVFSmpTMnB5ZUZVMU1YTkVVMHBzYkRBd01VWmtXbWRDVmpWR09WUnFVVGR6VG5sTE1rbDFaakl3WVdWWWVUaHFaeTF1U1RocU5YTnJXVXRDYm5SNFUwcHhXSGxmUjFCWmRVRmxia1JQYWpWelpGRm5VRkpLZGs4d1lsSndVSEZ2YkZSdFNGOTVOMnRqUzFKYVV6SnNPWFJWYTJSSGFuTnRTa1l0VGxaeVZDMVplbTVYU1ZkNGJITk5lWEp0UmxNMFRUWldUM05CWjJwbVNYSkVUelpUUkZONGQzbDFRVmxaYm5RNFR6a3dFaGRJZGtabVdYTmZTa3cxVkVGNWRFMVFOWFkyWmpKQk1Cb2lRVVJxVjE4elNWVlRXR2hmVTA5aGVYbDFVRkpTZW1sdWVrVnZkR2MxZFhkYVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3VzLnRyYWJham8ub3JnL2pvYi02NDAtMjAyMjA0MTctNTc1OGNiNmVhYTY1OTk0OTBlMWYzZDMwZDQ2OGNkNTQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile App Developer",
      "company_name": "AOPA",
      "location": "Frederick, MD",
      "via": "via IT JobServe",
      "description": "AOPA is looking for a Mobile Application Developer with expertise in iOS who will be responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers. Your primary focus will be development and maintenance of iOS applications and their integration with back-end services.\n\nAdditional responsibilities may include supporting apps developed on the Cordova platform. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\n\nResponsibilities:- Maintain and support existing iOS application- Design and build new features and applications for the iOS platform- Ensure the performance, quality, and responsiveness of applications- Collaborate with a team to define, design, and publish new features- Identify and correct bottlenecks and fix... bugs- Help maintain code quality, organization, and automatizationSkills:- Proficient with Swift, Objective-C and Cocoa Touch- Experience with iOS frameworks such as Core Data, Core Animation, etc.- Experience with offline storage, threading, and performance tuning- Familiarity with RESTful APIs to connect iOS applications to back-end services- Knowledge of other web technologies and UI/UX standards- Understanding of Apple's design principles and interface guidelines- Knowledge of low-level C-based libraries- Knowledge of other mobile development platforms (Cordova etc)- Experience with performance and memory tuning- Familiarity with cloud message APIs and push notifications- Understanding of benchmarking and optimization techniques- Proficient understanding of code versioning tools- Familiarity with continuous integrationEducation and Work Experience:- BS degree in Computer Science, Engineering or a related subject- Have published one or more iOS apps in the app storeFor information on AOPA, including more information on employee benefits and our company culture, visit our website at https://www.aopa.org/about/hr",
      "extensions": [
        "7 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "7 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoiVHozTVV0XzYwNEVBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVkJGTWtkWFJFUjZiSFpxVkVaeFpsTjBjM2xaYm5seVNtUnFkamhIUVhkcVJFbHFUblp4UW01VlUyWjZkVzVXY2pobFFYVjVWVzF4YlZWMU5tTlRkVmx2TUdKR1VsWlZjRVJJTmkxc1RuTlhkbTVvYkhsNE9GTnNWREp0TFdaM1NrSlhhRkk1UTBGTGJWQkJURWM1VmtSWE9FWnFiM1JaT1c4MlpHUXhMVlEwVEhwZk9EbHpVM1l6Vm5GbVNsSXlWa0oyTWxsSFdHczJPVlJVU0ZscGIwSkJFaGRJZGtabVdYTmZTa3cxVkVGNWRFMVFOWFkyWmpKQk1Cb2lRVVJxVjE4elNtRkpTbGx5TTBWcFRta3daSG93Y0ZST0xWaG1aWHB3VjIxU1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBJVCBKb2JTZXJ2ZSIsImxpbmsiOiJodHRwczovL2l0LmpvYnNlcnZlLmNvbS9qb2ItaW4tRnJlZGVyaWNrLU1hcnlsYW5kLVVTQS9NT0JJTEUtQVBQLURFVkVMT1BFUi1mNzc4OGQ2Mzg4MTk5OGI3MjMvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "Isotropic Systems",
      "location": "Washington, DC",
      "via": "via Trabajo.org",
      "description": "Our client, a financials services company is seeking a React Native Mobile Application Developer. Summary of Duties: Develop ReactNative mobile apps from specifications provided by UX Designers and Application Architects. Maintain existing ReactNative apps, including resolution of security, accessibility, and functional issues Integrate mobile apps with RESTful business APIs Maintain and update... project dependencies Maintain Git code repositories in MS Azure DevOps Maintain automated builds and app distribution using MS AppCenter Perform documentation of all code changes Other development related activities as assigned.\n\nby Jobble",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJXw3NxEP74gpaKjOJ-rxQzoeH6hXeLh96ArxdRC0&s",
      "extensions": [
        "3 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJ1QkNFODFxaVdnZ0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUkdzM2ExSndRVGxzVUVVd00ySmFNVmgwY0RSS1pXdFRORFZWY2pCbldsWmFaVE5vZUVOT1pEbDJUV2xDYlhwMVZsUjJYMVpxTlZsd1kxOTBiWGN6WDNneFdXVnlVVWhZY1hwaVkzUmhSRzgzWVdGVVdFWTFNRWRPWDFWaGRYZG1SRkZwVjBzMFVrMDBhRTFQYkVKV1RIQjFNVk4xYUhaS2RtSnJTbHB0WVV0VlJtOVBTVk5NVlVKVFRqaEhjbk5WTVRoNFpFNVZhazUxV1ZjemRVTnRjRE10WVZBeFRrTjJabnBKU1ZCU1VFZERkR3Q1ZUZkNE4xaENRakZDVm5kTU9HUnhUbnB0RWhkSWRrWm1XWE5mU2t3MVZFRjVkRTFRTlhZMlpqSkJNQm9pUVVScVYxOHpURjlvUkVkV2FtOUJlbmRIVUZwbFUxQldjRVZFUTNONVdVWnNkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVHJhYmFqby5vcmciLCJsaW5rIjoiaHR0cHM6Ly91cy50cmFiYWpvLm9yZy9qb2ItNjQwLTIwMjIwNDE3LTY0Y2M3ZTFlZmY5YjZmY2YzYTE1NmEzODQwMTEyNjAxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Senior Web Developer OR Mobile App Developer",
      "company_name": "RGBSI",
      "location": "Richmond, VA",
      "via": "via ZipRecruiter",
      "description": "Job Description\nRGBSI, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary partner to top companies in the automotive, aerospace & defense, IT, media & entertainment, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these... leading US companies.\n\nJob Description:\n• Client is seeking an experienced senior mobile app developer to develop, enhance and maintain mobile apps enterprise-wide.\n• This role is mainly looking for a strong Web Developer with .NET or a Strong Mobile Developer.\n\nResponsibilities:\n• Develop, enhance and implement the hybrid apps, thin apps, vendor apps, and native app as needed.\n• Develop, enhance and maintain the standardized mobile framework and tools kits for apps development.\n• Enhance and maintain the centralized push engine and mobile apps data management system.\n• Assists with troubleshooting and fixing the issue with mobile apps.\n• Manage and support the mobile apps in SAP Mobile Platform\n• Independently or as part of a team complete assignments and project work on time employing team standards and ensuring acceptable level of quality\n• Evening and weekend hours may need to be worked as part On-call support or as part of meeting project deadline\n• Other related duties will be assigned as needed\n\nRequired Knowledge, Skills, Abilities & Experience:\n• Strong Experience with Swift and iOS Technologies (if going for the mobile developer role)\n• Proficient in web languages: HTML5, CSS, JavaScript, C#/Web API\n• Experience with Cordova and Cordova plugins are desired.\n• Experience with UI/HTML layout with a responsive framework such as Foundation or Bootstrap helpful\n• Good understanding and knowledge of Swift and Java/Kotlin for providing support for Vendor developed native apps.\n• Some experience with Mac, XCode and debugging iPhones via Safari.\n• Some experience with Android phone debugging via Chrome.\n• Experience with single-page apps will be helpful\n• Ability to define task timelines, lead design sessions, and provide technical leadership in developing mobile solutions.\n\nPreferred Skills:\n• Experience with Visual Studio and a full stack .NET background would be a big plus\n• Virtual Reality or Augmented Reality development experience\n• Gaming development experience\n\nWe offer attractive, competitive compensation and benefits including, medical, dental, 401k, Short Term Disability, AD&D and Tuition Reimbursement, etc. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.\n\nRGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, Germany, Mexico, and India",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcREXAxebVs0d6QI13C-fX-wofOCS7er0oe8uSFHMBk&s",
      "extensions": [
        "Full-time",
        "No degree mentioned",
        "Health insurance",
        "Dental insurance"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgV2ViIERldmVsb3BlciBPUiBNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoiNktPUS01SW9lVFFBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVkJGTWtkWFFsVmlhRFV6Y1c0emFVazRjWGQ1T1RWaGJYVnFZVUpWWVdORk9FZFFYMHd6YUZOMU1HWk5YME5RU3pjMU9HVjJjelJyWWpkaU9URk9kVlpuUVZOWVoyTTJlRWhDUTE5QlRHMXNPV2QzYjNSWFkzaFdNVTVTV0VKaVFYSlhkWEJhU2xCZlptNWFaV3MxZUhWelNYVk5ZVXB1VDBneU9XNW5Za2RzZGt0amJVZ3dORU5rWTBSQ1ZuTmFWelpGYkVKdmRESmlUbWRYWm5NMWFVZ3pTWFpFYUU5VE5tSm9aVWd0ZERKblZIcElkemxaVFZKWGVsUlhOVXA0ZVVGRGFHOUplVFZWWVhsT1pHTnJNWEZTWldNM2EyTkRUVVpUZUhSemJFVjJaeElYU0haR1psbHpYMHBNTlZSQmVYUk5VRFYyTm1ZeVFUQWFJa0ZFYWxkZk0weGxjMlpJUzFVdFMyWlBSV2RaZEdab05XeDViVkJFVEZkdVpIYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gWmlwUmVjcnVpdGVyIiwibGluayI6Imh0dHBzOi8vd3d3LnppcHJlY3J1aXRlci5jb20vYy9SR0JTSS9Kb2IvU2VuaW9yLVdlYi1EZXZlbG9wZXItT1ItTW9iaWxlLUFwcC1EZXZlbG9wZXIvLWluLVJpY2htb25kLFZBP2ppZD1lZmExZDU5MTgxYTBkY2YyXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer (iOS or Android)",
      "company_name": "Kane Partners LLC",
      "location": "Farmville, VA",
      "via": "via Salary.com",
      "description": "Leading Financial Industry Client, recognized by Forbes, WSJ and others as one of America’s best employers seeks highly Qualified Mobile Developers (iOS or Android).\n\nDepartment Profile...\n\nDynamic and fast-paced area within the Firm's Wealth Management Technology Division. The charter of this department is to develop Client-facing and internal Mobile Applications. Working as a member of this team, the candidate will be responsible for developing and supporting mobile applications in an open and collaborative environment\n\n· Translate requirements created by functional analysts into the architecture for that solution and describing it through the set of architecture and design documents.\n\n· Lead in the creation and maintenance of documentation related to solutions mentioned above.\n\n· Ensure selected solutions are technically and operationally feasible\n\n· Design, develop & prototype Android or iOS native customer applications for internal and external use.\n\n· Participate in full app life cycle: concept, design, build, deploy, test and release to app store.\n\n· Work with product teams on new product ideas and strategy.\n\n· Adhere to all enterprise standards as they relate to the proposed solution\n\n· Drive a best practices approach to the continuous improvement of our products, processes, and tools.\n\nRequired Skills\n\n· B.S. or greater Computer Science, related field, or commensurate practical experience OR demonstrable equivalent professional experience\n\n· Over 6 years of hands-on experience developing applications in iOS or Android technology - Objective-C and Swift or Kotlin and Java/J2EE and on any platform (mobile, web, etc.)\n\n· Over 4 years of strong hands-on experience in iOS or Android native app design and development.\n\n· Strong mobile UI design and implementation experience, including prototyping\n\n· A rock-solid understanding of object-oriented design patterns and Java.\n\n· Experience with multithreading, memory management and caching mechanisms specific to mobile devices.\n\n· Passion for analyzing and improving runtime efficiency and memory footprint.\n\n· Excellent problem solving, critical thinking, and communication skills.\n\n· Public showcase and repository of Mobile Apps and work desirable.\n\n· Web services\n\n· Continuous Delivery and Continuous Integration (CI/CD)\n\no Bamboo\n\no Fastlane\n\n· Git - Bitbucket\n\n· NodeJS\n\n· Android SDK\n\n· Espresso\n\nJob Type: Full-time\n\nPay: $130,000.00 - $200,000.00 per year\n\nBenefits:\n• 401(k)\n• 401(k) matching\n• Dental insurance\n• Employee assistance program\n• Employee discount\n• Flexible schedule\n• Flexible spending account\n• Health insurance\n• Health savings account\n• Life insurance\n• Paid time off\n• Parental leave\n• Professional development assistance\n• Referral program\n• Relocation assistance\n• Retirement plan\n• Tuition reimbursement\n• Vision insurance\n\nSchedule:\n• 8 hour shift\n• Monday to Friday\n\nSupplemental Pay:\n• Bonus pay\n\nWork Location: Multiple Locations",
      "extensions": [
        "26 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "26 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIChpT1Mgb3IgQW5kcm9pZCkiLCJodGlkb2NpZCI6InF5bVI5dklZNFg4QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVZCRk1rZFhSRkpLYm5oUU1EWjJXbXBXVkROc1duUm1hamRZUTI1cFNHdEdVekJIYzB4Zk5VTXhTRmN6VkdaUU4ycGtlWHBsUWpSdFEwRjZabTg1U0V4SVNXTnNSR2hqUXpGamJubE9iRmh1WDJkTldWYzRaM1J6VFVWelpWSk9UVWxPWlhSU1pGcEVOMDAzWW5FeGJEZ3hURVpsZFdaVmFGRTBiSFp3UTFrMGVHeGlkbkJUV0Y4MU5XVmlielV5TmpVemRuUkJaMmN0VFhGNk1uRlpZMmxrWm1kVGNWWnRXV2RPUVhWNFFXNDBjVzV4T0VobFZsTm1TbGxLYjJKMmRrRm1kVXRHUW5vNFRtaDVSRkpKU1Y5aWFuUmlObGRrWjNOdWIxaFJVSGMxVVJJWFNIWkdabGx6WDBwTU5WUkJlWFJOVURWMk5tWXlRVEFhSWtGRWFsZGZNMHN6ZG1WU1NtMVdhVlZ3V1d0cVkzRm5XVlJ6VDFGVGNYZFhZVUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY184IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNhbGFyeS5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2FsYXJ5LmNvbS9qb2Iva2FuZS1wYXJ0bmVycy1sbGMvbW9iaWxlLWFwcGxpY2F0aW9uLWRldmVsb3Blci1pb3Mtb3ItYW5kcm9pZC9qMjAyMjAzMjQxMjI0MzMzMjgyODg2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "The Intersect Group: Senior Mobile Application Developer (Ios)",
      "company_name": "The Intersect Group",
      "location": "Virginia",
      "via": "via Adzuna",
      "description": "The Senior iOS Developer will manage and guide our design team in the creation of mobile applications for our clients. Depending on the project, we may either use hybrid technologies such as flutter / react native if it makes sense to. We prefer native development whenever possible but it does come down to whatever our client's needs are. We need a developer who is skilled in native iOS development who is not opposed to using hybrid solutions whenever necessary.JOB DUTIESDeveloping and maintaining iOS applicationsWillingness to work in a team or in a silo depending on the projectWorking on multiple client mobile projects which can either be iOS or hybrid (no android experience required)Helping to scope out projects for clientsWorking closely with the design team to build out applicationsKNOWLEDGE AND SKILLSExperience working on and deploying an iOS app in the app storeExperience developing mobile applications for accessibilityExperience building complex views for mobile apps that... interact with hardwareExperience with ARkit and bluetooth",
      "extensions": [
        "5 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "5 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJUaGUgSW50ZXJzZWN0IEdyb3VwOiBTZW5pb3IgTW9iaWxlIEFwcGxpY2F0aW9uIERldmVsb3BlciAoSW9zKSIsImh0aWRvY2lkIjoiaHRreVF5NXZFUVFBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVkJGTWtkWFJFSTBTelF5YjB0RE1IWmlUV1paZGt4Nk9FZFdRVm80UVV4MWFtWmFhR1kxTldkNExURlJaRFl4VUdSS01GVjJZMGsyYmpKUmVpMW1hakYzYlVOTlNrbzNVa0ZoYkdwZmFFOTVRVUZVTjE5V1QwTldZMk5MVDBOYVFqTlZUREp1YVZseVlWb3dTV3BsYUVKSmNqaDNWR1IzV2tGU04ybGtia2xXV0RWNWRFcFhSRkV3VmtwaFpHZHNWamRUZEVGVFlURk9iRFZaVVd3dE0yTndkeTFTTkdrdFVIWmhVRmxCYVcxeldITk5VVzlwYVZaSFFXWnVNSFphV1VOVk5uUmxUbXhzUVVjNWVHNDFTemxEVm1KaU9WRnNNbGxpVUVoeFgxTnZaeElYU0haR1psbHpYMHBNTlZSQmVYUk5VRFYyTm1ZeVFUQWFJa0ZFYWxkZk0wbEVWVzFOY0RSRVYzWjNNMVZMT0c5RWNsWnBRbFZuVDIxbmQyYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFkenVuYSIsImxpbmsiOiJodHRwczovL3d3dy5hZHp1bmEuY29tL2RldGFpbHMvMzA1NTY5NzA3MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "Latitude, Inc",
      "location": "Richmond, VA",
      "via": "via StartWire",
      "description": "You will be leading the App development side of the business. This will involve developing the infrastructure and architecture, developing the App, testing the App and delivering an amazing product.\n\nYou would have extensive experience in software development or web applications and/or mobile native apps. You need to be an absolute A grade technical person to lead the development of the new... App.\n\nResponsibilities:\n• Be part of a team that builds impactful features for our customers and pros\n• Breakdown a feature into releasable chunks, estimate release schedule, and work on the feature with your team\n• Contribute to the architectural and design decisions your team makes and be able to articulate the impact of those decisions\n• Contribute to code and design reviews, evangelize best engineering practices, and participate in Angi Lunch & Learn sessions\n• Influence the team members to do “the right thing“\n• Be part of our production on-call rotation\n\nQualifications:\n• You are an expert with the following technologies; Swift, Android SDK , iOS SDK, Cocoa Framework, XCode IDE, Interface Builder, Git (for source control), Autolayout (using interface builder and APIs)\n• Bachelors degree in Computer Science or a related degree\n• You have 6 years experience with mission critical, high volume, mobile apps and/or web-based systems",
      "extensions": [
        "2 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJQSG5aZUJaYlFUUUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUVRORmREbEZiM1o0VG14UmNXOVFTRTVKWjBoSGVFTTNSRTVhTFZWWGMxUnVWR1kzYm5aNFgwWXlTbDlaYVhOVWNYbHJja3BhYjFoRlZ6bGhOazUyTjBkb2RFWmZNVXRYYVhSd1lrSXdSamhFYlVnMk4wdFlVVUpQTmtaV2FVVkNNaTFZWWtaRlpHcEtXRGxJV2t0Q1RVZFJUek01WTNoQ2RrOVNNVVYyTUhWQ1JXODNRM0ZhZGxNeGJYUkdjMjloVjIxTU9YbElkbmx3Wlc5Sk5ETjZVVmRQZWtZNU1USlpTM3BLVm1KcVVrUm5FaGRJZGtabVdYTmZTa3cxVkVGNWRFMVFOWFkyWmpKQk1Cb2lRVVJxVjE4elNYaDRSRk5SVDJKaGJXdHJjbk5STFVOd1drMVNlSGxHZUdZMFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU3RhcnRXaXJlIiwibGluayI6Imh0dHBzOi8vd3d3LnN0YXJ0d2lyZS5jb20vam9icy9yaWNobW9uZC12YS9tb2JpbGUtYXBwbGljYXRpb24tZGV2ZWxvcGVyLTM4MzY0Nzc5MTc/c291cmNlPXNlb1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "iOS/Android Mobile App Developer",
      "company_name": "Qnexis",
      "location": "Virginia",
      "via": "via Glassdoor",
      "description": "Job location in Northern VA.\n\nONLY local candidates will be considered...\n\nPrincipals only. NO recruiters or employment agencies.\n\nQnexis is an equal opportunity employer.\n\nThe Q in Qnexis stands for quality. Quality people. Quality solutions. We are looking for team players who are passionate about doing their best work with a habit of putting customers first. If you think you have the qualities to be on the Q team, check out our openings, and get in touch.\n\nQnexis Qualities:\n\n– Solid work ethic\n\n– Comfortable in a fast-paced environment\n\n– Strong communication skills\n\n– Flexible/adaptable\n\n– Ability to produce effective work under tight timeframes\n\n– Ability to take direction and prioritize tasks\n\n– Able to work independently and as part of a team\n\n– Problem solver\n\n– Ability to multitask\n\n– Ability to obtain government clearance\n\n– Bachelor’s Degree in Computer Science or equivalent\n\n– 2+ years of Mobile App Development experience.\n\n– Proven experience in developing native Android apps using Java and Android SDK\n\n– Proven experience in developing native iOS apps using XCode, Swift and Objective-C\n\n– Proficiency in JavaScript, jQuery, Angular, Knockout\n\n– Proficiency using interfaces and Web API’s in JSON and XML formats\n\n– Demonstrated success in publishing at least one or more apps in the Google play store and Apple Store\n\n– Familiarity with Git\n\n– Experience with Agile development methodologies",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmrQbUlOS2W_8-VyLGaPEIZ6GqiBOhwngIx5JGErU&s",
      "extensions": [
        "9 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "9 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJpT1MvQW5kcm9pZCBNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoiSTBTY3FlTDFudUVBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFExSXhXRGxuVDB0QlUxbEtMWHBqVFdoTGMxQmtOMmRSZWsxblVHUnNVbGh4Y1VGb1ZsbFBVMFZWZUZKdGFWRlFPR1ZCZEc1QmNVeHJlR0ptTm5KTFQxSjJjbVp3TlVGQlRqWmZUVXhaVGtaVlYxaFFNMnhoVldkb1IxVnBXV0ZzVHpGUmRYRk9SRVpyTmt0RWNuZEljbVpwZWxrNE5FSnBlR1EzWTNscGJWSkpOMjAzZUdJMmRFNUZhVEp3ZVdZeGVFSmhUV3c1ZGtOQmNYVndNRkJ5ZGxoV1NXbzBkWG81VkRaZlMzYzFMWGxaRWhkSWRrWm1XWE5mU2t3MVZFRjVkRTFRTlhZMlpqSkJNQm9pUVVScVYxOHpURVZpTUc1RFlVSXhWVTFvYW5sMmFFOTRPV2Q0WW5CUVNHeE9kdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3IuY29tL2pvYi1saXN0aW5nL2lvcy1hbmRyb2lkLW1vYmlsZS1hcHAtZGV2ZWxvcGVyLXFuZXhpcy1KVl9LTzAsMzJfS0UzMywzOS5odG0/amw9MzY5MzQ0NTY0Nlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile APP Developer (Entry Level)",
      "company_name": "Magnus Technology Solutions",
      "location": "Kansas City, MO",
      "via": "via Hypjobs",
      "description": "Job Description\n\nWe are seeking a Mobile APP Developer (Entry Level) to become an integral part of our team! You will be responsible for creating and modifying computer application software or specialized utility programs...\n\nResponsibilities:\n• Analyze user needs and develop software solutions\n• Work with project manager or product owner to meet specification needs\n• Recommend software upgrades to optimize operational efficiency\n• Collaborate with other developers to design and optimize code\n• Create flowcharts and user guides for new and existing programs\n• Document all programming tasks and procedures\n• Perform routine software maintenance\n\nQualifications:\n• Previous experience in software development, computer engineering, or other related fields\n• Knowledge of Java, Python, or other programming languages\n• Familiarity with relational databases such as MySQL, Oracle, and SQL Server\n• Deadline and detail-oriented\n• Strong analytical and critical thinking skills\nCompany Description\nMagnus Technology Solutions provide quick orientation / training for professionals & placement for candidates having work authorization in USA.\n\nWe work on #Selenium, #QA_Testing, #QA_Automation, #Manual_Testing #Dotnet, #java, #j2ee, #java_UI, #Angular, #React, #Python, #DevOps, #Salesforce, #Hadoop, #IOS, #Android, #RPA, #Mulesoft and any #Developer related #Technologies",
      "extensions": [
        "12 hours ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "12 hours ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQVBQIERldmVsb3BlciAoRW50cnkgTGV2ZWwpIiwiaHRpZG9jaWQiOiJ2QUQ2VlcxMGNwTUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFWQkZNa2RYUWxCb1RtRnJhRm8yVEU5V01YWlRNME42YUdGSmVHTm1Wa1pvWVZwTGRUQTVaamMyTlhKemJWaEhaV2RrV0dOVGQwRlFTRFJRYWtzeVNHZFZTRXQxYnkxVVdGcEpaMnN5YlV4dldGcDZWWFpHTlhoVlJuTnBZMDkzUzI5WVVWQnJaV05zUVVzMmRHTm9aMDlSVkd0YVZqZFNkM1pPUkdOUVUzSXpMVVZDVEdwcGJITnhSVE5LZVRVelRVSnJkemR5UmpRdFRWbGhNRzV5YjBoM01rNDFTM2h4YzJSVVNVRkRhVmhhVlVzeVVFTk5kVFJTVlRSb2NYRkhkMmsxWlRWNWVtbElVWEpZWkZoVFVYZ3RNMjlrTFdGNU5qUmhRMlJtVGw4elVSSVhTWFpHWmxsMmRrSklOR1YzTUZCRlVISTNiVEkyUVZVYUlrRkVhbGRmTTBwSGFtbGxNQzFJWlZJeldqSlljbTlhYzNScU1uY3lZVzQzVUhjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBIeXBqb2JzIiwibGluayI6Imh0dHBzOi8vaHlwam9icy5jb20vam9iLXpwL2Q3NzRjZGIwOTc5NTRkMjlhYjlkYmY5MjhmOGE1ZWYzL01vYmlsZS1BUFAtRGV2ZWxvcGVyLUVudHJ5LUxldmVsLS9LYW5zYXMtQ2l0eS9NTz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Lead Mobile App Developer",
      "company_name": "Resolution Technologies",
      "location": "United States",
      "via": "via Trabajo.org",
      "description": "Lead Mobile App Developer (REMOTE)\n\nWe are looking for Lead Mobile App Developer to join us as we build our new in-house team. This role will be responsible for designing, implementing, deploying, and managing new native applications leveraging a new enterprise-wide API with a reimagined user experience. Now’s a great time to join us as we embark on this transformation...\n\nLead Mobile App Developer Responsibilities Always make security the top priority\nDesign, build and maintain Mobile Apps using Flutter framework\nDesign and implement automated testing\nCollaborate with cross-functional teams to architect, design, document, and implement quality solutions\nTroubleshoot and fix issues\nCollaborate and pair with multiple teams to share knowledge and improve everyone’s skills\nDefine and document processes and analyses\nWork with DevOps team to build and maintain mobile deployment pipelines\n\nLead Mobile App Developer Required Skills\n5+ years’ hands-on experience developing mobile applications\n2+ years’ hands-on Flutter Framework development\n2+ years’ hands-on experience in Dart language\n2+ years’ experience in Flutter training\nExcellent problem-solving skills\nExperience consuming APIs in mobile applications\nExperience delivering publicly accessible applications to the Apple App Store\nExperience with Git\nExperience with Unit and Functional tests within Flutter\nKnowledge of industry trends and relevant application technologies\nExperience working in a Scrum/Agile development environment\nAdept at mastering new technology, processes, and software applications\nDedicated to quality and customer satisfaction, persistent about achieving project goals\n\nLead Mobile App Developer Desired Skills Experience mentoring junior developers\nProven ability to work in a global, multicultural environment\nB.S. in Computer Science, Engineering, or equivalent experience\nFinancial Service or Bank experience\n\n#DiceJobs",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXQdWCpCgf198g0rxDjvikFRIKILOIS5IctJmQYsk&s",
      "extensions": [
        "Full-time"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIE1vYmlsZSBBcHAgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJnLVVZTlI1Njc2NEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUTFsaU0xTnlZMHRPUjE5S1p5MVpOV3hGVjIxUFlXdzVXWGxqWTBwUFEyaFdNV3hpU2xaT1kxQXhSMDlUVWpaV1JucHhabk5OU1dkdE5UbENiblZCTlVaU01FVnlNemRVT0cxTGNXUlNVSE5qTTNFelZVeEhWVVZhUWtkUmN6bFlUMnBrVWkxUk9IRXhTbGR0TFhsVVFVSXdiMHhJY1dWcWJ6WTFiVU5RVUVFNWRtRnhOa3d6UWs5eFlVTkVZbkpFYmtkQlUyNUdRVkJ1WVZKTFlrRnNaelV0VTI1SFF6ZFRRMnR2VjA5aWVuTkZiVXhCT0VWVVEwZHhialJrWWpWZmJHNVZTM2MxRWhkSmRrWm1XWFoyUWtnMFpYY3dVRVZRY2pkdE1qWkJWUm9pUVVScVYxOHpTMjF3Y1VseVpWOUhUbkJHZUdwdmVUZHNVMkpoTUhkd1NIVk5VUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVHJhYmFqby5vcmciLCJsaW5rIjoiaHR0cHM6Ly91cy50cmFiYWpvLm9yZy9qb2ItMTYzNi0yMDIyMDQyMC04ZjA3MjM2OTliOTAwYmU1NWFhMWJhNjcwMWI1OGI2Zj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile App Developer",
      "company_name": "PAR Government Systems Corporation",
      "location": "United States",
      "via": "via SilkRoad Technology",
      "description": "PAR Government is a recognized leader in the development of Situational Awareness (SA) apps used in a broad range of applications from the military to emergency first responders and humanitarian aid. We currently have an opportunity for mid-level mobile app developer to join our SA development team. The team is comprised of a diverse group of experts in their field, which includes Video Streaming... and Compression, Amazon Web Services (AWS), Android and iOS, Software and Cyber Security, and Web Application development. This position is responsible for the creation of new features related to the use of the Android Team Awareness Kit / Android Tactical Assault Kit, otherwise known as ATAK. The successful candidate will be challenged to put their development skills to work on projects that have significant real-world impacts, help save lives, keep our users safe, and help make the world just a little bit better.\n\nResponsibilities and Duties:\n• Work with other team members and users to understand requirements and operational impacts\n• Create user experience storyboards using screen mockups and wireframes\n• Implement new features and resolve issues on both Android and iOS\n• Apply secure coding best practices in all coding assignments\n• Use automated software quality assurance tools to minimize software defects and vulnerabilities\n\nRequired Skills/Experience:\n• Java and / or Kotlin\n• Swift\n• User Experience design concepts\n• OAuth desired\n• Esri or other mapping experience helpful\n• Portfolio of previous work will be reviewed\n• 2 years mobile app development experience required; advanced school project may be considered\n\nIt is the policy of PAR to prohibit all forms of discrimination and to affirmatively implement equal opportunity to all qualified employees and applicants for employment without regard to race, color, creed, religion, sex, age, veteran status, national origin, disability, marital status, predisposing genetic characteristics, sexual orientation, gender identity, or other legally protected status and positive action shall be taken to insure the fulfillment of this policy.\n\nIf you require reasonable accommodation in the application process, call Human Resources at 315.356.2260. All other applications must be submitted online",
      "extensions": [
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoiLWNxU1FJNlI2ZHNBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVkJGTWtkWFFVRldiRzlCZDBsdmJuSlRkMDgyT1RKaU4xZFpiR2x0UjA0eVprWlFZa3RVWmw5MFYwa3hXa2d5YTNKVlRWVjNVSGh3WTI5dFNFVkpTWFpOV2paNVgxRmljMXBPY21rMlEweE5kVXg1WmxoUFZGVkNVbXAwTkZwS2MyZFpiV2wzY1c1VlNrcG1iMEV3UmpSQ1RUaHRWSGswY0hCVldVSnVWMnhuWTFkVFdGaHZkbFptWVZWbGFHTlBUemhhU0cwNFlrWnBWRTA0VjNGMVVrZHhZVFJhVVRCaWVYaDBSVE42UVhWU2IzUjNVVE53ZEUxQk4zUjVXazV0Y0dsUVZXWXdjSFZHU1c5RUVoZEpka1ptV1haMlFrZzBaWGN3VUVWUWNqZHRNalpCVlJvaVFVUnFWMTh6UzBSV2NtdDNTRGh6VVd0aGF6STRZWEV0TUdwRFNFVmhUbXhPUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbGtSb2FkIFRlY2hub2xvZ3kiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNpbGtyb2FkLmNvbS9QQVJHb3Zlcm5tZW50L2NhcmVlcnMvam9icy81OTU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer- Full Time",
      "company_name": "VAI (Vormittag Associates, Inc.)",
      "location": "United States",
      "via": "via BeBee",
      "description": "Looking for a Mobile Application Developer to create and manage applications for an ERP solution. Job responsibilities will include requirements analysis, design, coding, unit and integration testing of software, and support of management system.\n\nOur ideal Mobile Application Developer is a thought leader who is open to new ideas, has a desire to learn new concepts and is willing to collaborate... with others on projects.\nRequired Skills:\nMobile app development with 1 year of experience with good knowledge of Object Oriented concepts and a strong passion for software development\nBachelor's or Master's Degree in Computer Science, Math, or Technical science (e.g. Engineering) or equivalent.\nMust enjoy working in a team environment and interact with customers/users to achieve satisfaction.\nExperience with Android or iOS application development\nTechnical skills include Java, C, C++, Swift, Java Servlets, JSP, HTML5, Web services, JSON, XML, JavaScript and AJAX\nStrong knowledge of SQL and relational databases such as DB2, MySQL, etc.\n\nGood to have Skills:\nKnowledge of IBM i (AS400) operations and RPG Programming\nHybrid app development using jQuery Mobile, ReactJS, AngularJS etc.\nWeb development using Java, PHP, Python, IBM WebSphere Portal\nExperience with Web servers such as Apache, Tomcat, JBOSS, etc.\nExperience with any ERP software",
      "extensions": [
        "18 hours ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "18 hours ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyLSBGdWxsIFRpbWUiLCJodGlkb2NpZCI6ImJmc1RZN3hxSWNBQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVZCRk1rZFhSRzFKWkhWTldWQlpVa2xEZFZGSU5EZHVZVkJ5U0dWUFVtOW1Ua3RsYkVSM2JHazBZMkozYWxCeGIyZE5lWFpzVHpscWVYVjBWVEo2UXpKd1QxZDBhM1p2U0dGdmJtWTBVa3RHYWpaTWRHWkpZM0JtYWxWYVVWUk5Ta3Q0TmtZMVltTnJMVmxyWTNSS1YzQlBkVlJpVmt4MmNVVkVPR05XVkdGU1ZVMXpXbUptV0dKTlQyODRiWFpyZDBvelMxZG9SREJWVm1kcFYwUkdVMVZzZG5aeGVYTnFUVTVQVURVd1NtaHNTRmw1TTFOQ05HOWZSREJFVTJwak9XMXhjVkZsVUZSWFRFSlhWa3BwUzJwblkwVmhSMFZuTW5CbWVGQnlWRE5JZHhJWFNYWkdabGwyZGtKSU5HVjNNRkJGVUhJM2JUSTJRVlVhSWtGRWFsZGZNMHQyUXpKdVowZEhWbWt4UW5sSVdYZDNjbXR1UVhZdGNqWXlibmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vdXMuYmViZWUuY29tL2pvYi8yMDIyMDQxOS1iZDFhOWI3ODEyOTQ2NGZiZTAwZTg5MDg2YWJmNmEwYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Application Developer (iOS/Android)",
      "company_name": "INADEV",
      "location": "Anywhere",
      "via": "via LinkedIn",
      "description": "• *******THIS POSITION IS 100% REMOTE********\n\nINADEV Corporation is a recognized SBA 8(a) certified SDB based in McLean, VA since 2011. We provide high quality agile digital services, cloud based solutions, and full end to end operational services to multiple Federal agencies, Local/State Governments and large Commercial entities...\n\nPOSITION DESCRIPTION:\n• We are seeking a Mobile Application Developer with a highly motivated, team-centric work ethic. This person will primarily focus on the design, development, and delivery of mobile applications for Apple and Android devices\n\nRESPONSIBILITES:\n• Support the entire application lifecycle (concept, design, test, release and support)\n• Develop mobile applications using Kotlin/Java (Android) and Swift (Apple).\n• Able to work across both frameworks to build mobile applications.\n• Develop solutions that integrate with other 3rd party systems using native SDKs, web services, and other technologies.\n• Elicit and analyze business processes and requirements from technical and non-technical teams.\n• Deploy applications to iOS and Google App Stores.\n• Troubleshoot and resolve issues related to mobile development.\n\nNON-TECHNICAL REQUIREMENTS:\n• Ability to pass a 7 year background check and have the ability to obtain a U.S. Government clearance\n• Must be a U.S. Citizen\n• Good communication skills\n\nTOP 3 SKILLS:\n• Android Development experience\n• Kotlin/Java\n• iOS development experience using Swift\n\nMANDATORY REQUIREMENTS:\n• Bachelors Degree and 3-5 years of pertinent experience.\n• In-depth knowledge of iOS Swift and Android Java framework\n• Experience with third-party libraries and APIs\n• Familiarity with OOP design principles\n• Excellent analytical skills with a good problem-solving attitude\n• Ability to perform in a team environment\n\nPHYSICAL DEMANDS:\n• Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nINADEV Corporation does not discriminate against qualified individuals based on their status as protected veterans or individuals with disabilities and prohibits discrimination against all individuals based on their race, color, religion, sex, sexual orientation/gender identity, or national origin",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS6gV6NNpl0-k_f3QGNqjWLTr_5Inn47PBJjorwr9I&s",
      "extensions": [
        "2 days ago",
        "100K–150K a year",
        "Work from home",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time",
        "salary": "100K–150K a year",
        "work_from_home": true
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIChpT1MvQW5kcm9pZCkiLCJodGlkb2NpZCI6IlBaN0ljWmdRNFdVQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVZCRk1rZFhRbG90UTI1cmFWWTNiRlI2T1RCU1VsRnhSR1l3VldReWVXTnJaM0JTWTJKRFVGQnJOMFZpTWpsdlZtb3ROekF6UW5GRVpVWm9YMDVtZWkwMGVGVnJNbnAwV21aaE5EaE5RMUJCVVhoMGJYRmlUbXd0VEZneGVDMUhjMVZ1TlVkSVpWaE1jMVZyV25Ka1lsWTJkV3B5TmxOSFQxcFpRMmRJWTBSbVRIQTBUbTV0VUZoNGFuRmtha0ZqT1ZVNGVYVlJkbmc1ZHpsdGQydFRkRlJEWkRob01rcExiRWxIUm1zdFlraHJjQzFSTFY4MEVoZEpka1ptV1haMlFrZzBaWGN3VUVWUWNqZHRNalpCVlJvaVFVUnFWMTh6VEMwMGJVeGhXR3AyV0ZabWNWQTFUMjA0YlRnNFJVdHZhR0paZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY184IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vd3d3LmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbW9iaWxlLWFwcGxpY2F0aW9uLWRldmVsb3Blci1pb3MtYW5kcm9pZC1hdC1pbmFkZXYtMzAyNjgxNzIyOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "CentralReach",
      "location": "United States",
      "via": "via Lever",
      "description": "CentralReach is the #1 provider of SaaS software solutions for autism care. Trusted by more than 115,000 users, we enable therapy providers, educators, and employers to scale the way they deliver Applied Behavior Analysis therapy with innovative technology, market-leading industry expertise, and world-class customer satisfaction.\n\nCentralReach Mobile (CR Mobile) is a mobile application developed... in Xamarin using C#. It enables our clients to perform key product features while in the field in both online and offline modes to provide quality care to their patients.\n\n#LI-Remote\n#LI-JM1\n\nCentralReach was developed for Clinicians by Clinicians. The story of CentralReach begins in 2012 when the company’s founder, a practicing Board Certified Behavioral Analyst, decided there had to be a better way to manage her operations so she could spend more time on what mattered most — working with her clients and patients. To help ABA practices focus on what they do best, CentralReach launched the first iteration of its EMR and practice management platform.\n\nToday, under the leadership of Chris Sullens, an award-winning CEO in the technology space, CentralReach is committed to their mission of providing cutting-edge technology and services to help clinicians and educators produce superior client and patient outcomes. Already a market leader, CentralReach is expected to grow exponentially through its four core tenets: hire and develop great people; build industry-leading products; provide exceptional service to customers and continuously invest in systems, processes and infrastructure.\n\nWe value our employees and offer a robust benefits package including health and dental, paid time off, life insurance, disability coverage and a 401(k) matching. We also provide comprehensive onboarding, ongoing training, mentoring and career pathing to help you develop your career. We pride ourselves on our fun and energetic environment that also provides our employees with a meaningful way to make a difference by helping clinicians produce superior outcomes for children and adults with disabilities",
      "extensions": [
        "Full-time",
        "No degree mentioned",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiI0MEpBQ1BTRXZLVUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUkZaS2RsRlJRblpKV21STmFuWmlielZCYmtwelpGazFRbE5mTTBaclJEaFROV1ptYjBSMFdYaE5aalZ5V2pSd00zcEJjVkZRVmtoM1ZFZGlVazB0ZURoUE4xRXlhV0Z2TVVGdGRWWXdlWGR5TFVwdWJqWnNVemRFTlVKZlJtaHlNVmw0WlhwT01GUk5PVVJyWDFrelFYcE9TREJRWDNSdVYwUmtZWGhGWlRjdFgxUldZMFF0VTNSNlNERlRSMHBPWDBSMlNsOUhlbVZMVDNCTFV6RjVPRFkyWkhKSmIwWm5YM1E0Y0dkTkxXOVRNelZJVVdKbmRVRTNPRFUxTms1bU1sQkhOMUpuRWhkSmRrWm1XWFoyUWtnMFpYY3dVRVZRY2pkdE1qWkJWUm9pUVVScVYxOHpURzlCZEVkaFZrdzNVM2xTVTFaQlRHbENPRWg1Vm01d1ZtVnhadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGV2ZXIiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxldmVyLmNvL2NlbnRyYWxyZWFjaC8yZWY4NGFiNy1hZTZjLTQ4OWItYTBlMi02YWMwYTRlOTRmMTg/dXRtX3NvdXJjZT1saW5rdXBcdTAwMjZ1dG1fbWVkaXVtPXJlZmVycmVyXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "INADEV",
      "location": "Anywhere",
      "via": "via Glassdoor",
      "description": "INADEV Corporation is a recognized SBA 8(a) certified SDB based in McLean, VA since 2011. We provide high quality agile digital services, cloud based solutions, and full end to end operational services to multiple Federal agencies, Local/State Governments and large Commercial entities.\n\nPOSITION DESCRIPTION...\n• We are seeking a Mobile Application Developer with a highly motivated, team-centric work ethic. This person will primarily focus on the design, development, and delivery of mobile applications for Apple and Android devices\n\nRESPONSIBILITES:\n• Support the entire application lifecycle (concept, design, test, release and support)\n• Develop mobile applications using Kotlin/Java (Android) and Swift (Apple).\n• Able to work across both frameworks to build mobile applications.\n• Develop solutions that integrate with other 3rd party systems using native SDKs, web services, and other technologies.\n• Elicit and analyze business processes and requirements from technical and non-technical teams.\n• Deploy applications to iOS and Google App Stores.\n• Troubleshoot and resolve issues related to mobile development.\n\nNON-TECHNICAL REQUIREMENTS:\n• Ability to pass a 7 year background check and have the ability to obtain a U.S. Government clearance\n• Must be a U.S. Citizen\n• Good communication skills\n\nTOP 3 SKILLS:\n• Android Development experience\n• Kotlin/Java\n• iOS development experience using Swift\n\nMANDATORY REQUIREMENTS:\n• Bachelors Degree and 3-5 years of pertinent experience.\n• In-depth knowledge of iOS Swift and Android Java framework\n• Experience with third-party libraries and APIs\n• Familiarity with OOP design principles\n• Excellent analytical skills with a good problem-solving attitude\n• Ability to perform in a team environment\n\nPHYSICAL DEMANDS:\n• Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nINADEV Corporation does not discriminate against qualified individuals based on their status as protected veterans or individuals with disabilities and prohibits discrimination against all individuals based on their race, color, religion, sex, sexual orientation/gender identity, or national origin",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjxFOVfwpLYQ6YBDeL0uVmZJ9DU9n7BrRxRfX1jnE&s",
      "extensions": [
        "2 days ago",
        "Work from home",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time",
        "work_from_home": true
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJ3TEhYTE1BZlh1TUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUkhKTFUwUkRZV3hHU0hjd1RWUkxMVEoyTTJ4a2R6UklORzkxTVRGU05HaFBlSHBaYVV0UVlqaFhkamRsVTJKbll6WXhXSEJCZGxGblZEZFVSVE41WVZabVExQnpjVjgwUmxWeVQwazNMV2gzU1dJNFZrNUpkeTEyUVVvemFXZHlUblZPUlRKRFdFUjVVamRUUkZsa1IyZHBaWE01UkU5MloyNDFUR1F6VVVkUGQyTjZNWGxQVGw5Q1NVNDNSa2gwUVMxelRHdEdWRk10WXpCQkVoZEpka1ptV1haMlFrZzBaWGN3VUVWUWNqZHRNalpCVlJvaVFVUnFWMTh6U1VVNVFsVlFSRzEwVHpSa1EyaDJSRXRmY0ZrNU1FcG9PVlZGVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLmNvbS9qb2ItbGlzdGluZy9tb2JpbGUtYXBwbGljYXRpb24tZGV2ZWxvcGVyLWluYWRldi1KVl9LTzAsMjhfS0UyOSwzNS5odG0/amw9MTAwNzgwMTkyMjg2M1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile App Developer",
      "company_name": "TEKTalent Inc",
      "location": "Kansas City, MO",
      "via": "via Trabajo.org",
      "description": "The ideal candidate is a team player who will be responsible for working with company data in various business areas. Specific responsibilities include reporting metrics, analyzing methodologies, suggesting operation improvements, and building proposal evaluations in a cross-functional environment. ResponsibilitiesTrack and report data Build cross-functional partnerships, internally and... externally Manage budgets Maintain a competitive market knowledgeQualificationsBachelor's degree or equivalent experience Fluency in Microsoft Office suite (Outlook, Excel, Word, PowerPoint, etc.) Strong written, verbal and collaboration skills",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7TzsXskdnZ98erKsXg9kGv5P3IhnxOR20uGui5dU&s",
      "extensions": [
        "3 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoibzNfRFBWX1hnVEFBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFJGaGxTMUpmVW5sNlJIUkZNa05VT1VOc05YUTFMV2hyZHpjeWFWcExiRzVhUW0wemRqTkpjamxTTWtScE1XbEphMHBvV1RaTWRubENOMEU0ZFVwNVpVOUhPSGg2ZURsVk5HWnlaR051UkhGWU1XbzFZVGxPUkZGVlNWSmlSMDk1VGtkVlREWkplRmhwT0ZjeGExUTROM3BtTFRkTFp6bEpablIxV25wQ2FIRnFVMDB4WTB0SFlVNTFYMlJyYW5GRWVXcExVR2MxYjFWU1dtZEVhMDloVjNCR1RYbG1NazlOY2sxd1NrMU9SVm8wRWhkSmRrWm1XWFoyUWtnMFpYY3dVRVZRY2pkdE1qWkJWUm9pUVVScVYxOHpTakp2VDB0V2MwWjVPRjk1ZG5oeWRGWjFRa2hRWTFWM1ZHaEladyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRyYWJham8ub3JnIiwibGluayI6Imh0dHBzOi8vdXMudHJhYmFqby5vcmcvam9iLTE0NDgtMjAyMjA0MTctZmQ4ZWFmZmJhNjU0NmJjNTdhYWQzNTM4NTVmN2VmNGE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile App Developer",
      "company_name": "Cyber Chasse",
      "location": "United States (+1 other)",
      "via": "via Cyber Chasse",
      "description": "[vc_row css_animation=\"\" row_type=\"row\" use_row_as_full_screen_section=\"no\" type=\"full_width\" angled_section=\"no\" text_align=\"left\" background_image_as_pattern=\"without_pattern\" z_index=\"\" padding_bottom=\"35\"][vc_column][vc_column_text]\n\nLocation : Multiple Locations\nDescription\n\nWe are looking for a qualified mobile app developer to join our team. You will be working with our engineers and responsible for developing high-quality mobile applications. As a mobile app developer, you will co-ordinate with internal teams and build the next generation mobile app.\n\nResponsibilities\n• Create, maintain and implement the source code that makes up the application\n• Write UI tests to identify malfunctions in the app\n• Design prototype applications and indicate program unit structure\n• Produce fully functional mobile apps with a clean code\n• Troubleshoot, test and debug the app to improve its performance\n• Ensure that the application meets quality standards\n• Research new mobile apps, products... and protocols\n• Adapting and using the existing web applications for developing apps\n• Familiar with the latest trends and technologies in mobile app development\n\nSkills/experience\n• Bachelor’s degree in CS/IT or relevant field\n• Knowledge of programming languages – C#, Java, Objective-C, Android\n• Knowledge of web development languages like – CSS, HTML 5\n• Familiar with mobile app programming interfaces like – Windows Mobile, Symbian, Apple iOS, etc\n• Mathematical aptitude and problem-solving skills\n• Ability to learn quickly and follow technical plans\n• Strong communication skills\n• Understanding of cross-platform mobile suits like AMP, Antenna\n• Understanding of XML, Android SDK and Android Studio\n\n[/vc_column_text][vc_empty_space height=\"35px\"][vc_row_inner row_type=\"row\" type=\"full_width\" text_align=\"left\" css_animation=\"\" padding_top=\"25\" el_class=\"q_elements_holder_shadow\"][vc_column_inner][vc_column_text]\nApply Now\n\n[/vc_column_text][vc_empty_space height=\"12px\"][contact-form-7 id=\"16298\" html_class=\"cf7_custom_style_1\"][/vc_column_inner][/vc_row_inner][/vc_column][/vc_row",
      "extensions": [
        "Full-time"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciIsImh0aWRvY2lkIjoiRXQtdkliZmJEeDRBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVkJGTWtkWFFVUmxhemhUVjFKNVJrdzJOV0pMT1RodWRUTjNSWEI0ZVdGUU0zTlpPVWRyTUZOVlltUTBObFZUTkRkUGJISlhPV3MwTmpSbFJsbzVUalpJUlZNMVQxVkVjMjVtV1hnM01VbDJUVUV5TFhoeWVFNXpUamxKVm5FemFYTnRRelZuWldSdmExRllSbWxDV25kQ1pWRjNZMEpVYkVjNGExWnJaVUpxYjBOVVRXbEZNa05vVDBwRlp6SkNRMXBUUkZKbFNsQXlOM2hPWkdGUWNFaFJFaGRKZGtabVdYWjJRa2cwWlhjd1VFVlFjamR0TWpaQlZSb2lRVVJxVjE4elNYQlZabFYxY0Y5aFVYQnpObXhuUTBGZlVUUkVaRlJXU0ZodFVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ3liZXIgQ2hhc3NlIiwibGluayI6Imh0dHBzOi8vY3liZXJjaGFzc2UuY29tL3dvcmstd2l0aC1vdXItcGFydG5lcnMvbW9iaWxlLWFwcC1kZXZlbG9wZXIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile Application Developer",
      "company_name": "Technology Partners",
      "location": "Anywhere",
      "via": "via LinkedIn",
      "description": "We are looking to hire a React Native developer to work on a mobile app for one of our clients. You will be responsible for building a performant mobile app on both the iOS and Android platforms. You will work as part of a small team to build React Native iOS / Android applications. Architect, build and maintain excellent React Native applications with clean code. Implement clean, modern, smooth... animations and transitions that provide an excellent user experience. Integrate third-party API's. Write unit and integration tests. Release applications to the Apple and Google Play stores. Work as part of a team, which will include other developers, a project manager, and a designer. Complete sprints and participate in sprint retrospectives and standups. Assist with building estimates. Interface with clients via Slack, Zoom, and email. Track your time throughout the day using Jira. Work with modern tools including Jira, Slack, GitHub, Google Docs, etc.\n\nRequired Skills & Experience:\n\n-React Native experience\n\n-Familiar with Typescript (necessary)\n\n-React Query experience (nice-to-have)\n\n-Experience in support and improvement for legacy systems (necessary",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRpzyFEAb96JQ-TgiOCiUupCcKUtQF-XmR7pohsQA0&s",
      "extensions": [
        "2 days ago",
        "Work from home",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time",
        "work_from_home": true
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiI2YWV6QUxJZ1J4QUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUkVOUVlWRkNRbEJJUjE5NU5XZ3RaM0ppV2s0dFVHaFRXbmhYUVhVM1lVSnZYek5FVVVKRWFUazNaVGx0ZEdkaVoyWnpTMDF1U25ndFJqYzFUWGxOUWpaRU5WcHJTVkZ5ZGtGRFFuZDRXREpFVTB4T056UlhaVzEyVDJsTE5ESjRZazFuV2xBME5GaEtMV1YyU2sxdmVuRlVOM1ZuZUd4cFNXZFJabWQ2TUVGVFlqSm5SemxWVFZKRE9XaHNXbXRJTjBGS1NYaElhMXBqTjI1aVVtUmtaR1ZYWDJseVdrNVZWRWQ0U1V3elJXNXRWM016YlROU1VEUlFOblZPUjNSU1QxQkdkREo0RWhkSmRrWm1XWFoyUWtnMFpYY3dVRVZRY2pkdE1qWkJWUm9pUVVScVYxOHpTV0UwZFhnM01VRnVkR2xuVjBFdGR6TldUbWRKWkVSNGNsOU9VUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vd3d3LmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbW9iaWxlLWFwcGxpY2F0aW9uLWRldmVsb3Blci1hdC10ZWNobm9sb2d5LXBhcnRuZXJzLTMwMjY4NTU1MTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Sr. Software Development Engineer - Mobile (iOS), AWS Amplify",
      "company_name": "Amazon Web Services",
      "location": "Canada",
      "via": "via Adzuna",
      "description": "Description\nJob summary\nAre you passionate about open source? Do you want to make app development better for millions of native mobile developers? This is a unique opportunity to join us and lead an Amplify Framework engineering team. The Amplify Framework (https://aws-amplify.github.io/) was launched in November 2017 and has quickly gained popularity within the industry. Adoption and usage of the framework has also grown rapidly but it is still Day 1 for the team and for our product with an extensive set of new capabilities scheduled for delivery in 2022.\nThe Amplify Framework is a collection of open source libraries and tools that enable developers to create mobile and web apps on AWS. Amplify codifies best practices through programmatic interfaces to help developers effortlessly interact with AWS services. More info about our mobile projects are at : https://github.com/aws-amplify/amplify-android and https://github.com/aws-amplify/amplify-ios\nYou will be responsible for developing... the SDKs (iOS, Android, React Native, Unity, and Xamarin) that help eliminate the friction and complexity of wiring up mobile app projects to AWS services. Our mission is to make it easy for Mobile App Developers to get up and running quickly using AWS services even if they are unfamiliar with them, so they can focus on building great innovative experiences for their customers.\nWe are looking for a senior developer who is passionate about creating software for other developers and has a strong track record of successfully delivering new features and products. A commitment to team work, initiative, and strong communication skills are a must. Creating reliable, scalable, and high performance products requires exceptional technical expertise, a sound understanding of the fundamentals of Computer Science, and practical experience building scalable software products. This person thrives on delivering high quality technology solutions in an environment where priorities shift fast to meet the changing needs of our customers.\nAs a member of the team, you will:\n· Work closely with the product team and other AWS teams to deliver on the team's technical vision\n· Influence technical strategy to build products developers will love\n· Drive team discussions on system architecture and component design\n· Lead development and launch of core features and products\n· Participate in all stages of the software development cycle, including design and development of significant new architectural systems and improvements\n· Participate in estimation and sprint planning\nMentor\nWe have a formal mentor search application that lets you find a mentor that works best for you based on location, job family, job level etc. Your manager can also help you find a mentor or two, because two is better than one. In addition to formal mentors, we work and train together so that we are always learning from one another, and we celebrate and support the career progression of our team members.\nInclusion\nHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon's culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\nWork-Life Balance\nOur team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren't focused on how many hours you spend at work or online. Instead, we're happy to offer a flexible schedule so you can have a more productive and well-balanced life-both in and outside of work.\nBASIC QUALIFICATIONS\n· 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\n· 3+ years of programming experience with at least one modern language such as Java, C++, or C# including object-oriented design\n· 4+ years of professional software development experience\n· 2+ years of experience as a mentor, tech lead OR leading an engineering team\n· 5+ years of professional software development experience\n· 3+ years of programming experience with Swift or Objective-C\n· 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\nPREFERRED QUALIFICATIONS\n· Bachelor's degree in computer science, computer engineering or related technical discipline\n· 5+ years professional experience in software development\n· Computer Science fundamentals in data structures, algorithm design, problem solving, complexity analysis, object-oriented design, and design patterns\n· Proficiency in, at least, one modern mobile native programming language such as Swift or Kotlin\n· Working knowledge in at least one of the following platforms: iOS, Android, React Native, Unity, or Xamarin\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. If you would like to request an accommodation, please notify your Recruiter",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQUvtusYsAu1eiZep3_qv7BoT8G7PAGYl4PjAGd&s=0",
      "extensions": [
        "29 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "29 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRGV2ZWxvcG1lbnQgRW5naW5lZXIgLSBNb2JpbGUgKGlPUyksIEFXUyBBbXBsaWZ5IiwiaHRpZG9jaWQiOiJyS2ZzS3lJdE9kZ0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUTAxZlNFaFplRFp3ZUMxNlYyVmljek40UkRCWk9FeDVWbTUyTXpCS1ExVnJXSGh5Ymw5cFVVcFBSblJ4V0V0QloyUjRNV2xKWVZnMlVYQk9YMHN6ZDNkQ2VEWllkMDAyYVRCeFF6WTJiV05CYW01NWJsZGxXR1ptZFZBMmVqVmFiMmw0ZUZSb2VXaFVYMmx0Y2xOTU5rVjFjbWRxTlUxV1ZFRXRUSEJYVG1aMGNFbFVhRzltWkVSMFVuWXplak4yZEdKalgzUjJSV1JJWVU1VFQzVlhXRXRhZG1SYVluRlBhV3d6Y2pkVU16SlpFaGRNZGtabVdYVkVaVWx2UjNGM1ltdFFNV1pYWm05QmR4b2lRVVJxVjE4elNVOUNXWFpXYkRkT1VFcEllR3BxVUcxWFFVVlhibEY0U0d4RVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBZHp1bmEiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYWR6dW5hLmNhL2RldGFpbHMvMjk5MTk4NTIwNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Application Developer I",
      "company_name": "Jonas Software",
      "location": "Canada",
      "via": "via JobCanada24h.com",
      "description": "Job Description:\n\nMobile Application Developer I\n\nDo you love building mobile apps? Do you love flutter more? We have just the thing for you!\n\nWe are recruiting for a full-time, Mobile Application Developer I. As a mobile developer with InnoSoft, you will work closely with a fun, agile team and have the opportunity to use your creativity and innovation towards developing exciting mobile products. We also offer continuous growth opportunities to help evolve and advance employees’ careers within InnoSoft.\n\nWhat will your day-to-day look like?\n• Support the entire application life-cycle (concept, design, test, release and support) for mobile applications and web applications\n• Develop cross platform large scale applications\n• Identify and implement processes to reduce development cycle time\n• Write unit and integration tests to ensure we deliver high quality working software\n• Troubleshoot and debug to optimize performance\n• Participate as member of a Scrum team\n\nSpecifically looking... for:\n• Flutter/Dart\n• REST or GraphQL Api\n• AWS\n• Git / Team source control\n\nNice to have:\n• Javascript\n• Python\n• Relational Database Experience (Postgres, MySQL, MS SQL)\n• Node.Js\n\nYou probably possess some of the following skills/ experience/ interest:\n• University or College graduate or equivalent\n• Self-starter with strong work ethic, superior attention to detail and keen problem solving skills\n• The ability to work independently on multiple projects simultaneously with minimal direction\n• The ability to quickly diagnose customer issues, provide seamless resolutions, and effectively communicate this information with other team members\n• Familiar with software life-cycle and quality assurance concepts\n• iOS & Android Developer Tools, SDKs and Emulators\n• Deployed apps to the Apple Store and Google Play\n\nAbout InnoSoft\n\nInnoSoft is a software company that has developed Fusion - an application that makes it easy to manage recreation facilities and its members. Our platform integrates hardware and software and provides applications for desktop and mobile users. We help to manage recreation departments for some of the biggest and best universities in Canada and the United States – including Harvard, Stanford, the University of Florida, Notre Dame, UCLA, Western and Waterloo to name a few.\n\nWhat else do you want to know?\n• We are a small, nimble team of 45 but we’re backed by one of the largest software companies in Canada, Constellation Software.\n• We offer a flexible, fun working environment and we’re not all about clocking in/out.\n• We work with the most prestigious universities in North America.\n• A competitive benefits and vacation (3 weeks + 5 flex days) package are included.\n• Professional development is important to us, which is why we’ll reimburse you for up to 5% of your annual salary for role-relevant courses and seminars you take.\n\nBusiness Unit:\nInnosoft\nScheduled Weekly Hours:\n40\n\nWorker Type:\nRegular\nMore About Jonas Software:\n\nJonas Software is the leading provider of enterprise management software solutions to the Country and Golf Clubs, Foodservice, Construction, Fitness & Sports, Attractions, Salon & Spa, Education, Radiology/Laboratory Information Systems, and Product Licensing industries. Within these vertical markets, Jonas is made up of over 65 distinct brands, which are respected and leaders within their own domain.\n\nJonas’ vision is to be the branded global leader across the aforementioned vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of ‘Software for Life’ and as an ambassador for technology, product innovation, quality, and customer service.\n\nJonas Software is the valued technology partner of over 60,000 customers worldwide in more than 30 countries. Jonas employs over 2,000 skilled individuals consisting of a cross-section of industry experts and technology professionals. Jonas is headquartered in Canada and also operates offices throughout North America, the United Kingdom, Europe, Australia New Zealand and Africa. Jonas is a 100% owned subsidiary of Constellation Software Inc., headquartered in Toronto and traded on the S&P/TSX 60",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQt4k41oIXz5cXGl0dJ3X3XJ-QKYKmKpjzFn63pYeM&s",
      "extensions": [
        "16 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "16 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIEkiLCJodGlkb2NpZCI6IkdpLVdEUU9qVkxrQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVZCRk1rZFhRWEpDYlhSWU4wZHhlV2R4WWtaMFpWWjNXbmRVU3pCNlprcFBlamQyVUVkNWQwazNUa2xOTUROeGNXdE5kV3RDV1ZCbE5FdElNM1Z4ZWt4eGFUWndhbXQxVEhZM2FtWnRSMms0TmtacmRsVXRSbWxCYTNKb1RXVlBRakJ4Ym1KRmJXWmpiVGhYYTFoMFoyZE9aVWhKZWxWYVpXVktTSEpuYmxOQ01XUTNjVGhhTkU1TFVGQllZM2RwVFVVd2FsWlFhVGxCTFhoU2MyOUxZMGd3WkdkRFlVSk1PVXgxZUUxUU5EbDFWRWQyTkdOQkVoZE1ka1ptV1hWRVpVbHZSM0YzWW10UU1XWlhabTlCZHhvaVFVUnFWMTh6U1hVM2NrNDBjMmt5V0MxdWJISmtNbFJWWmxaT2FFdElaRE5IUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYkNhbmFkYTI0aC5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JjYW5hZGEyNGguY29tL21vYmlsZS1hcHBsaWNhdGlvbi1kZXZlbG9wZXItaS1qb2IzODI3Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Developer",
      "company_name": "PinPoint Talent Inc.",
      "location": "Canada",
      "via": "via Trabajo.org",
      "description": "In this role, you will play a central role in delivering well designed, highly testable, and resilient applications. The team is small but mighty so you'll be instrumental in helping drive a mobile technology roadmap forward and evangelizing mobile development and testing practices.\n\nThe biggest part about this role is that you are a team player that thrives in a collaborative agile environment.\n\nSkills and Experience:\n• 3+ years designing and implementing Android/IOS applications\n• Experience with React Native would be an asset.\n• Experience designing mobile applications to consume server-based REST APIs\n• Solid foundation in data structures, algorithms, object-oriented programming, MVC architecture, and Android design patterns\n]]>",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQoK9ii9Oc6QMoYf1oXR0cgW3P_QfqNI3-1QfYi8Zg&s",
      "extensions": [
        "4 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "4 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiI2WU9fWGV5SUowb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRyYWJham8ub3JnIiwibGluayI6Imh0dHBzOi8vY2EudHJhYmFqby5vcmcvam9iLTEyNjItMjAyMjA0MTYtNTdlOTZlNjAxNGNmMzFlMzA1YTBhNTA4ZDEwMTJhNmI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Unified Application Development Specialist",
      "company_name": "TransX Group of Companies",
      "location": "Canada",
      "via": "via BeBee Canada",
      "description": "About TransX\n\nThe TransX Group of Companies is one of the largest providers of premier integrated transportation and logistics services across North America. With 9 locations across Canada and the USA, approximately 1800 team members, over 4000 trucks, trailers and containers, our team is dedicated to building strong business relationships and providing service excellence to support our customer's business needs.\n\nTransX team members demonstrate a high level of initiative, commitment to customer service excellence, passion for providing innovative solutions and achieving results. TransX will set the industry standard for safety, service and customer satisfaction in all market segments in which it operates. TransX supports team members in achieving their potential and values relationships built on trust, respect and integrity.\n\nOur goal is to be the premier provider of rail-centric transportation solutions to North America's business community. It begins with employing, retaining and... developing the best employees in the industry.\n\nFor more information, visit and follow us on LinkedIn.\n\nThe Opportunity\n\nTransX has an exciting opportunity for a Unified Application Development Specialist to join our IT team in the Winnipeg Terminal. We are looking for an individual that is strong, active and possesses a solid work ethic. This position report's to the Director of Development and will be responsible for engineering, designing, building and managing critical interfaces between systems and people who use them.\n\nShift: 8:00 a.m. to 5:00 p.m.\n\nThe essential functions of this position include but are not limited to:\n• Leading and participating in application design projects and initiatives across the organization.\n• Developing and prioritizing long and short-term goals, objectives and deliverables for the program\n• Work with internal and external development entities, clients and management to gather requirements, develop targets of strategic functionality and execute on the building of proof of concept through production deliverables within a highly responsive agile development team.\n• Research and engage target user groups to understand evolving needs, priorities and deliverables\n• Incorporate and guide Sales and Marketing digital business strategies to support operational needs\n• Evaluate, develop and/or modify systems and processes as necessary to respond to client needs.\n• Assure that clients are served in an effective and responsive manner.\n• Participate in identifying and developing costing and ROI strategies and managing expenditures to ensure projects / solution implementations are on target.\n• Develop and present visual mock-ups, wireframe, demonstration and workflow materials to aid in training and investment\n• Supervise and manage equipment and other resources allocated to the program.\n\nQualifications\n• Post- Secondary Education or equivalent in modular multi-platform application development.\n• Significant experience as a multi-platform application developer or similar role with previous experience owning the development and deployment of digital products for enterprise clients\n• Consideration will be given to those with a combination of experience and education which would provide the required knowledge, skills, and abilities.\n• Ability to train and supervise technical and operational staff; ability to plan, organize, coordinate and evaluate the work of others.\n• Proven ability as a data-driven critical thinker capable of independently researching and analyzing new and existing technology solutions to prepare prioritized budget recommendations.\n• Experience in project management in a highly agile and responsive working environment\n• Ability to establish and maintain effective working relationships with other employees, vendors, contractors and the general public.\n• Ability to successfully apply information engineering techniques; ability to develop customer centered information delivery and self-service systems; ability to effectively design and use relational and graph databases; ability to effectively test and debug systems and programs.\n• Ability to accurately estimate time and cost requirements in project development, resource requirements, planning, organization and implementation.\n• Excellent interpersonal and communication skills to engage, discuss and explain engineering options\n• Ability to interact with users and clients as a positive agent of change and deal with challenges\n• Ability travel occasionally to various locations including outdoor settings, activity at field or program service delivery work sites, and some evening and/or weekend hours.\n\nTechnical Skills:\n• Experience in rich-client, web based and mobile app development on Wintel / Android / IOS\n• Strong understanding of T-SQL and .NET based development architecture a plus\n• Experience in development of and against third party API and Microservice architectures\n• Good understanding of agile development methodologies and modern service delivery platforms\n• Experience in universal code design practices to ensure efficient and timely delivery of functionality\n• Strong workflow / systems analysis and testing skills for objective product enhancement\n\nThe Rewards\n\nWe offer competitive comprehensive compensation and benefits program. A career with the TransX Group provides you with the opportunity to develop your potential. An entrepreneurial spirit is encouraged, and success is rewarded. We operate with the philosophy that the company is successful when its employees are successful",
      "extensions": [
        "3 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJVbmlmaWVkIEFwcGxpY2F0aW9uIERldmVsb3BtZW50IFNwZWNpYWxpc3QiLCJodGlkb2NpZCI6IndFTk9FMk1fRVhzQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVZCRk1rZFhRblJWTVRoM1dXTnlaMEp3ZGxOTFdYbFVVMnQ2YVROS0xUUmtWM2QyU0ZkUVdVdDVTRkZvVTJNeWVHSnRTemhTVDFsUWFXOUNMVUZHVm10bmRuWnZTRlZ4VmpSSFNVeEdNbEJVVlZwVFIzWnFTbVpuTkVac2VHcGpiR2sxYWpCc05raElOR3BWWjI5eVFtWjVaMmMwYVVWRVFrWlZhRTl3YUhoaWR6Tk1WbWhmT0c5SGNURndlbU4yYnpkTlFWY3pOQzF4VkY5aGNtMDRVazFqZVhKZmNFeHZValYzUkhwUmVISmhRM040TTAxSE16VXlkRTk2V0V4QmJXUnVjbVJrYXpFd1lqRlVFaGRNZGtabVdYVkVaVWx2UjNGM1ltdFFNV1pYWm05QmR4b2lRVVJxVjE4elNXcHdhVXMxVUZOTGRWRlNUVWxXYVZSb2RFbG1jbkExUm1rMFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSBDYW5hZGEiLCJsaW5rIjoiaHR0cHM6Ly9jYS5iZWJlZS5jb20vam9iLzIwMjIwNDE3LTlmYTBlYzRlYzdjYjg0YWY5MmNjNDMxMzY4M2U5ZGEwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Senior iOS Developer",
      "company_name": "eventbase",
      "location": "Canada",
      "via": "via Glassdoor",
      "description": "We're looking for an enthusiastic and highly capable Senior iOS Developer to join our Mobile Team.\n\nThis is a full-time position and can be based anywhere in Canada (the team is based in Vancouver, BC and all currently working from home).\n\nDay to day you will be writing code for new features, maintaining our Product codebase, automation for CI/CD, mentoring other team members on the latest and greatest or just solving complex problems that arise when your code is put into production on tens of projects for various clients.\n\nCareer growth is important to us and a number of our Mobile team members have grown into their roles. Your ability to mentor them through knowledge sharing and working with your Manager to create a robust training program for them is an important piece of this role. Successful Mobile Developers on our team are highly organized, self motivated, solution-oriented problem solvers. They iterate, dig deep, deliver on-time, and are excellent team players.\n\nAbout... Eventbase\n\nEventbase has set the gold standard for live event technology for more than a decade. We power mobile event apps for global brands including Salesforce, Cisco, SAP, Deloitte and Charles Schwab. We also build official mobile apps for massive events including South By Southwest (SXSW) and National Retail Federation Big Show, as well as three Olympic Games. Eventbase has been recognized with more awards than any other event app platform, including being named winner of “Best Event App” at the Event Technology Awards five times.\n\nWe are driven by our mission: to bring people together for the magic of live events, and we’re proud that our industry-leading products have been at the heart of exceptional live events around the world since 2009. Millions of attendees across thousands of events have held Eventbase’s product in their hand as they walked the conference floor, participated in sessions and interacted with others onsite. Our team has a track record of pioneering breakthrough live event technology, and there are more exciting innovations to come. The event industry is being reinvented in the wake of Covid-19, and Eventbase is uniquely positioned to play a key role in this new world of events. We’re moving forward with our vision to shape the future of live event experiences.\n\nAre you ready to join the industry leader in live event technology?\n\nWhat You'll Do\n• Design and build highly customizable native applications for the iOS platform in Objective C, Swift\n• Design and refactor legacy code into reusable modular components\n• Hands on with planning, estimating, contributing to the architecture, coding, development\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Work with outside data sources and APIs\n• Unit-test code for robustness, including edge cases, usability, and general reliability\n• Work on bug fixing and improving application performance\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Taking responsibility of release automation, security issues, contributing to the ongoing support of the live apps with on-site or on-call to resolve technical issues\n• Mentor junior developers to follow best coding practices, enhance debugging skills\n• Maintain and upgrade the codebase to latest frameworks\n• Document custom features in project wikis and code\n• Ability to read/review Kotlin / Java code is a plus to have\n\nWhat You Bring\n• You bring 6 years+ experience in iOS application development with ideally at least 2 years at a senior level\n• Experience with the following technologies: Swift, Objective-C, Swift UI, RxSwift, SQL, HTTP, JSON\n• Experience working with Android development using Android Studio a plus, but not essential\n• Experience leading a team of developers\n• Experience / exposure working in an Agile environment\n• Possess analytical and troubleshooting skills with technical capability\n• Ability and desire to share your knowledge and help grow the team\n• Ability to adapt to changing priorities\n• Passion for mobile technology and using apps, stays up to date with latest iOS improvements and news\n• Built or participated in the submission & management of great apps on the App Store\n• Ability to understand and translate business requirements and technical specifications\n• UI design principles, patterns, and best practices\n• A knack for benchmarking and optimization along with quality\n• Proficient understanding of code versioning tools, such as Git, Bitbucket, Charles Proxy,\n• Phenomenal interpersonal skills and written/verbal communication skills\n• Solid sense of personal accountability; contributes beyond job role and responsibilities\n• Have a focus on continual learning, and are excited about being able to share knowledge\n\nWhy Join the Eventbase Team?\n\nAt Eventbase we value trust, respect and authenticity, and believe we are all better together. Joining the Eventbase team means you will enjoy a progressive work environment with some exceptional perks, including the option to go onsite at some of the largest events on the planet. We enjoy “No Meeting Fridays” and Eventbasers get every second Friday off, so you can have an extra 26 long weekends every year in addition to statutory holidays. We have a $1,250 annual professional development allocation and $1,000 per year to set up your home office. We also offer comprehensive benefits including extended health care from your first day, a $1000 flexible health/wellness spending account, paid parental leave for all new parents, and paid mental health days. And of course we offer competitive market salaries and employee stock options too.\n\nAt Eventbase we work hard and smart, and take time to celebrate our wins. We are a “remote-first” organization, so our team can work from anywhere in Canada. You will never be required to work out of an office if it doesn’t work for you.\n\nWe’re proud of our diverse team: Eventbasers hail from all over the world, with many different backgrounds, cultures and interests. We actively promote women working in technology both internally and by partnering with women in tech organizations externally. We do not discriminate based on race, religion, colour, national or ethnic origin, gender or gender identity and/or expression, sexual orientation, age, marital or family status, veteran status, or disability status.\n\n#LI-Remote\n\nAPPLY FOR THIS JOB",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwrunVsrdLuypqDLM6E_D-Cw0cyqUnjFEL2v9qemY&s",
      "extensions": [
        "24 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "24 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImh0aWRvY2lkIjoiOWlHVkQ4MkMtQ3NBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLmNhL2pvYi1saXN0aW5nL3Nlbmlvci1pb3MtZGV2ZWxvcGVyLWV2ZW50YmFzZS1KVl9LTzAsMjBfS0UyMSwzMC5odG0/amw9MTAwNzU5OTg0OTM2MVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Software Development Engineer",
      "company_name": "AbeBooks",
      "location": "Canada",
      "via": "via NUjobcentre.ca",
      "description": "Job summary\nAmazon Mobile is looking for a Software Development Engineer to help create the best shopping experience for customers wherever they go on their favorite mobile devices. As a member of the Mobile Shopping Foundation Team you will build the next generation mobile foundations to power fast, fluid, and interactive experiences within the Amazon Shopping applications for iOS and Android.\n\nAmazon Shopping mobile engineers have a diverse range of skills and talents and we can't wait to harness your passion to make us an even stronger team. We set and raise the bar on the mobile app shopping experience by engineering frameworks, technology, and code that is used by thousands of developers across Amazon. We help Amazon teams discover and explore new ways for customers to complete common shopping tasks quicker, browse more efficiently, and discover new features. We think in terms of frameworks not features; stability, scaling, and performance over using technology to solve discrete... problems. We want our customers to go from wanting a product to search, shop and buying it in 30 seconds or less. And the Mobile Shopping Core team is where that all begins.\n\nAbout you:\nYou are an engineer looking to build and expand on your passion for mobile devices. You want to challenge yourself to solve complex problems at scale that have never been encountered anywhere else. You want to exercise and expand your creative thinking skills and code writing chops to become an even deeper expert in the mobile space. You are passionate about mobile and want to work with an equally passionate and driven team to invent new technologies to disrupt the world of application development on mobile devices. You want to learn from others and help challenge yourself and others to grow. You want to talk directly to your customers and partners to shape the vision for code quality, design and architecture for the mobile app development stack.\n\nAbout us:\nWe're going to change the way customers shop on mobile applications. Along the way, we're going to face challenging and interesting problems that no one else has seen. We'll leverage our camaraderie and strong culture to break down walls to find solutions that challenge our original assumptions, make the tough decisions, and deliver a final product that's superior to the proposals we started with.\n\nInterested? Have the passion to build - and drive to ship - all of this with us? We're waiting to talk with you. Let's get started!\n\nBASIC QUALIFICATIONS\n• Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design\n• Bachelor's degree in computer science related fields OR 1+ years equivalent experience in software development\n\nPREFERRED QUALIFICATIONS\n• Experience building complex mobile applications on Android or iOS\n• Experience in web technologies such as JavaScript, React, AJAX and HTML5\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. If you would like to request an accommodation, please notify your Recruiter",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR85bgh8xv228eQBCLms3Nh3GL9lLpl7cMI7cNN3ig&s",
      "extensions": [
        "1 day ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "1 day ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBFbmdpbmVlciIsImh0aWRvY2lkIjoidThaWFZiMW03aWtBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVkJGTWtkWFFrRjNSeko2T0hGb1NYUjNValpVWVhSWmNsWTRWbFZKUVROeVdIWjFlR1pvY2tSRVpHSlZUREZ1UVRoeE5qWnFTbGROTW5NMlRqWktXa3d0TWsxSmF6ZHhkeTExV0VoTlZrWkRlVkpzUlhGRUxYaFdXRGt5VkdFNFFVRnNRbUl4VnpOS1gwaEdNVlF6V0RGUWVuTlpiVU51ZVc1TlRsWllka3N3UzJsVmJsRlhlalphT0hadU1ISjVMVUp6Vm05elh6WkJUV2g1ZUc5WFptZDNFaGRNZGtabVdYVkVaVWx2UjNGM1ltdFFNV1pYWm05QmR4b2lRVVJxVjE4elN6SlNYMTkwVTFvemNreFZRak5UUzB4ZlYyc3dNSE0yTFRocFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOVWpvYmNlbnRyZS5jYSIsImxpbmsiOiJodHRwczovL3d3dy5udWpvYmNlbnRyZS5jYS9qb2JzL3NvZnR3YXJlLWRldmVsb3BtZW50LWVuZ2luZWVyLW1vYmlsZS1zaG9wcGluZy1mb3VuZGF0aW9uLXZhbmNvdXZlci0xMjE0NjExP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "iOS Developer",
      "company_name": "TalentBurst, an Inc 5000 company",
      "location": "Canada",
      "via": "via LinkedIn",
      "description": "Title Mobile Application Developer iOS\n\nLocation Ottawa or Quebec\n\nDuration 12 months contract\n\nThe mobile software engineer will work closely with product owners, system architects, software engineers, UX/UI designers, security teams, technical writers, customer support team, and 3rd parties as necessary to ensure timely delivery of quality products and to provide support throughout the lifecycle.\n\nResponsible for developing and testing iOS projects.\n\nThis includes\n• Develop /follow mobile application coding standards to facilitate code maintenance and enhancement\n• Continuously improve code quality through writing unit tests, automation and performing code reviews\n• Design, implement and execute the automation testing to improve the test execution efficiency for the SDK and App to deliver user perceived quality of the product\n• Integrate with our backend services to make sure we are delivering a great mobile user experience\n• Interface closely with product managers, user experience... operations and customers to understand end user requirements and convert them into a pragmatic and effective technical solution\n• Participate in brainstorming sessions and contribute innovative and original ideas to our technology, algorithms and product\n• Resolve issues found during engineering test and QA in a timely manner, taking risk into account\n• Coordinate with customer support teams to diagnose product issues and successfully deliver results within a schedule\n• Consistent use of group tools such as Jira, Confluence, Git/GitHub for tracking of defects and management of code.\n• Independently manage time and prioritize tasks to achieve results within cost and schedule constraints\n• Swift and Swift UI Experience/knowledge\n\nLocation: Quebec or Ottawa-\n• Work from home but able to come to the office 3 times per year for IT related duties\n• Strong possibility of conversion based on work performance\n\nRequired Skills:\n• Xcode\n• Git\n• Swift\n• SwiftU\n• Objective\n• Possibility to convert to a perm position\n\nSkills\n\nMinimum Requirements:\n• (USD)3+ years' development and testing experience in mobile app/SDK\n• BS in Computer Science or equivalent\n• Must have demonstrable portfolio of released applications on the App Store, i.e. Released at least 1 app to App store (preferred)\n• Must have demonstrated experience and expertise programming in Swift/Objective-C/C\n• Must have prior experience using Android software development tools such XCode to develop, test, debug, and deploy quality software\n• Must be able to utilize tools such as git/GitHUB and JIRA/Confluence in the software development process\n• Prior experience in the use of API design such as REST\n• Strong knowledge of CI/CD pipeline to build, test and deploy mobile apps/sdks\n• Experience with creating test strategy and UI automation testing for mobile apps\n• Experience with Agile development practices\n• Excellent analytical, communication and presentation skills – verbal and written\n• Highly motivated and self-driven\n• Proven ability to work independently on assigned tasks\n• Occasional flexibility to work outside of normal business hours to collaborate with teams in different time zones\n\nPreferred Qualifications\n• Experience with Android using Java/Kotlin is an asset\n• Experience with Xray to manage tests is an asset\n• Referrable development experience with WearOS/WatchOS and macOS apps\n• Experience with multi-site / multi-cultural team management\n• Understanding of enterprise application development, software as a service and enterprise security technologies\n• Able to think out of the box to offer innovative solutions to technical problems\n• Able to adapt communication style to match the needs of the audience\n• Scaled Agile Framework (SAFe) environment experience is a plus\n\nEducation\n\nBS in Computer Science or equivalent",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSm3o-Y32s0qGfZU7XoTQL3Bj--1diV7mpGyXwjqv8&s",
      "extensions": [
        "5 days ago",
        "$45–$57 an hour",
        "Contractor"
      ],
      "detected_extensions": {
        "posted_at": "5 days ago",
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJwRnFsekRiSE9YY0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFWQkZNa2RYUkVsT1p6QnBhSEpYWmxOdE5tcE5hMDlVYjNwT1ZsTjVRV2hZTUVGaGFrRklla001Umtsa2FXUnNhR0Z2ZFhWeGIwNVFSV1ZKVG5KQldYbDVielZsY2pZdFpIRllkMlZtWVhSek5EVm5SME5PYldKWVNVTlJlRzFqZVdZdFRHZ3lkbWxEUTNwbFV6TXdaVzEwY2pKU05WQTRkMjlyZDBveFdIcFBOV3B3YlRWTlN5MWlNRWczWW5kTFRXNVdTbFpEZFhFemVrSktVRTFQUjBOdGJWOVhiR3hLTUVndE0xTjBSV1pRZFZac1V6bGpiV2g2T1dwWlZqbExOMnRuZUZJM1pITllRVll5U2tGVlZISk1PVjlvV1VKbk9XSXpabWhEYVdKQmR4SVhUSFpHWmxsMVJHVkpiMGR4ZDJKclVERm1WMlp2UVhjYUlrRkVhbGRmTTB4V1RXaHViM28xYm1adVozRlVSM0ZtVFZJelltRXhVMFpOUVZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL2NhLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvaW9zLWRldmVsb3Blci1hdC10YWxlbnRidXJzdC1hbi1pbmMtNTAwMC1jb21wYW55LTI5OTAyNjAyNzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer-iOS Developer",
      "company_name": "Cognizant Technology Solutions",
      "location": "Canada",
      "via": "via JobCanadian.com",
      "description": "Cognizant is looking for an iOS Developer with 6-10 years of experience in developing customized product for our clients. Cognizant needs a motivated individual to challenge the status quo and provide thought leadership/best practices to enhance our current services and technologies.\n\nAn ideal candidate is someone who enjoys working in a fast paced, collaborative environment. Someone that values the “team” and leverages the opinions and expertise of their teammates to deliver quality.\n\nSr. iOS Developer\n\nRoles and Responsibilities\n\nTechnical design and engineering of new features used by thousands of high/ultra-high net-worth client’s US Wealth Management clients\nParticipate in UI Design workshops to contribute in shaping the User Experience\nThorough & constructive code review reviews with focus on functionality, code style & architecture\nSupport in maintaining existing features and fixing production defects\nProvide input and feedback on how our team can do better (from any... perspective). Automation, Unit Testing, etc.\n\nMust have skills:\nXcode, Swift, MVVM, Universal (iPhone/iPad) App Dev, Storyboarding, Writing Unit Tests with XCTest Framework, REST, Debugging Network Requests with Proxy\nAccessibility (Voice Over, Dynamic Text Size)\nEverything above is performed on a daily basis\nObjective-C is a bonus as there are some frameworks still using it.\n\nNice-to-have Skills\n\nHands on DevOps knowledge\nKnowledge in publishing apps to the app store\nBackend (Node.js / Javascript) development\nFirebase, Google Analytics\nAutomation\n\nWhy Choose Cognizant?\n\nIt takes a lot to succeed in today’s fast-paced market, and Cognizant Technology Solutions has become a leader in the industry. We love big ideas and even bigger dreams. We stand out because we put human experiences at the core.\n\nOur associates enjoy robust benefits and training opportunities from our industry recognized, award winning Academy team. You will have access to hundreds of technical training to keep your skillsets fresh and have opportunities to obtain certifications on the latest technologies.\n\nEverything we do at Cognizant we do with passion—for our clients, our communities, and our organization. It’s the defining attribute that we look for in our people.\n\nIf you are comfortable with ambiguity, excited by change, and excel through autonomy, we’d love to hear from you!\n\nCognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.\n\n#LI-PH1\n\nIND 123\n\nEmployee Status : Full Time Employee\nShift : Day Job\nTravel : No\nJob Posting : Feb 08 2022\n\nAbout Cognizant Cognizant (Nasdaq-100: CTSH) is one of the world’s leading professional services companies, transforming clients’ business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRz72IGBIDuahZVeknW9OJ73oPVSRbb5wWeIDC84yw&s",
      "extensions": [
        "21 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "21 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyLWlPUyBEZXZlbG9wZXIiLCJodGlkb2NpZCI6Ik5GTnlJNGsxUEVjQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVZCRk1rZFhSRGxSYkZSWlgyaEhhMHhFZWtWUFFrMVVaVzh5YVRCRE1rNUhNMDQyV1V4RmJtTkhNSGhtZEZOYU9XWjJZVkkxUld3MWJDMU1ZVFp2T1ZGalUyVklVSG96VlZRNFIwRmxUME5VYm1kaGIwMTVjVGxXZVdSVFV6SnVlakF5VUhSdE1ETkNTMkpFVVVGR05FaE1VbUZYWDBaS1UxTkRMVTFZVmtRMU1USkdjbUZaUTFkRE5FcGFXR2gwUTBVd2FsQlFRVXhqT1RKdVpXdEdaemN6U2w5S1pteDBhMUUyZDFJd1UxWmFORk5mU0ZCVWMyNXRiVXBOVkhoTldWVndWVGhVYzA0d01HNU9FaGRNZGtabVdYVkVaVWx2UjNGM1ltdFFNV1pYWm05QmR4b2lRVVJxVjE4elNXa3dUa2h2TlV0bE5rWlRhMDFVVEdkRVEydFNXWGt3U1hrd1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JDYW5hZGlhbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JjYW5hZGlhbi5jb20vbW9iaWxlLWFwcGxpY2F0aW9uLWRldmVsb3Blci1pb3MtZGV2ZWxvcGVyLWpvYjQ4ODM4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Support, iOS Mobile Application Developer (Maintenance Engineer)",
      "company_name": "Bell Média",
      "location": "Canada",
      "via": "via Jobrapido.com",
      "description": "Job Req ID: 301754 At Quantrics, we consider our people our most important asset\n\nOur focus is not only on creating a great customer experience â   its about building and promoting a culture of constant team member growth, creating a sense of family, and working together to improve our lives and the lives of those in our local communities We do not just offer a stellar working environment; we also offer amazing benefits and very competitive compensation packages\n\nWe also make employee advancement and overall wellbeing a priority because we value our employees above all else. iOS Mobile Developer Support Be a developer and be a part of a versatile team with a focus on improving customer experience Specialize in sustaining Enterprise class and Commercial Grade Mobile apps on iOS Extensive experience in Performance Optimized & Object-Oriented Design (OOD), N-tier application architecture and the software development lifecycle with a focus on maintenance You will have an opportunity toâ ¦... Be part of a skilled development team that is responsible for sustaining our core mobile applications Responsible for resolving technical issues, including working with other teams to understand technologies and requirements, developing and implementing fixes, and identifying and driving code improvements.â   Utilize software development tools such as Xcode , TFS, Jira and Instruments to develop, test, debug, and deploy quality software Collaborate with other skilled developers through participation in peer code reviews, daily standups, pair programming and events Provide reliable solutions to a variety of problems using sound problem solving techniques including root cause analysis and outline corrective action for given problems Develop your testing skills though unit test development and by collaborating with the Quality Assurance team Build your know-how through knowledge transfers, tech talks, mentoring, and other learning opportunities Work with Enterprise and Application Architecture teams to drive alignment around more pragmatic vs\n\nprescriptive solutions Monitor and vet major architectural decisions, changes, and open issues (e.g\n\ndata placement, tool/technology product selection, interfaces, new data stores, infrastructure You will be a great fit on our team if youâ ¦ Have a Bachelor's degree in computer science or equivalent Are an Intermediate developer - Minimum 2+ years of relevant experience; Senior developer - Minimum 4+ years of relevant experience Enjoy the challenge of finding long lasting solutions to a variety of different code related problems Have e xperience with a variety of technologies, protocols, languages, techniques and design structures, including knowledge of iOS APIs, iOS layers, and Swift\n\nHave a strong understanding of the mobile software development lifecycle Have an u nderstanding of security techniques and web server structures Have a t horough understanding of development processes including agile development methodologies Have experience with human touch interface guidelines Have experience with Auto layout, Alamofire Have experience with XCTest for unit testing Have published at least one app in the app store Preferred skills and competenciesâ ¦ Communication and Negotiation skills Team player and ability to manage technical resources Strong Leadership and organizational abilities Excellent synthesis and analysis capacity Demonstrated ability to deliver complex, multi-platform solutions Agile delivery methodology experience Knowledge of web platforms and development using service oriented architecture\n\nKnowledge of security standards and best practices Additional Information: Position Type: Non Management Job Status: Regular - Full Time Position Level: Q18 Application Deadline: 03/31/2022 Quantrics is committed to fostering an inclusive, equitable, and accessible environment where all employees and customer feel valued, respected, and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live and serve, and where every team member has the opportunity to reach their full potential",
      "extensions": [
        "9 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "9 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTdXBwb3J0LCBpT1MgTW9iaWxlIEFwcGxpY2F0aW9uIERldmVsb3BlciAoTWFpbnRlbmFuY2UgRW5naW5lZXIpIiwiaHRpZG9jaWQiOiJjdndpejdpbGpCNEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFWQkZNa2RYUTNnek5DMVFXWFkwT0RKclIwUklia3RvVEhjeWNYSnZOa1JaWDB0SlRFdDNObkZRY1dkcVNtSlZjbWN6Y2xrNWFtNXJiMlpVTW1aa2VEZGZTV05HV2sxT09FOU5hek15VnpRME0zaHNhRXBXWTFoVk1VcFRTRzVrTmpKdWJWUlhXbXhqTTNSVFpsTlZOVGg0T0dNNVRrZGlaa3RSTlU1WFlXTk9jbTVUZVROSE5qQnpVM05pY1VoRFNFcEJZMDFIWjBwNVRUWmlWMGRKVjFsM0VoZE1ka1ptV1hWRVpVbHZSM0YzWW10UU1XWlhabTlCZHhvaVFVUnFWMTh6VEdaRVVVUkxZM2RUYm1KclJVZDFjVmxpUTBkRFJsbERSMmw2UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnJhcGlkby5jb20iLCJsaW5rIjoiaHR0cHM6Ly9jYS5qb2JyYXBpZG8uY29tL2pvYnByZXZpZXcvMTIwMTY4MjI4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile App Software Developer",
      "company_name": "Johnson Controls",
      "location": "Canada",
      "via": "via JobCanada24h.com",
      "description": "What you will do\n\nWith the cloud revolution set to explode; you’ll be part of a team located in Concord, ON, that will help to revolutionize traditional on-premise intrusion systems by lifting it into the cloud and extending how our end-users interact with it. We will be strategizing and embracing how we can use and adopt new emerging technologies from edge-devices (Direct-to-Cloud sensors using NB-iOT), scalable Cloud architecture, and interrelate these with Matter, AI and ML, to produce great value propositions to our end-users and customers.\n\nAs an experienced Mobile App Software Developer at Johnson Controls, you will work with key stakeholders, architects, developers as well as business and marketing leaders to execute from cradle-to-grave, our mobile app strategy and plans.\n\nHow you will do it\n\nThe Mobile App Software Developer will develop and maintain scalable mobile applications for iOS and android devices and work hand-in-hand with our Agile development teams, including... Product Owners/Scrum Masters along with other architectural full-stack solution leads. They will be responsible for mentoring, leading and providing hands on training for other Developers within the team. Reviewing product requirements, functional and design specifications to determine needed development planning and execution will be a part of day to day activities, as well as engaging with the development team to prototype, wireframe and white-board ideas. Engaging the broad technology roadmap and strategy reviews, continuously review with the broader development team the robustness of design and provide development estimates.\n\nReviewing product requirements, functional and design specifications to determine needed development planning and execution will be a part of day to day activities, as well as engaging with the development team to prototype, wireframe and white-board ideas. Engaging the broad technology roadmap and strategy reviews, continuously review with the broader development team the robustness of design and provide development estimates",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcST6teeqFk7Md-omeYX2euniJD0KftdV6iZ-YvPhfQ&s",
      "extensions": [
        "18 days ago",
        "Contractor"
      ],
      "detected_extensions": {
        "posted_at": "18 days ago",
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIFNvZnR3YXJlIERldmVsb3BlciIsImh0aWRvY2lkIjoiaHRtemxtLUNUSTRBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFEyaGhSek5LY1dsTVVYcGlRbUpvWmpNMU9FdFBRVmcxYWxCdFQzQm1YMXBxVVdKQlNqQTVkM1Z1YldsNlkydzFZbE5RTVdkSGNYVjZOVGxNWHpSSVluTXpRbkJZV0RSaVdpMUpZblExZUZKV1MyUTVNbmc1VnpaZmVEVXhTVkUzZG1ZdE9EVnhWSEZsTTJaTFpWTkhXbGw1WmpWdVpXZERaMEZYZFc5eGFXeFNZalpLY2pacFpXY3hZbTVQTTBsUldtMTNkVEIzUjFoT1NuaGFVRTFEWTNSWmJrSkRhRTFoUzNsNWVYRlhObHBqRWhkTWRrWm1XWFZFWlVsdlIzRjNZbXRRTVdaWFptOUJkeG9pUVVScVYxOHpTVWcwVXpWc1JGZHBkVUZWTWpkS1gwZFVTRVZMVEhGcVgyTmxadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iQ2FuYWRhMjRoLmNvbSIsImxpbmsiOiJodHRwczovL2pvYmNhbmFkYTI0aC5jb20vbW9iaWxlLWFwcC1zb2Z0d2FyZS1kZXZlbG9wZXItam9iNzYzODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Android Mobile Developer",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Experienced Persyaratan Umum 1. D3 atau Sarjana dari jurusan terkait Persyaratan Khusus 1. Berpengalaman di bidang Mobile Android min 1 tahun 2. Berpengalaman dengan Flutter 3. Berpengalaman dengan Native Java dan Native Kotlin 4. Memiliki pengetahun di UI UX Mobile Informasi Umum 1. Memiliki pengetahuan menggunakan alat pengembang aplikasi seluler 2. Mau belajar dan pekerja keras 3. Dapat bekerjasama dengan tim 4. Cepat belajar, baik dalam memecahkan masalah, kerja sama and kemampuan analisis 5. Bersedia di tempatkan onsite klient di Jakarta",
      "extensions": [
        "13 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "13 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIE1vYmlsZSBEZXZlbG9wZXIiLCJodGlkb2NpZCI6IkRoZ1BUMEZJd3V3QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVZCRk1rZFhRbTFqVUhWV1NUQnJiV3hQTW5oMmIwaHBXSGQ2UzJoTmJqbE5iVlZJYVVodlEyaEhhVWhHU0VWNlpFSjJiemRNVG1adlJUTlBkbDlJV0ZOT2NHaDBUME0yUjNoWGREUTVSRVZVWVhWR1drZFdVbkp6VmtaS1UyVlVYekJTWm5CRFoxcHZZM2hxT1dwTlFsVjZTVzVoVGs1MFoxOXpjV2hZV1VrMlEyNDRSMU53Y1VZM1RFODBVM05GVTFwQlJqbDBNRFJRWlZwd09FZExUMkkxT0hkZmF5MVJUSEp6TUVkMmRtNUZjRnB2YzAxekVoWk5aa1ptV1hVM1kwcEpNa2huWjJaNWVuSjZRVUYzR2lKQlJHcFhYek5LUjJGa2NVZzVlbFpUZG1kV2ExUmxOREpQVjNwd2VHMTZWRlJCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIEluZG9uZXNpYSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvLmlkL2pvYi9hbmRyb2lkLW1vYmlsZS1kZXZlbG9wZXItdGVsa29tLXVuaXZlcnNpdHktaW5kb25lc2lhLTQ3MDg0OTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "IOS Developer",
      "company_name": "Elabram Systems",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Key Responsibilities Design and build advanced applications for the iOS platform Collaborate with cross-functional teams to define, design, and ship new features Ensure the performance, quality, and responsiveness of applications Integrate mobile apps with RESTful web services Work on bug fixing and improving application performance Unit-test code for robustness, including edge cases, usability, and general reliability Publishing application on App Store Continuously discover, evaluate, and implement new technologies to maximize development efficiency Key Requirements: Degree in computer science or relevant field At least 1-2 years of working experience with proven projects Solid understanding of the full mobile development life cycle Knowledge of Apple's design principles and application interface guidelines Strong knowledge of iOS SDK, different versions of iOS, and how to deal with different screen s Experience with Swift, Alamofire, Pods Experience with offline storage, threading... and performance tuning Experience with BitBucket and git as a version control tool Experience with RESTful APIs to connect iOS applications to back-end services Experience with push notifications, APIs, and cloud messaging Experience with Agile and Scrum Project Management Familiarity with various testing tools Have published one or more iOS apps in the app store Knowledge of UI/UX standards Self-motivated to explore new technologies, applications and environments Fully comfortable working in English/Bahasa, both written and spoken Have a positive and can-do attitude You are a problem solver with good analytical skills",
      "extensions": [
        "16 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "16 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJoWF90QmpFT1FfQUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgSW5kb25lc2lhIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY28uaWQvYW1wL2pvYi9pb3MtZGV2ZWxvcGVyLWVsYWJyYW0tc3lzdGVtcy1pbmRvbmVzaWEtNTI2NTk2MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "iOS Developer",
      "company_name": "e27 media platform",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Job Responsibility: Responsible for Prelo iOS app. New features, bug fixes, and unit testing. Requirement: 1. Bachelor Degree in Computer Science/Information Technology or equivalent 2. Strong understanding of OOP 3. Experience on iOS App development, using Objective-C or Swift 4. Have a strong analytical thinking and ability to solve problem. Able to develop a simple solution for complex problem. 5. Understand how Git works 6. Have a strong analytical thinking and ability to solve problem. Able to develop a simple solution for complex problem 7. Fast-learner and able to work with a team. Quickly adapt to change",
      "extensions": [
        "1 month ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "1 month ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJZamhvajF5VER2a0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgSW5kb25lc2lhIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY28uaWQvam9iL2lvcy1kZXZlbG9wZXItZTI3LW1lZGlhLXBsYXRmb3JtLWluZG9uZXNpYS00ODcxMTk5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Senior / Mobile Developer (Android) - Global Fintech Startup",
      "company_name": "Crypto.com",
      "location": "Indonesia",
      "via": "via Linkedin",
      "description": "Crypto.com was founded in 2016, Crypto.com today serves over 10 million customers with the world’s fastest growing crypto app, along with the Crypto.com Visa Card — the world’s largest crypto card program — the Crypto.com Exchange and Crypto.com DeFi Wallet. Recently launched, Crypto.com NFT is the premier platform for collecting and trading NFTs, carefully curated from the worlds of art, design, entertainment and sports.\n\nCrypto.com is built on a solid foundation of security, privacy and compliance and is the first cryptocurrency company in the world to have ISO/IEC 27701:2019, ISO27001:2013 and PCI:DSS 3.2.1, Level 1 compliance, and independently assessed at Tier 4, the highest level for both NIST Cybersecurity and Privacy Frameworks. With over 3,000 people in offices across the Americas, Europe and Asia, Crypto.com is accelerating the world’s transition to cryptocurrency.\n\nFind out more: https://crypto.com\n\nCrypto.com is the #1 most downloaded app in the US Google Play Store (Nov... 2021)\n\nAbout the role:\n\nWe're looking for self-starting engineers with strong experience developing sophisticated applications. You will be Involved in end-to-end mobile application development life cycle.\n\nRequirements (Android):\n• Interested in building first-class product to solve real world problems\n• Experienced with various technologies, a fast learner and have a “get things done” mentality\n• Strong organisational skills and interpersonal skills and the ability to juggle conflicting requirements from many different stakeholders\n• Humble to embrace better ideas from others, eager to make things better, open to challenges and possibilities\n• Experience building complex applications for the Android using Kotlin/Java\n• Mobile application development at the user interface and system levels\n\nGood to have:\n• Experience and good understanding on Test-Driven-Development (TDD), implement instrumented unit tests\n• Experience with MVVM, Reactive Patterns using RxJava/RxAndroid and the multi-module architecture\n• Experience in building real time graph, displaying real time data etc.\n• Willing to learn\n\nBenefits\n• We offer an attractive compensation package working in a cutting-edge field of Fintech\n• Huge responsibilities from Day 1. Be the owner of your own learning curve. The possibilities are limitless and depend on you\n• You get to work in a very dynamic environment and be part of an international team\n• You will get to have involvement in developing a brand new product from scratch alongside with a talented team",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6w7xWDp27x9o6Dbt378aHGFo-Hw5nCyFoK497wB4&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBNb2JpbGUgRGV2ZWxvcGVyIChBbmRyb2lkKSAtIEdsb2JhbCBGaW50ZWNoIFN0YXJ0dXAiLCJodGlkb2NpZCI6Ijk2NU9TeG9ocGJRQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVZCRk1rZFhRVTB5U1VGR2FEQlFZVTU0VWt4MlRrVkpkMGhoTFRVNFdqbDNWVVF0TUZRNGFqVmFUbGxqU2pGaWR6bGxWa0ZpYTBaSE9VWjRNSE5UWTJSVWVYbHlka0ZTYVdSemJUTTRiVkY0YlRSaldYQkNZa05XTkdWS1NtNU9VRTlWWkZJMFh6RjNSRTR0YVdST2VWZDZheTFCVURRNVVEVllTM1JvY0RSSmNEWlpTRmhHVlcxVGEwOUJORFZ2VHpsVFJVY3hjMlo1YzNwMlEwRlZSRTFCRWhaTlprWm1XWFUzWTBwSk1raG5aMlo1ZW5KNlFVRjNHaUpCUkdwWFh6Tk1SbEZ5WXpONE5rRlBjMlJQWVVsZmFrRTVRemhQVDNoTFIzbEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZGluIiwibGluayI6Imh0dHBzOi8vaWQubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItbW9iaWxlLWRldmVsb3Blci1hbmRyb2lkLWdsb2JhbC1maW50ZWNoLXN0YXJ0dXAtYXQtY3J5cHRvLWNvbS0yODk5Nzc5NDYwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Analyst, Android Developer",
      "company_name": "DBS",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Business Function DBSI T&O is the backbone that supports the bank as the central of operations and technology. With the spirit of OneTeam and PRIDE! Value, we serve Institutional Banking Operations and Consumer Banking Operations, manage Customer Centre and IT, provide Group Procurement and Corporate Real Estate, coordinate bank-wide Business Continuity Management program and framework, and deliver service quality for Digibank and IBG/GTS. Our Technology & Operations organization is a vital strategic partner to the business in providing competitive advantage that propels DBSI towards being the Best Bank for a Better World (#B3W). Requirements A graduate in computers or Engineering from a reputed university. Experience in proven software development experience. Solid understanding of the full mobile development life cycle. Proven working experience in Android development Experience with Android SDK Experience working with remote data via REST and JSON Experience with third-party... libraries and APIs Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies Experience with Java IDEs (e.g. Android Studio, Eclipse), profilers, debuggers, revision control systems (e.g. GIT) and bug tracking (e.g. Jira) Hands on working knowledge on DevOps such as Bitbucket, Continuous Integration (Jenkins, Maven), Continuous Deployment (Bamboo). Should have the ability to configure a continuous integration/deployment working environment and Gradle . Experience of integrating with Kony Middleware (Mobile fabric) is required but not mandatory Experience in working with Financial / Banking applications. Accountable for the production of high quality code on a personal level adhering to all software engineer quality standards / benchmark. End to end software development life cycle. Agile software development techniques. Test driven development and knowledge testing automation / Unit testing. Knowledge of Object oriented programming and Design concepts. Knowledge in MVVM design patterns. Experience in Android studio, Android SDK, Java. Knowledge in Web service REST / SOAP. Experience in Gradle build system. Introduction to Android debug tools such as DDMS, ADB, TraceView, Hierarchy viewer etc. Introduction Android UI design patterns and best practices. Responsibilities Translate designs and wire frames into high quality code Maintain high performance, reusable, and reliable code Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks and fix bugs Help maintain code quality, organization, and automation",
      "extensions": [
        "15 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "15 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0LCBBbmRyb2lkIERldmVsb3BlciIsImh0aWRvY2lkIjoiaTZ3SnRvdE5aV2NBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVkJGTWtkWFFYWkZObFJxYVd0aU5tRXhTbkV5TWtZeFpUaFliMDQxWkZBd1FtTm1ZelphWlVRNGNVUkxUaTFZTURscmVqaEVjR0ppVVVKTFZtd3RXRWxzZVRSaVExaFhiR05JTXkxRFJIbHpkWHBhTWtSR01FMXZaRGxDVHpsRmVIRTBSekJyYVhWeFNtZElTemRFYUdNeFIwWjZaUzFOZFhFdGRrTmxWR0ZGYmxkcmEyZExOV1pRYzBvU0ZrMW1SbVpaZFRkalNra3lTR2RuWm5sNmNucEJRWGNhSWtGRWFsZGZNMGsyYTFSSGFFUnlObU5wVDFkNVlYUnJWRU5FTm5CMVYwbHJOSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgSW5kb25lc2lhIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY28uaWQvYW1wL2pvYi9hbmFseXN0LWFuZHJvaWQtZGV2ZWxvcGVyLWRicy1pbmRvbmVzaWEtNTgwMzAzMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "App Developer",
      "company_name": "Venation.io",
      "location": "Indonesia",
      "via": "via Linkedin",
      "description": "Job Description:\n- Developing software solutions to meet customer needs\n- Creating and implementing the source code of new applications\n- Testing source code and debugging code according to product requirements\n- Evaluating existing applications and performing updates, maintenance, and modifications\n- Developing technical handbooks to represent the design and code of new application\n\nJob Requirement:\n- Bachelor degree in computer science, computer engineering, programming or related field may preferred\n- Those with certificate in related field are encourage to apply\n- 0 - 2 years of experience for entry-level position\n- Proven experience creating application or software\n- Up-to-date knowledge of different programming languages such as Java, Javascript, Python, React.Js)\n- Desire to work collaboratively to ensure effective execution of project deadlines\n- Detail-oriented and problem solving skill\n\nPlease send your latest CV & Portfolio to\nEmail: dira@venation.io\nSubject... AppDeveloper_Your Name\n\nThank You",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSmb2G7rVQGV3UienS5YVaUUHI8Pj6WVwMdUXM8qww&s",
      "extensions": [
        "21 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "21 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBcHAgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJaZVJKSmZlaWdsMEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZGluIiwibGluayI6Imh0dHBzOi8vaWQubGlua2VkaW4uY29tL2pvYnMvdmlldy9hcHAtZGV2ZWxvcGVyLWF0LXZlbmF0aW9uLWlvLTI5OTA3Mjc3MjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Developer",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal S1 Level Pekerjaan Fresh Graduate Persyaratan Umum Candidate must possess at least Bachelor's Degree in Engineering (Computer/Telecommunication), Computer Science/Information Technology or equivalent At least 1 Year(s) of working experience in the related field is required for this position Have experience developing android/mobile applications with teams or individuals. Required Skill(s) Java Android Fullstack, Rest API, IOS. Having good knowledge about Mobile Development (Android). ASAP to Join Placement in Jakarta Pusat (Karet Sudirman) Persyaratan Khusus Candidate must possess at least Bachelor's Degree in Engineering (Computer/Telecommunication), Computer Science/Information Technology or equivalent At least 1 Year(s) of working experience in the related field is required for this position Have experience developing android/mobile applications with teams or individuals. Required Skill(s) Java Android Fullstack, Rest API, IOS. Having good knowledge about... Mobile Development (Android). ASAP to Join Placement in Jakarta Pusat (Karet Sudirman) Informasi Umum Job Description : Build and Develop an internal mobile application",
      "extensions": [
        "8 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "8 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJlczBrZWxCdnFHUUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUXpOZlMxcDBXR0puV0RWS2VtSkViRk13UTBVNWNGcElZMHM0UkRoM1RqRnJUa3RKTTFvMWNYbFdaMUZIVUdRM1FsUndPVWh2TTA1VWNqWjNNa2hFTjE5MFVUaHRZMVZsY25scmFWRldaRVZFYkRoek9VMUdNRUZ6UzFoMFpWOVJlbmhXWTBwWWVtcHdUMDQ0TmpGeU1HTkJkRnAxWkhoNFJsSmtOR2xVUkVJeE5HUXRSWGx6YmxkVFNGTkJYM2s1V0hsZmEwTXpUa28zVDFVMGFXMXllRmRPWkRGb2N6ZFpkMmRRVVdweWJrODRFaFpOWmtabVdYVTNZMHBKTWtobloyWjVlbko2UVVGM0dpSkJSR3BYWHpOS1QzUlVNbTFoUW5oTVQxVkZjbUYyVDI1R2NreHdUbFJRWmtSbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvbW9iaWxlLWRldmVsb3Blci10ZWxrb20tdW5pdmVyc2l0eS1pbmRvbmVzaWEtNTg2NTI5Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Senior / Mobile Developer (iOS) - Global Fintech Startup",
      "company_name": "Crypto.com",
      "location": "Indonesia",
      "via": "via Linkedin",
      "description": "Crypto.com was founded in 2016, Crypto.com today serves over 10 million customers with the world’s fastest growing crypto app, along with the Crypto.com Visa Card — the world’s largest crypto card program — the Crypto.com Exchange and Crypto.com DeFi Wallet. Recently launched, Crypto.com NFT is the premier platform for collecting and trading NFTs, carefully curated from the worlds of art, design, entertainment and sports.Crypto.com is built on a solid foundation of security, privacy and compliance and is the first cryptocurrency company in the world to have ISO/IEC 27701:2019, CCSS Level 3, ISO27001:2013 and PCI:DSS 3.2.1, Level 1 compliance, and independently assessed at Tier 4, the highest level for both NIST Cybersecurity and Privacy Frameworks.With over 2,600 people in offices across the Americas, Europe and Asia, Crypto.com is accelerating the world’s transition to cryptocurrency. Find out more: https://crypto.com\n\nCrypto.com is the #1 most downloaded app in the US Google Play... Store (Nov 2021)\n\nFor more information, please visit www.crypto.com.\n\nRequirements\n\nWe're looking for self-starting engineers with strong experience developing sophisticated applications. You will be involved in end-to-end mobile application development life cycle.\n\nResponsibilities (iOS):\n• Work closely with product team and play an active role in providing feedbacks, to help shape our features\n• Passionate about software engineering and love to build mobile apps and systems\n• Care about code quality, robustness and end user experience\n• Mastery in Swift or Objective C\n• Familiar with ReactiveX (a plus)\n• Built projects you are proud of (big plus if they are side projects)\n\nBenefits\n• We offer an attractive compensation package working in a cutting-edge field of Fintech.\n• Flat team. Work side by side with the co-founding team\n• Huge responsibilities from Day 1. Be the owner of your own learning curve. The possibilities are limitless and depend on you\n• You get to work in a very dynamic environment and be part of an international team\n• You will get to have involvement in developing a brand new product from scratch alongside with a talented team",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6w7xWDp27x9o6Dbt378aHGFo-Hw5nCyFoK497wB4&s",
      "extensions": [
        "6 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBNb2JpbGUgRGV2ZWxvcGVyIChpT1MpIC0gR2xvYmFsIEZpbnRlY2ggU3RhcnR1cCIsImh0aWRvY2lkIjoiSlFsZ3I4N0xRMXNBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVkJGTWtkWFExVlNkME5pVjBKa05IRnRTblpoTkRVMVQzSkVORXcwV200eFQycDNURmN4ZUZSbFZWbEpXbWxpTVhGV1lVSmxZVmhTZUROM09GOWFhMk15TFhZdFoyaERTR2gyVUVkT1FsTm9kWEV3WkdKSFJraFJlVFZTTjNweGFFRlBSazVmVld4aVkwUk1UVXczYTJwNFpEaDZRMVJHVDJGR2JUQTVZbEpUYkRsUVRGb3dVRzVtTTBWamVsTTRlRGQwVW5acFVIRnJOSGxGVEVsc1ZucEJFaFpOWmtabVdYVTNZMHBKTWtobloyWjVlbko2UVVGM0dpSkJSR3BYWHpOSmFHdFRiRTgyVkhWR2JVeFJjalJtYVZsblptbGtjbXM1VURKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkaW4iLCJsaW5rIjoiaHR0cHM6Ly9pZC5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1tb2JpbGUtZGV2ZWxvcGVyLWlvcy1nbG9iYWwtZmludGVjaC1zdGFydHVwLWF0LWNyeXB0by1jb20tMjY4MDYyNjQ2Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "App Engineer (Android)",
      "company_name": "Elabram Systems",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Key Responsibilities Build large-scale and high-performance services to develop simple, easy-to-use products for our unique end customers. Design and develop a highly maintainable and reliable Android app. Write clean and tested code, mostly in Kotlin for Android native environment. Coordinate with other teams (Product Management, UX/Design, Backend Engineering, and Quality Engineering teams) on building and managing the Android app. Implement tech excellence in the Android development environment. Help in a constant exploration of new technology and tools. Deliver solutions that bring a positive impact to low-income communities through up-to-date software technologies. Key Requirements: 4+ years of working experience in software engineering. Strong knowledge of Kotlin, Android tools and framework, and Android Studio. Good skill in unit tests. Plus points for UI tests. Experience in using app vitals and performance monitoring systems. Experience building an end-to-end system... preferably for a large user base. Strong attention to detail, particularly on software engineering fundamentals, testing methodologies, and quality. Familiarity with Android design patterns",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBcHAgRW5naW5lZXIgKEFuZHJvaWQpIiwiaHRpZG9jaWQiOiJEcTFYVmNRbHdpOEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgSW5kb25lc2lhIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY28uaWQvam9iL2FwcC1lbmdpbmVlci1hbmRyb2lkLWVsYWJyYW0tc3lzdGVtcy1pbmRvbmVzaWEtNTEwMDM1Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Developer",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum . Minimum D3 from Technical Information/ System Information/Electromagnetics/Mathematics . GPA min 2.8 Fresh Graduate Persyaratan Khusus . Junior Mobile Developer: Having 1- 2 years experiences in mobil . Hands-on experience in the full lifecycle of Hybrid mobile application development including publishing one or more apps to the play store & app store . Excellent technical knowledge on HTML5, CSS3, JavaScript, XML/JSON, Cordova or Ionic or Angular JS or React Native or Xamarin . Strong knowledge in RESTful web services . Experience with Agile or Waterfall methodologies Informasi Umum . Fast learner . Can work without being supervised . Can work in team . Can work within deadline",
      "extensions": [
        "20 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "20 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJYbk5YNlYzN0dNd0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUW5welMzSjBURzFFTjA1RGJrTk9hVUpQVkd0MVJIUjFZVkZUWWtkc1YyOVdNRTV1TUdoWUxXaFRNMk42V2psR2JuVnlZVVJMUlV0S2RreDNNelJOVmxGVWIwaE1UV3N0ZWxjNWVVZG5ZVEYxZDFGWFZGWnFXbTFXWVZOcVRVVlZOM2x2TlZoMVNta3hiRWhXUVd0UWQzVmFRVzU0YjJ4VmJtMUZNa2t4UkZSSFoyVldPRUpEVXpkUGR5MHpVRlp5UlZSMloxSmxaM0ZtVEdaYVJVOXNSVVpvVFVkWk1rZDJOMFptWm1VNFUyOXJFaFpOWmtabVdYVTNZMHBKTWtobloyWjVlbko2UVVGM0dpSkJSR3BYWHpOTWNsUjNibG8xV2xoVWRUZFRNMTgyZEZSTFkwZEdTRVpUTm5WUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvbW9iaWxlLWRldmVsb3Blci10ZWxrb20tdW5pdmVyc2l0eS1pbmRvbmVzaWEtNDM2OTYxNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Developer Senior",
      "company_name": "J-Express",
      "location": "Indonesia",
      "via": "via JobGnu Di Indonesia",
      "description": "Design, develop, deliver, and maintain mobile apps project with medium or high complexity features.\n\nDesign, develop and maintain secure, clean, clear, scalable, and well-documented code base with minimal guidance.\n\nTranslate designs and user requirements into high quality code.\n\nImplement internal and external API for your mobile apps\n\nDesign and develop database and mobile API.\n\nIdentify and correct bottlenecks, errors or bugs.\n\nTake responsibility for the entire life cycle of your project: development, test, production, and improvements.\nAbout The Role\n\nIf you are an experienced mobile developer that has some qualification that we need, be prepared to join our teams to develop many apps that can help and support each department in our Company. We need an engineer that has a big experience in mobile apps development to enlarge our system for internal and external users. Having good knowledge in designing whole mobile apps development is a must. Your main objective will be to employ... codes, programs, and features, as well as improve upon software design and documentation to ensure our users have good experience using our apps. And last but not least we are also looking for an engineer that can improve code quality across multiple application components by reviewing each other’s code, sharing knowledge, and helping out within and across teams.\n\nMinimum Bachelor’s Degree majoring in Information Technology, Computer Science, Software Engineering, or any major related to IT.\n\nMinimum of 5 years of professional experience in mobile development Android or iOS (having experience in both iOS and Android is a plus) with a solid understanding of the full mobile apps development life cycle.\n\nExperience in E-Commerce or Logistics Application development is a very big plus.\n\nExcellent command in at least one programming language and framework (i.e. Java or Kotlin for Android and or swift for iOS).\n\nExperience with submitting App to store (AppStore/PlayStore) and have minimum 2 apps that already submit in the store.\n\nExperience with Google API (Maps, Firebase Cloud Messaging, Google SSO, etc).\n\nHaving good knowledge in iOS or Android security, data management, synchronization data/file.\n\nGood knowledge in Mobile Apps API (REST) and have experience in mobile API deployment.\n\nProficient in Object Oriented Programming, Design Patterns (such as MVP & MVVM).\n\nHaving any Native Framework (preferable), CI/CD and build automation experience is a plus.\n\nFluent in both written and spoken English (Mandarin is a plus).\n\nKeep up to date with the new Mobile Apps (Android/iOS) technology.\n\nMust have supportive and highly collaborative attitude to work effectively with cross-functional teams",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIFNlbmlvciIsImh0aWRvY2lkIjoidmFYS2NoZjFmZzhBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JHbnUgRGkgSW5kb25lc2lhIiwibGluayI6Imh0dHBzOi8vaW5kb25lc2lhLmpvYmdudS5jb20vam9icy8zMDcwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Full Stack App Developer (Android)",
      "company_name": "Axross",
      "location": "Indonesia (+2 others)",
      "via": "via AngelList",
      "description": "Who are we?\n\nWe are an MIT and venture-backed technology start-up with the ambition to digitise\n\n“warungs” by radically changing the approach to modern trade solutions such as point-of-sale,\n\ninventory management and e-payments. We are developing an innovative mobile app to\n\ndeploy these solutions, while gathering valuable general trade data for FMCG brands.\n\nHow can you contribute?\n\n● Support our lead engineer in the implementation of key mobile app features (e.g.,\n\npayment integration, analytics-driven notifications, gamification), app performance\n\nimprovements and troubleshooting / bug resolution (write clean, easy-to-follow code!)\n\n● Continuously improve new app features to help “warung” owners get more value from\n\ntheir business and daily routines (e.g., shopping list generation)\n\n● Contribute to our overall mobile app roadmap - we welcome new and exciting ideas!\n\nWhat are we looking for?\n\n● Based in Southeast Asia\n\n● Fluent in English and communicates effectively. Bahasa... Indonesia is optional.\n\n● Proven track record in Android app design, implementation and deployment\n\n● Strong knowledge of Android SDK and React Native\n\n● Experience with API implementation (e.g., RESTful, GraphQL), front-end (e.g., offline\n\nstorage, performance tuning) and back-end development (e.g., AWS)\n\n● Experience with relational databases (e.g. PostgreSQL); able to write efficient queries\n\n● Able to set up continuous integration (CI) and continuous delivery (CD) DevOps\n\n● Good understanding of the various software development approaches\n\nExample of valuable experiences for this role:\n\n● Experience working on mobile app development in a high-paced and dynamic\n\nprofessional environment (e.g., tech start-up, leading tech company)\n\nApply now!\n\nIf this sounds exciting to you, please send your CV to admin@axross.co\n\nLearn more about us at: www.axross.co\n\nAxross focuses on Enterprise Software. Their company has offices in Indonesia. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://www.axross.co",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIFN0YWNrIEFwcCBEZXZlbG9wZXIgKEFuZHJvaWQpIiwiaHRpZG9jaWQiOiJsSkJFT183VHg3RUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFuZ2VsTGlzdCIsImxpbmsiOiJodHRwczovL2FuZ2VsLmNvL2NvbXBhbnkvYXhyb3NzL2pvYnMvMTg2ODM1Ni1mdWxsLXN0YWNrLWFwcC1kZXZlbG9wZXItYW5kcm9pZD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Android Mobile Developer",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum - D3/S1 Lulusan Teknik Informatika/Sistem Informasi, terbuka untuk Freshgraduate - Pengalaman dalam mengerjakan Project khususnya di bagian Aplikasi Mobile minimal 1 tahun - Dapat bekerjasama dalam tim dengan sikap positif - Memiliki komunikasi yang baik - Penempatan kerja : Bandung Persyaratan Khusus - Memahami dan menguasai Tools seperti Android Studio, Eclipse dan tools lainnya. Bahasa pemrograman yang digunakan Java, Kotlin, XML, React Native. - Menguasai REST, JSON, dan GIT - Memperhatikan tampilan desain UI/UX Aplikasi Informasi Umum Kirim CV dan Lamaran lengkap ke : Subjek : [Nama-Posisi yang dilamar] Kindly ignore the deadline, please apply as soon as possible",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIE1vYmlsZSBEZXZlbG9wZXIiLCJodGlkb2NpZCI6IjdyWEFMcFdUdmZ3QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVZCRk1rZFhRVkpYY0MxQ2EzRnZSVkF6UW0xMFF6QldRVnA1YVhsNFRWOUhTVk5FTkhSbVVqWnFOWFJCVm1FMlV6TnVlRll5TVZod1J6WXdTSGRhUjJvd1QxQnFNRzUxWlZCemRVeE1RbHB6ZUZkYVRHRXdNbVJHY1cweWJGZ3RabVF6TUMxMldHb3pVMU4zY1U5UVpFMDRObTFPZUVKbWJYaEZNVzVyVVhOMlltRmtaRGhLY1RkbWIyODFWMXBUVDI1YVNtRndURnBpUlhsaVpHSnJXRUZOTTBkT2JHeDBOMXB5U3kxdVgwaEZkRmRvZDNoSkVoWk5YMFptV1hWMVowdzRNbXRmVVdGRWQySjZaMEYzR2lKQlJHcFhYek5NYzB0VmQxVkNNR1EzT1hkME1FMVNjVUZzWVVGU2JsTkRlVEIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIEluZG9uZXNpYSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvLmlkL2FtcC9qb2IvYW5kcm9pZC1tb2JpbGUtZGV2ZWxvcGVyLXRlbGtvbS11bml2ZXJzaXR5LWluZG9uZXNpYS01NTEzNDA1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile Developer",
      "company_name": "Jubelio",
      "location": "Indonesia",
      "via": "via JobGnu Di Indonesia",
      "description": "Design & implement new app modules based on the product requirements using Flutter framework\n\nBuild reusable code and libraries for future use\n\nParticipate in software architecture, design discussions and code reviews\n\nConsults with and advises leadership on modern application development principles, suggesting improvements along the way.\n\nOptimize application for maximum speed and scalability\nMin 2-3 years experience as Mobile Developer (Android/iOS).\n\nOver two year's developing Flutter applications for mobile\n\nPortfolio or samples of past work and projects\n\nExperience in TDD (Test-Driven Development)\n\nUnderstanding of the Agile development life-cycle\n\nKeeps up to date with mobile application development trends\n\nFamiliar with Git or other cloud development versioning tools\n\nExperience with automated testing and building\n\nFamiliar with RESTful APIs & other Microservices (payment gateway, delivery services, etc)\n\nExperience in Building POS (Point of Sales) Application is a plus",
      "extensions": [
        "Full–time"
      ],
      "detected_extensions": {
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJmM3RSTFc3cTdHOEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYkdudSBEaSBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly9pbmRvbmVzaWEuam9iZ251LmNvbS9qb2JzLzQzMDc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "IT PROGRAMMER MOBILE APPS",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum Kualifikasi: Lebih disukai dengan latar belakang pendidikan Sistem Informasi/Teknik Informatika/Menajemen Informasi Fresh Graduate dipersilakan melamar Umur maksimal 30 tahun Menguasai Java Menguasai Kotlin/Android Native/Android Studio Mengerti databse Memahami API Memahami PHP Persyaratan Khusus Kualifikasi: Lebih disukai dengan latar belakang pendidikan Sistem Informasi/Teknik Informatika/Menajemen Informasi Fresh Graduate dipersilakan melamar Umur maksimal 30 tahun Menguasai Java Menguasai Kotlin/Android Native/Android Studio Mengerti databse Memahami API Memahami PHP Informasi Umum JOB DESCRIPTION: Membuat apps yg dapat di akses di android",
      "extensions": [
        "20 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "20 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQUk9HUkFNTUVSIE1PQklMRSBBUFBTIiwiaHRpZG9jaWQiOiJHWW9pWnlqaHF2Z0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUXpKZlUxRnNVemxZYkRkeVREUnNkekpaZWtScmRHYzNZa05uZVZveWVFZHNkMDFhZDBseloyVlFSMVJRZVVOT2NEWjZZVkp3Y25WdGVtMHljemd4WkMwMWRYaEVOemh3WjBwT2RpMXZPSGhEWmsxT1luUTBUMFpWTTA1NGVtRlRaVGg2Ym1aMVgyTm9OR2RUYjJ4WVluRnNSVEJZVUdkQ1luWnVObGRWYXpjNE5EQlVSekUzUVd4a2JrdGtaMFpYU1RSYUxVSmxjakkzTW1ZNWRVYzNUbmRsTkRobGJXNUxURXBGUmtSTGEwTlZFaFpOWDBabVdYVjFaMHc0TW10ZlVXRkVkMko2WjBGM0dpSkJSR3BYWHpOTFYyVXhja2xuU0ZwWVZqZ3hObnBMVUcweGNrSk1PWGh3VVVOMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvaXQtcHJvZ3JhbW1lci1tb2JpbGUtYXBwcy10ZWxrb20tdW5pdmVyc2l0eS1pbmRvbmVzaWEtNDM3MDEyND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "MOBILE DEVELOPER",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum 1. usia maksimal 35 tahun 2. pekerja keras dan senang dengan tantangan baru 3. mampu bekerja sama maupun individu 4. mampu bekerja dalam deadline yang ketat 5. freshgrade are welcome 6. memiliki kemampuan analisis dan programming yang kuat Persyaratan Khusus 1. Mahir dalam menggunakan FRAMEWOKR FLUTTER 2. Memahami bahasa pemograman Dart (Kotin/Java atau Objective-C/Swift menjadi nilai tambahan) 3. Memahani konsep Object Oriented Programming 4. Memiliki pengalamana membuat API 5. Memahami full mobile development life cycle Informasi Umum PT. Pendidikan Ganesha Operation adalah salah satu perusahaan yang bergerak dalam bidang jasa pendidikan Bimbingan Belajar yang terbaik dan terbesar se Indonesia. Kami yang terus mengikuti kebutuhan pembelajaran anak Indonesia membutuhkan kamu para lulusan terbaik untuk bergabung besama kami mewujudkan cita-cita anak bangsa.",
      "extensions": [
        "20 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "20 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNT0JJTEUgREVWRUxPUEVSIiwiaHRpZG9jaWQiOiJPWllVSkw4TDZuSUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUWpoV2NYWkdRMjVpZEZCR05qTklUME5QUkVOelkweGxhbE5EV0djMlpYUmpZM2hIVFd4aVkySjNTVWh1VWpWR2JUUnJiMnM0Vmt4blR6aFBTVnBqZGxObGIxUjRTV05QT1d0dGFIWlhkUzFRUW5GclVFdGtUMmhZUldFd1UyRllXV0ZCT0cxelNVOXVZVXhGZERoSVkzUkdiVVZMYUdGTVpDMWFVblozY2w4M00xcHpjRVpmT1ZkTlNWSm1ZbEZHU0RSNE1sOXZWRkowTTJFMFoyTlRYMVpST1hGNk5WWjJTMVZoV1ROVlNVNUJFaFpOWDBabVdYVjFaMHc0TW10ZlVXRkVkMko2WjBGM0dpSkJSR3BYWHpOSkxVSkNTbEJ2VjB4TWFWTnlaRWhWTkhSNlZ5MDBXalp6VkU1UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvbW9iaWxlLWRldmVsb3Blci10ZWxrb20tdW5pdmVyc2l0eS1pbmRvbmVzaWEtNDM2OTkxMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "MOBILE DEVELOPER",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum Kualifikasi : Usia maksimal 31 tahun Kemampuan membuat aplikasi mobile (iOS dan Android) Berpengalaman dalam Dart Programming Mengusai Flutter Framework dalam Mobile development Mengusai UI/UX designer with Adobe XD Mengerti Mobile Apps Design Principles and Interface Guidelines Mengerti Mobile Development Life Cycle Persyaratan Khusus Bisa bekerja dengan REST API,FCM, GCP Menguasai OOP Design Principles Menguasai Java/ Kotlin, Flutter or Swift Informasi Umum JOBDES : 1. Membuat aplikasi handphone untuk perusahaan (iOS & Android) 2. Melakukan monitoring bugs dan update aplikasi 3. Membuat dokumentasi aplikasi dan panduan penggunaan 4. Membuat laporaan kegiatan setiap bulan 5. Melakukan training untuk penggunaan database etos (WEBBASE) 7. Membantu SH IT dalam menyiapkan laporan bulanan. 8. Membantu dalam membuatkan akses masuk ID card maupun finger print 9. Membantu HRGA dalam mencetak absensi dari mesin... absen yang tersedia",
      "extensions": [
        "20 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "20 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNT0JJTEUgREVWRUxPUEVSIiwiaHRpZG9jaWQiOiJabC1WVXVZdFpjc0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUTJGMFlTMHlOMVJ1U1hKNFltRlNlRzh6WlRaamQwUTJPRmR2VG1rM01rdHRXVmMzZG05cGRIUnhiRUpOWVhCb0xWbHBNMmhQYVVWTmJrSlRUa1o1UmpCcGIwdEVZMGhPT1VwRGEyOXFWVlU0TWtOSVZVMXBZV051VWtSVFFtMXlVRzQxVWxKU2RuQlZZMWRFTFRWaVJsTnZRV3RrTW5GRFUwNUViSFl5U0hRdExUQm9UR2xtWTBWMVFucFpNbTFMYzB0TFgwZFFaRnBqUlc5WU1YTm1kR2g1TmpCd1RucGxORFpoWjE5WWRua3dFaFpOWDBabVdYVjFaMHc0TW10ZlVXRkVkMko2WjBGM0dpSkJSR3BYWHpOS2MyZEZSM3B1U1U5UVREQTFObGg0Vm10WllWWmFSRFZyWlRKQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvbW9iaWxlLWRldmVsb3Blci10ZWxrb20tdW5pdmVyc2l0eS1pbmRvbmVzaWEtNDM3MDE0Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Engineer (Android)",
      "company_name": "Telkom University",
      "location": "Indonesia",
      "via": "via Monster Indonesia",
      "description": "Jenjang Pendidikan Minimal D3 Level Pekerjaan Fresh Graduate Persyaratan Umum -Diploma or Bachelor Degree in Computer Science, Technology, IT, or any related major -2+ years of Android software development experience (please note Google play apps for examples) -Experience in using Android Java or Kotlin -Familiar with Android SDK, Flutter -Experience with MVVM, Reactive Patterns using RxJava/RxAndroid and the multi-module architecture -Passionate in code up highly innovative, consumer-facing mobile applications for Android platform -Experience with both OOP and functional programming principles -Strong understanding of Java, React Native, Javascript -Strong understanding about REST and/or SOAP Web Services -Experience in Firebase Integration -Experience developing hybrid apps -Experience working with a version control system such as Subversion or Git -Experience working with Continuous Integration System such as Jenkins -Experience in Unit Testing and Test-Driven Development... -Experience with one or more general-purpose programming languages such as Java & PHP Persyaratan Khusus none Informasi Umum none",
      "extensions": [
        "13 days ago",
        "Full–time"
      ],
      "detected_extensions": {
        "posted_at": "13 days ago",
        "schedule_type": "Full–time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIgKEFuZHJvaWQpIiwiaHRpZG9jaWQiOiJIOUhYN3EtMmN6RUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFWQkZNa2RYUVRjdFl6Tm5YMFpIT1RNNE1XTnBZbkpJY3pKRmFGSmpURVJaTkVWVlMyWXhRbEJ5YmxWclZIcHBPWFJFZG1KTlZWVnJjM0owWDFKWVZYWkhURzlzVFVsMlFVVjFSRGx3U1RsYVRYWmxiRWh0VXkxclpsZEpTM1YwWmtaV2VVOUpVVlZGUW1GblZVWlhlV3RGYVdoV1RqaG5ZVkkzVEMwdE1HMW1TVlJTWmtablNtZEhkbEoxTTNRMVgybExkRTVJYjBjME9UQjBUbFJNWmxSdFZVOW9VRWRJUVdSMFlYZ3RZMXBPZEVOUGVHcHJFaFpOWDBabVdYVjFaMHc0TW10ZlVXRkVkMko2WjBGM0dpSkJSR3BYWHpOTFIweDJaRWhuWVc1c1duWllTbkl5WWxWNWFuVlNVbk5wWkMxbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBJbmRvbmVzaWEiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jby5pZC9qb2IvbW9iaWxlLWVuZ2luZWVyLWFuZHJvaWQtdGVsa29tLXVuaXZlcnNpdHktaW5kb25lc2lhLTQ3MDg1MDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Lead Android Developer",
      "company_name": "First Republic Bank",
      "location": "New York, NY",
      "via": "via The Muse",
      "description": "Overview\n\nAt First Republic, we care about our people. Founded in 1985, we offer extraordinary client service in private banking, private business banking and private wealth management. We believe that personal connections are everything and our success is driven by the relationships we form with our colleagues and clients. You'll always feel empowered and valued at First Republic...\n\nIncredible teams doing exceptional work, every day\nIn Technology, we support First Republic's employees and clients through the acquisition, integration and management of the Bank's information technology systems and services. We drive innovation and explore emerging technologies so our people can be productive and focus on what matters most - providing extraordinary service.\n\nDuties and Responsibilities\n\nUnder the general direction of the Head of Digital Technologies, the Android Engineer role teams up with Front end Developers to create, build and execute efficient apps.\n\nLine of Business-Specific Requirements: Candidates for this role should have experience working within a bank or investments/wealth organization and display an understanding and appreciation for the complexities therein. Experience with digital platforms, distributed systems, and Cloud technologies is also critical.\n\nCandidates for this role are responsible for the delivery of high-quality applications and provide support within brief time periods for the Bank. Driving framework and methodologies to support consistency is critical for this role. Attention to detail and an ability to convey relevant information at summary and detailed levels is a key factor to success in this role. Requires experience in both waterfall and agile methodologies.\n\nWhat you'll do as a Mobile Lead Android Developer:\n- Create top-notch mobile apps that are fast and stable.\n- Code and ship complex new mobile features and apps.\n- Establish and maintain strong partnerships with the business and product owners.\n- Work with owners and system leads, including Vendor Solutions, to logically design and negotiate solutions and participate in long-term product planning.\n- Ensure commitments are met while providing high-quality and cost-effective systems that meet client expectations.\n- Adapt digital Agile approach and work with mobile vendor to implement the mobile solution.\n- Keep up to date on new technology, standards, protocols, and tools in areas relevant to the rapidly changing digital environment.\n- Work with the application support team and external vendors to ensure all applications are supported according to their Service Level Agreements.\n- Troubleshoot and fix issues in production and non-production environments.\n- Work with server engineers to design API specs.\n- Propose and implement process improvements to make our engineering team even better\n- Work with product architects and engineers to follow in translating requirements to solution options and recommendations.\n- Oversee the backlog of requirements as it goes through the Design phase of the SDLC.\n- Drive solution designs inclusive of clear annotations on key components and flows, considerations and options, recommendations, and justifications\n\nQualifications\n\nYou could be a great fit if you have:\n- Bachelor's degree (or equivalent) in Computer Science or related field\n- 5+ years of experience with strong app development skills and relevant practice in a technology environment\n- Experience in native mobile app development on Android; and hands-on experience in Kotlin, Java RX and/or React native code to build front-end web or native application experiences\n- Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes\n- Familiarity with RESTful APIs to connect Android applications to back-end services\n- Strong knowledge of Android UI design principles, patterns, and best practices\n- Ability to understand business requirements and translate them into technical requirements\n- Familiarity with cloud message APIs and push notifications\n- A knack for benchmarking and optimization\n- Understanding of Google's Android design principles and interface guidelines\n- Proficient understanding of code versioning tools, such as Git\n- Familiarity with continuous integration\n- Experience with offline storage, threading, and performance tuning\n- Experience in test-driven development and test automation\n- Attention to detail to carefully craft both tests and code\n- Experience working with the Agile/scrum project management methodologies\n- Backend web service and API knowledge\n- Excellent problem-solving and organizational skills and an ability to multi-task in a deadline- oriented environment\n- A willingness to learn new technology\n- Management skills related to coaching Junior Developers\n- Experience executing on enterprise-level projects\n- You are excellent in reading code to be able to analyze quickly\n- Superior communication skills\n- Proven leadership, relationship management, problem solving, and conflict resolution skills\n- Strong People leadership skills\n- Excellent written and oral communication skills\n- Ability to influence without authority\n- Results-oriented; knows how to evaluate effectiveness of execution on a wide range of initiatives/programs.\nJob Demands:\n- Must be able to review and analyze data reports and manuals; must be computer proficient.\n- Must be able to communicate effectively via telephone and in person.\n\nOwn your work and your career - apply now\nAre you willing to go the extra mile because you love what you do and how you can contribute as a team? Do you want the freedom to grow and the opportunity to take charge of your own career? If so, then come join us.\n\nWe want hard working team players. You'll have the independence to learn, lead and drive change. A culture of extraordinary service, empowerment and stability - that's the First Republic way.\n\nWe believe that a diverse range of backgrounds and ideas has and will continue to be fundamental to the future success of First Republic.\n\nIf you are curious to learn more about this opportunity, we'd love to hear from you.\n\nThis job description is not intended to be all-inclusive. Employee may perform other related duties as assigned to meet the ongoing needs of the organization. The Company is an equal opportunity employer. In this regard, the Company makes reasonable accommodations for qualified applicants and employees with disabilities in order to enable them to perform all essential job functions, unless doing so creates an undue hardship.\n\nFirst Republic is subject to federal laws that restrict the employment of individuals with certain types of criminal histories, including FDIA Section 19 and FINRA. To the extent not inconsistent with our obligations under those federal laws and regulations, First Republic will consider qualified candidates with criminal histories in a manner consistent with the Los Angeles and San Francisco ban-the-box laws.\n\nFor New York City-based roles: Mayor Bill de Blasio announced that, effective December 27, 2021, all private sector employers?in New York City will be required to ensure that their employees are vaccinated against COVID-19 to attend work in the office. Reasonable Medical or Religious Accommodations may be requested if applicable to you. Please view New York's Guidance on Accommodations for Workers for more information",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQFj5iz4wyjB8wJqOb3-y9HX5xakN8eHqlMn06SejbYuu39k0UkJdkJEYw&s",
      "extensions": [
        "6 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgTGVhZCBBbmRyb2lkIERldmVsb3BlciIsImh0aWRvY2lkIjoicnlFeWJiOHJ2dzBBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVkJGTWtkWFJFbExYelpMTm0xcFVUVTViR3BLYVZkaU1GRnJVVUYwZEZWSWFYaGxRM1pxWVdaS1RsZHVWalJzZGpWUFdqbHhhbWxCUzJSNGRUaGFlRFpPWDNkQ1JsWnFPWFp6WkRBd1NXMURWRmhXUzFoaU5FSnlSWEJGTVZwb1NqWkxNMnBCV2kxdGJFSlJhR0p1TTJReGJEYzNWMnB2VVdjMk4yNW5UbFpTZWs5YWNWWlVjMGRCVGxOcFRFWjRlRXN6TUU1TVMweGFRMGxrWmt0bFNYQnJWemRZWW5GVGVsQkVWamxLVUROWlEwNXdjMGh1VWxZeU1scEJiV2x6TUZsdWVGZE1PVFJzU3pWc0VoZFBaa1ptV1hNdFIwZE9OMUZyVUVsUWEzWmhlQzFCYnhvaVFVUnFWMTh6U3pKS1pHOTNlWEZMY1ZGdFJYUmpjRkpoZWtKRUxYSXdkRkJhVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRoZSBNdXNlIiwibGluayI6Imh0dHBzOi8vd3d3LnRoZW11c2UuY29tL2pvYnMvZmlyc3RyZXB1YmxpY2JhbmsvbW9iaWxlLWxlYWQtYW5kcm9pZC1kZXZlbG9wZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Application Developer NO C2C",
      "company_name": "Byroe",
      "location": "New York, NY",
      "via": "via BeBee",
      "description": "GCOM is looking for candidates, to fill a role of Mobile Application Developer to join our Products Team located in Albany, NY (Remote)\n\nKey Responsibilities...\nassist with the development of our current Digital Identity projects.\n\nResponsibilities primarily revolve around building software by writing code, as well as modifying software to fix errors, adapt it as needed, and improve its performance, or upgrade interfaces.\n\nalso be involved in directing system testing and validation procedures and working with key stake holders or departments on technical issues including software design and maintenance.\nQualifications:\n\n5-7 Years of Software Development Experience including all facets of the software development process, including the research, design, programming, testing and implementation of computer software.\n5+ Years each in at least two of Java, Kotlin, Objective-C, and Swift. Familiarity with MySQL, SQLite, IOS/Android app development highly desirable. Familiarity with Security standard an secure programming methodologies highly desirable. Bachelors degree or higher\nby Jobble",
      "extensions": [
        "18 hours ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "18 hours ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIE5PIEMyQyIsImh0aWRvY2lkIjoib3licDcxNDY2SDBBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFEyRndSWHBZYUcxT1gydHRiblZIT1VkalZ6VktkbkF4TTFrNFJtaFhNelJwVDFGcVducGxNM28yYWtkUFgyTlNhUzFvVUZCTmExUTNTbWhoT0hKT1ozRXpjVTA1TkRCM2JqWnFiSEZ2WmpWV1lVNUVTalo0U25kMlZVMHlWbW8wZURoUWRsZEJiVGh2TkRrd1Z6ZEVTREJpUXpjMFlqaG1NMjU0VG1OS1UxcEtOM3BSZGxsVWEweHlkbUZ2T1c5d1JGWjJjMGhsUXpWTlZqRXlTWFZZZG10VlVUZEhaRzFDWkU1VFNIY3haamgzRWhkUFprWm1XWE10UjBkT04xRnJVRWxRYTNaaGVDMUJieG9pUVVScVYxOHpTbFpxWlhsbU5WOUpjMFpKZDFFMlZsODBVblp5VGw5SllrbG9RUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly91cy5iZWJlZS5jb20vam9iLzIwMjIwNDE5LTg2OWY3ZjcxOTY4NDJlYWEwMzQ1MWU2ZjY5ZTQwZDJiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Android BLE developer",
      "company_name": "consulting practice",
      "location": "New York, NY",
      "via": "via Craigslist New York",
      "description": "Remote work most of the time.\n\nNeed Android BLE specialist...\n\nGood hourly rate. We'll provide you with the hardware you need. You'll have to program the android phone and tablet to interface the hardware device.\n\nThis is not simply an Android programming position, this requires expertise and experience with BLE.\n\nThere will be a difficult technical interview you will have to make it through.\n\niOS BLE experience would be helpful as well.\n\nYou should be able to provide examples of hardware you worked with, and have solid references.\n\nImmediate interview. This is for a part time consulting position to start, but may transition to full time. You should be comfortable working remotely.\n\nEmail resume immediately",
      "extensions": [
        "17 days ago",
        "Contractor",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "17 days ago",
        "schedule_type": "Contractor"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEJMRSBkZXZlbG9wZXIiLCJodGlkb2NpZCI6IkkwdVg2YVU3aTJNQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVZCRk1rZFhRbEI0WWtwVFpWcFdRVk5zTUMxYWVtNUNWVEJoWDB0bVdXcENWMXB0UkhabVdISm5ZVlZXZW1WUVIwYzBNV2szWVdkRE4xRkhURXhEUmxsRVduaHJPVUpCYkhOTU9HeHRNWGMzTUZnelZUZzNWbTl6VjI0emVEaEdPWEJZTlhoYVZGWmphRWhTTWtWc1NFazBSMWRwWkdKU1gxWjBPVlZGYkdGbE1VSkhjVkZVYUdSS05tNWxkelJVVURocWRYbHNTWHA0UXpoamJtOVdTVE00V1doTVNrbHVWM0ZPV1RBeVdYQlNkbkZwUzBwWkVoZFBaa1ptV1hNdFIwZE9OMUZyVUVsUWEzWmhlQzFCYnhvaVFVUnFWMTh6VEcxUlZsaFJja1J3TVRCSkxWazJXRU5GWmpsdWVVOVVla2RoVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENyYWlnc2xpc3QgTmV3IFlvcmsiLCJsaW5rIjoiaHR0cHM6Ly9uZXd5b3JrLmNyYWlnc2xpc3Qub3JnL21uaC9zb2YvZC9uZXcteW9yay1hbmRyb2lkLW1vYmlsZS1hcHAtZGV2ZWxvcGVyLzc0NjY2MzA4MzEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Freelance iOS Developer",
      "company_name": "Smart Design",
      "location": "New York, NY",
      "via": "via Greenhouse",
      "description": "Freelance iOS Developer\n\nSmart Design is looking for a Freelance iOS Developer to help supplement our Interaction and Technology team on an exciting physical-digital project involving wearables and image recognition. The project is an interesting challenge in the sports science space...\n\nWe are looking for an iOS developer with design sensibility and interest in the overall user experience.\n\nThe role will be full-time, onsite in our NYC studio for approximately 3 months.\n\nResponsibilities:\n• Work closely with internal Interaction Design team and external developer in the full mobile application development life-cycle\n• Work closely with the Product Manager and Technology Director to manage the planning of development efforts, and track timelines and deliverables\n• Develop, test, and deploy user interface, service tier, and data tier components\n• Code, debug, test, and maintain applications to meet requirements\n• Travel may be required for technical presentations and deployments\n\nNaturally, your have:\n• At least 3 years of experience in iOS development, and at least 1 app in the App Store\n• iOS development experience using Objective-C, and Swift using XCODE\n• Reactive Native experience is a plus\n• Ruby on Rails, React.js, GraphQL, and Relay experience is a plus\n• A passion for keeping up-to-date on trends in the mobile industry\n• The iOS developer will be client-facing, so strong written and verbal communication skills are key\n• Eagerness to share knowledge and contribute ideas, to both the products and technology, during the project life cycle\n• Abilitiy to work onsite for the duration of the project (approximately 3 months",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5P3n4LR7diK-8J4AEsHA6XK74aLHkj_NG_OGna1g&s",
      "extensions": [
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJGcmVlbGFuY2UgaU9TIERldmVsb3BlciIsImh0aWRvY2lkIjoiRWxXQlYwb2tHc2tBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVkJGTWtkWFFqQlVaVE53TjI5eVlWZFhkVmw2YTBwNVQzUjJaRkpOZEdsMGFUZG9Uemd0YUc1VWVXOVplVkI2WDE4MGVtUjZjbTVzU0cxVlJYcFJSMWxGU1RsWFpGSmtibWxpUkhVMmQwczVjVTlNTlV0NU1FVlBWV1k0WkV0UGJsbGhWV1F3YVZrMVFrdHBjak5SVmxaTmFuaFpWRUZMTW14SVFVaGZkMmRJUkVac1JIVXpVV2gzUzA1aFh6VTBjMk5RUkZkRGFsOVRkVlZxZG1GVVJpMVFUM1pVZWs5R1pteDJaa2x5UzBwT1pISm1RM05CRWhkUFprWm1XWE10UjBkT04xRnJVRWxRYTNaaGVDMUJieG9pUVVScVYxOHpTMU5PZFRCVGIxUkZkelpqUmxVMGRGOU5ZWEZGZWpoSWNWZGlVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlZW5ob3VzZSIsImxpbmsiOiJodHRwczovL2JvYXJkcy5ncmVlbmhvdXNlLmlvL3NtYXJ0ZGVzaWdud29ybGR3aWRlL2pvYnMvMTAyMDkzMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Senior Front-End App Developer - React Native",
      "company_name": "BarExpress",
      "location": "Anywhere",
      "via": "via AngelList",
      "description": "Looking for an experienced app developer, in react native, to fix issues and develop new features.\n\nWorking on IOS & Android platforms.\n\nBarExpress.com\n\nBarExpress focuses on Bars, Mobile Application, and Club Promotion. Their company has offices in New York City. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://www.barexpress.com",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcScCtPy_GndAxCKSditAya_kcMiG0C8SvqEJ6FSjB0&s",
      "extensions": [
        "Work from home",
        "Internship",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Internship",
        "work_from_home": true
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnQtRW5kIEFwcCBEZXZlbG9wZXIgLSBSZWFjdCBOYXRpdmUiLCJodGlkb2NpZCI6ImZITlBDYUFGbGhRQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVZCRk1rZFhSRUZ5VEZaUllURXRTSGh3VVc1MWNuUjRXREZtWW1KbU1YRnlkemhXV0ZkbVNEWnhSMGRNYTFsSVp6aHZZVEF0ZWxBemQySlVMVzVZYkdWVFlreENTVmhpZG5Kbk5YbE5VRTV4UmxGRGRrdGZOVFJEUjFBNE1XRjJhMkpSVERFelUzbGpiRko2ZFhGcGNHUm9hM2h1VTBOd2EySjRTbmxFWWpKZlRYbHRlWFpsTUd4M2JqQnZZMTlJY1hwaWJEVktNRkU1YW5KemVHNVVWWEpMVVdsblF6QlVlRkprVEc5cFJWcHRaMHBIUW5Oc1QwbGhSbGRmY2tKQ1IwbHhTMXBPUzNsMGRWZEpFaGRQWmtabVdYTXRSMGRPTjFGclVFbFFhM1poZUMxQmJ4b2lRVVJxVjE4elNsYzJUSFYzYVRWcmMzSktPSEpvTjBoUVNVSlRPVXBmUlZOWlFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBBbmdlbExpc3QiLCJsaW5rIjoiaHR0cHM6Ly9hbmdlbC5jby9jb21wYW55L2JhcmV4cHJlc3Mvam9icy8xNTI0MjM0LXNlbmlvci1mcm9udC1lbmQtYXBwLWRldmVsb3Blci1yZWFjdC1uYXRpdmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Senior Software Developer- Mobile Applications",
      "company_name": "Weatherford",
      "location": "New York, NY",
      "via": "via Trabajo.org",
      "description": "Overview\n\nWeatherford is a leading global energy services company. Our world-class experts partner with customers to optimize their resources and realize the full potential of their assets. Across our operating locations, including manufacturing, research and development, service, and training facilities, operators choose us for strategic solutions that add efficiency, flexibility, and... responsibility to any energy operation.\n\nWe are focused on technology development, digital solutions, and defining our footprint in the new energy space. Our ability to provide integrated solutions across our segments will be critical to growth in our core operations and the energy transition.\n\nEnergy producers face unique challenges every day, so it is our job to create solutions that enhance safety, streamline operations, and sustain uptime to meet or exceed their targets. We operate across the global energy landscape employing some of the best diverse talent in the industry. At Weatherford, we understand the value each individual brings to the table. We celebrate diversity in all its forms and are immensely proud of our workforce. We invite you to join our passionate, talented, word-class team.\n\nWhen you join Weatherford, you instantly feel connected to something bigger - a community that is grounded by our core values and driven to create innovative solutions for our customers. We celebrate each other's successes, grow together, and learn from each other constantly. Individually, we are impressive. Together, we are unstoppable. We are One Weatherford.\n\nWeatherford offers competitive compensation, a comprehensive benefits program and provide you a challenging and enriching career path, with a healthy balance of structure and flexibility to chart your own course.\n\nResponsibilities\n\nWe are looking for a motivated, experienced Software Developer to join our organization. Our small and self-organizing teams employ agile processes to create a high-performing software development environment. This position requires working with teams in San Luis Obispo, California and Houston, Texas with the opportunity to work out of either location. Remote work is also a consideration for the right candidate. This position entails working as a high-level technical expert to apply a broad understanding of theories and principles of computer science, engineering, and mathematical analysis to create software solutions. The position will initially focus on building and maintaining Xamarin. Forms-based, iOS mobile applications for the next generation of our IoT platform.\n\nDevelops and maintains engineering software for use in the energy industry\nAnalyzes, decomposes, and specifies requirements based upon understanding of business applications and engineering principles\nContributes to the creation of system and product architecture, design, and interface definitions\nCreates design artifacts and documentation using software engineering conventions to convey an engineered solution to other developers and engineers\nUnderstand UX concepts and work with WFRD UX team to adhere to WFRD UX best practices\nDevelops and implements detailed and complex algorithms for engineering solutions\nResolves complex product and system issues applying computer science, engineering approaches, and mathematical principles\nResolves customer complaints with software and responds to suggestions for improvements and enhancements\nParticipates in the development of software user manuals\nAssists in coaching and training less-experienced software staff\nMay assist in the planning and coordination of projects or act as a team leader\nWorks with software test teams to design and develop testing strategies, guidelines, and goals for integration of components, product testing, and acceptance testing\nAssists with the definition, implementation, assessment, measurement, management, change, and improvement of the software development process.\nParticipates in change control decisions of products\nIdentifies and assists in the management of intellectual property, third-party software, re-use, and compliance\nProvides technical leadership to the organization and development team\nActs as a technical consultant to Product Line Management, Support, Services, and Testing organizations, as well as to other development teams\nContributes significantly to product roadmaps, estimation, planning, identification of risks and issues, and development status\nDemonstrates good interpersonal and communication skills with the ability to work closely with internal and external customers to translate needs into requirements, to explain and resolve technical issues, and to present technical solutions\nUnderstands and complies with all safety rules and company policies\nPerforms various other duties and activities as assigned by supervisor within the physical constraints of the job\n\nQualifications\n\nSkills & Knowledge\n\nEssential:\nAdvanced knowledge of OOD/OOP\nAdvanced knowledge of C++ and C#\nXamarin Forms and iOS mobile development experience\nExperience in software architectural design\nExperience in client/server development on MS Windows platform\nUnderstanding of software engineering principles with the ability to translate requirements into design and design/analysis into code\nStrong diagnostic skills to analyze, track, trouble-shoot, and solve complex problems and design appropriate solutions\nAbility to prioritize and perform work independently\nGood interpersonal skills and ability to foster teamwork\n\nPreferred:\nExperience in developing engineering software in upstream oil/gas industry\nWorking knowledge of agile framework and methodologies\nWorking knowledge of design patterns\nExperience in database technologies, such as SQL Server, PostgreSQL\nKnowledge of Android platform is a plus\n\nMinimum Qualifications\n\nEssential:\nBS Engineering, Computer Science, or equivalent\n\nPreferred:\n\nMS Engineering or Computer Science with 2 years software development experience, or 5 years software development experience",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQVXt4hVznV2sQddLi_40piNBNayyxgq2bO7yGeNfE&s",
      "extensions": [
        "3 days ago",
        "Full-time",
        "Health insurance"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyLSBNb2JpbGUgQXBwbGljYXRpb25zIiwiaHRpZG9jaWQiOiJzRU0wemtGN3J4RUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFWQkZNa2RYUkZkbldIQk5UWFZ0UzA5RFNWUlpjMGw0UTJGcVkyOURTMmd6VmpSRVUwVkRiVEJNYTI5R1ZVVmZaRnBWV0VKT2IwTjFjM2xQUTBWVVZuQkROSEpPU0dodGJYQnhlWFpJU1RJd1FXazBWR1JzZEd0d1dYVjBUbWszYUdGUVVVbHhlbFpZUjE5WlJVbGxPVFZyY2tOelV6TTNXV0poYmxGZmRVcHFablZCTFY5NVdFeDNaRmhMWVRRM1JuSmFRbU5vTVdsT1RuWmlNWEpyUzBneE1XNU5MVjlPTTNwS01WcDJTRUpDVmpKcFpVYzVVbnBmUWtNeVJuQlJSVXB2VkZOc2IyTmlkVEZRTVV0elEzSjJlVTAzUmtsaVVVVXhObkpCYTFNM1p4SVhUMlpHWmxsekxVZEhUamRSYTFCSlVHdDJZWGd0UVc4YUlrRkVhbGRmTTBwcGFHUkdiWEUyZERoMmFYVmZkVWwyVm5ndFltTnRRM0pRWkdjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3VzLnRyYWJham8ub3JnL2pvYi02NDAtMjAyMjA0MTctYjI3YThhNTRkNDg2NTU5YmI0NDEyOTM5OTI0MjljNTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Mobile Developer",
      "company_name": "GENESYS Consulting Services, Inc.",
      "location": "Albany, NY",
      "via": "via WayUp",
      "description": "Job Description:\n\nLead the application development of mobile technology. Provide solution design, and create functional and technical documents. Staff will develop, implement, manage, and maintain applications using various Apple technologies...\n\nJob Duties:\n• Mobile App Analysis\n• Mobile App Design\n• Mobile App Development\n• Mobile App Testing\n• Cloud Integration via Restful API\n• Iterative Build Demonstrations to team and customers\n• Documenting processes and procedures\n• Participate in design sessions\n• Provide end-user training\n• Provide support for testing mobile and cloud-based applications\n\nRequired Qualifications:\n• Bachelor’s Degree in Math, Sciences, Engineering, or Computer Science preferred.\n• An equivalent combination of advanced education, training, and experience will be considered.\n• A minimum of 5 years of experience.\n• 24 Months of experience with Apple SwiftUI framework.\n• 60 Months of experience with Native iOS development.\n• 60 Months of experience developing with the Apple Swift programming language.\n• 36 Months of experience assisting in translation of business requirements into design specifications and mockups.\n• 36 Months of Experience assisting testing teams in the user acceptance testing of the system, including helping to define function scripts, business use cases etc. to test system capabilities.\n\nGENESYS Consulting Services is an equal opportunity employer",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_vpHSe5OGq_nGP9EDyciasq6ETGPrV85J7AuOyuE&s",
      "extensions": [
        "29 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "29 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJmNHBKUTVHS3hmb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUVU5eU5rZzFjbkp5UkRoS1dEY3dObWROYjBwQmIwSkVkRlUzT0VOcFIwY3pWWEF5YlZKamRGbExVVnBFU2pKRmNISlNhV1JNZURSRldISjBiMHN0YVVsTVdrMXNVVjlyWVRabE1uQnpNSGwwYzJOd1ZrZEJjWEUxYTB0NGVFdGlhemxwVlZabFZFRjJMV2R6V0RoVFZGRjZTMUZGVEZRMWJqTlRjMDFTY1V0S2NrOVFVV3hLVjFsR1ZXZDVNMkl4VGw5R1VrSmxXVVpIY2t4M1FsOXhhRkIyVWpoRmFXSTVRa1pYTkdsRlMwSnBha0ZJZWtoelJITTJaVWd3TUd0SVlsZDROV2hmRWhkUFprWm1XWE10UjBkT04xRnJVRWxRYTNaaGVDMUJieG9pUVVScVYxOHpTakIwWDNoMFYwZDVMWEJ2UjFGck9VMVJUVFV4ZGpGb1ZscDVkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2F5VXAiLCJsaW5rIjoiaHR0cHM6Ly93d3cud2F5dXAuY29tL2ktai1HRU5FU1lTLUNvbnN1bHRpbmctU2VydmljZXMtSW5jLTgwNDc4MDcxNzgyMzU0Ny8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Augmented Reality App Developer",
      "company_name": "Invonto",
      "location": "New York, NY",
      "via": "via Salary.com",
      "description": "We are looking for an experienced Augmented Reality (AR) mobile app developer.\n\nQualifications...\n• A degree in computer science, engineering, or a relevant field\n• 3 years of experience in building production ready applications\n• Experience developing augmented reality applications for iOS and Android\n• Experience with Unity, Swift, ARKit, ARCore, and ARFoundation\n• Excellent verbal/written communication skills\n• Excellent analytical and problem-solving skills\n\nAdditional Details\n\nThis is a direct-hire full-time position. Position requires working average 40 hours each week Monday to Friday between 9am - 6pm Eastern Time. Position offers competitive salary / hourly rate.\n\nPosition requires authorization to work in the USA. We are unable to sponsor work visas. Please apply only if you have relevant skills, work authorization, and required qualifications.\n\nPlease submit your resume for immediate consideration. Only short listed candidates will be contacted. No phone calls, please!\n\nAbout Invonto\n\nInvonto is a digital consulting company. We design and build digital products that transform companies and advance industries. We have a diverse and experienced team that takes pride in solving complex business problems with innovative digital solutions. We've partnered with many Fortune 500 companies, such as Merck, Comcast, Sealed Air, D. R. Horton, and Transamerica. Invonto is recognized as one of the most innovative tech companies by New Jersey Tech Council",
      "extensions": [
        "9 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "9 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBdWdtZW50ZWQgUmVhbGl0eSBBcHAgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJJU1lXQkFzQ2Z5VUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUVcxNlpuSjRPRGhVZFdKMFpUQnRUR2xLUm5kS04xbHNjbEJHUjNSUU5XMW9hRTB6WVdWdWQyTjBhMVZPVkROMllqbHpjVlF6TVhwUlJFcE5WWEZYWjNoUmFWUXphbFU0VDJGek5WcHZaMVpSV2xOQlpWcHVVMjVSVTA5M1ZtbHNkVWhIT1dKUFUzaHNSR2RtUVVGd2REYzFiWGwxVGt4ZlRteHBTemh3UkVGTWNGSmFlbXhtUmtWQlYyOTRaRUZYYld4Wk56RlpXa0p6ZWxKc1lWWXRlamRyZUZaSWNWVmhVRmN3UW1SUGRXcHJFaGRQWmtabVdYTXRSMGRPTjFGclVFbFFhM1poZUMxQmJ4b2lRVVJxVjE4elMzUmpOa1pCVVhGTU5GSk5la2wzUkRkU01VWkhNbkozVERaYVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2FsYXJ5LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5zYWxhcnkuY29tL2pvYi9pbnZvbnRvL2F1Z21lbnRlZC1yZWFsaXR5LWFwcC1kZXZlbG9wZXIvajIwMjIwNDEwMDkxODMzMDk0NDgxOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Application Developer - Android",
      "company_name": "Miku",
      "location": "Woodbridge Township, NJ",
      "via": "via My Valley Jobs Today",
      "description": "Miku is looking for an Android Application Developer. The person in this role will collaborate with a cross-functional internal design and engineering team and external partners to develop cutting edge Android applications for Miku’s IoT products. The ideal candidate will be experienced in providing a highly responsive and solidly reliable experience for users in a mission critical video streaming environment. RESPONSIBILITIES Design, build, test and publish applications for the Android platform Deliver well-performing, high-quality, responsive Android applications to our customers Collaborate with a multi-disciplinary, agile team to design, implement, and deploy new features Effectively work with support and engineering to troubleshoot, isolate, identify and fix app issues Maintain robust, well-documented, organized, readable code BASIC REQUIREMENTS B.S. degree in Computer Science, Engineering or equivalent experience 3+ years of experience in Android application development... Proficient with both RxJava and Kotlin, MVVM and Android Studio Working knowledge of web architecture and protocols (REST APIs, WebSockets, HTTP, JSON etc.) Solid understanding of Android SDK, including designing across multiple Android versions, devices and screens sizes Familiarity with push notifications and back-end APIs Experience with Git or equivalent software configuration management tools Familiarity with continuous integration, automated unit testing and integration testing. Knowledge of the emerging technologies and trends in the mobile environment Understanding of general UI/UX design principles and best practices Experience across the full mobile app development life cycle, including the Google Play deployment/release process Proven success working in agile environments and across various process paradigms PREFERRED REQUIREMENTS Experience developing applications that demand high reliability, stability and availability in a critical use-case environment Understanding of hardware-in-the-loop development and dependencies, necessitating efficient collaboration and communication with cross-functional team Experience with design, implementation and optimization of live, real-time video streaming applications and protocols, i.e. WebRTC, SRTP, SIP etc. Experience implementing applications that utilize bluetooth to communicate with IoT or other devices Proficient in best practices for real-time data processing Familiarity with both XML layouts and Compose",
      "extensions": [
        "2 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBEZXZlbG9wZXIgLSBBbmRyb2lkIiwiaHRpZG9jaWQiOiJuZzFwTVV4VlVORUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFWQkZNa2RYUWxRMU1HWTFRaTFFVm5wR1NsOWxNVlY2UlRKNGRtc3daMDVXUW1wNU16ZGZWMHRIWmtsNVluSmZUbXhpZGtwR1dDMXVlV3BaWmsweGJHSk9TWEl0YWxsalZXTmtlbDlPUWxJNGNITkJkM1pYUzAxTVN6ZE1TbmxxWVZKb2ExOU9jQzFDWjE4MWIyNVZjMjFmZERjdFltSjBibGx3TUdaQ2NVRm1ZMXA2VjJsb09FMUtXVXgzWmt0VVkxVlJjbVYxYUd0WWVEVnpXbk5YU0ZNMFdtcDZVbUV6T0hCMVZtUm1VakJGVkU1UGQwTkJFaGRQWmtabVdYTXRSMGRPTjFGclVFbFFhM1poZUMxQmJ4b2lRVVJxVjE4elNWbFRSMnRUWW5SRE5VUnFWbTlETWpCcFJuRkxWMnBxTTBRMFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTXkgVmFsbGV5IEpvYnMgVG9kYXkiLCJsaW5rIjoiaHR0cHM6Ly93d3cubXl2YWxsZXlqb2JzdG9kYXkuY29tL2pvYnMvYXBwbGljYXRpb24tZGV2ZWxvcGVyLWFuZHJvaWQtd29vZGJyaWRnZS1uZXctamVyc2V5LzU2NjMxMjg1NC0yLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Entry to Mid Level Mobile App Developer.",
      "company_name": "Adidev Technologies Inc",
      "location": "Providence, RI",
      "via": "via Adidev Technologies Inc - Trakstar",
      "description": "Adidev Technologies Inc.\nwww.adidevtechnologies.com\n...\nURGENT HIRING WITH IN 24-48 HOURS\n\nAdidev Technologies is seeking entry and mid level iOS and Android developers with at least 1 - 2 years of experience. Must be a driven self starter and open to working onsite, following the lifting of Covid -19 limitations. Must be willing to relocate depending upon the client assignment. A project can last anywhere from 6 months to 18 months. Salary varies depending upon experience, and we are in search of candidates looking to start as soon as possible. Excellent written and oral communication are required as is the ability to work well in a team environment.\nIf you are looking for a new challenge and are ready to make an impact on a growing team, then this will be a perfect fit. As an iOS or Android Mobile Developer for Adidev Technologies Inc., you will be enhancing and debugging large-scale applications for one of our well-known clients.\nAdidev Technologies is a growing software consulting company that is constantly expanding. As we are working with renowned clients and ready to take on new ones, we are seeking brilliant software engineers. Not only do we offer a great team to work with, we also offer you an opportunity to make an immediate impact and get rewarded accordingly.\n\nResponsibilities and Duties :\n\nDesign and build applications for the iOS or Android platform\nEnsure the performance, quality, and responsiveness of applications\nCollaborate with a team to define, design, and ship new features\nIdentify and correct bottlenecks and fix bugs\nHelp maintain code quality, organization, and automatization\nMaintain positive rapport with all clients\nGather requirements and provide accurate and realistic project milestones and timelines for completion\nSuccessfully perform any coding tests or challenges as required\nMaintain open communication via phone, text, and email on a daily basis\nComplete daily project progress summaries\nSuggest new features and expansions of existing apps to improve performance and usability\nDeliver on time as discussed and clearly communicate any changes in deadlines as soon as possible\n\nBenefits\nCompetitive Salary\nPaid Relocation\nRemote Support\nGuaranteed Regular Salary Reviews\nJob Type: W2 or Contract 1099 (full time - 40 hours)\nSalary: $60k to $85k or $30/hr to $40/hr + Depending upon Experience\n\nQualifications and Skills: Android Developer\n\nAt least 2 years of experience with Java and Kotlin.\nAt least 1 application published to the Play Store; Displays familiarity with the process\nStrong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes\nExperience with offline storage, threading, and performance tuning\nKnowledge of the open-source Android ecosystem and the libraries available for common tasks\nFamiliarity with RESTful APIs to connect Android applications to back-end services\nComfortable with Git and source control\nA strong work ethic and the ability to manage yourself and your time\nExcellent communication skills - both written and verbal\n\nRequired experience:\n\nJava: 1-2 years\nKotlin: 1 year\nAndroid SDK\nPlaystore\n\nQualifications and Skills: iOS Developer\n\nProficient with Swift and Objective-C( knowledge and hands on), and Cocoa Touch\nExperience with iOS frameworks such as Core Data, Core Animation, etc.\nExperience with Design Patterns such as MVC, Singleton, etc.\nExperience with offline storage, threading, and performance tuning\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nFamiliarity with 3rd Party API integrations such as Facebook, Dropbox, Instagram, Twitter, GoogleDrive, Bluetooth, Keychain, etc.\nKnowledge of other web technologies and UI/UX standards\nUnderstanding of Apple’s design principles and interface guidelines\nKnowledge of low-level C-based libraries is preferred\nExperience with performance and memory tuning with tools {{such as Instruments and Shark, depending on project needs}}\nFamiliarity with cloud message APIs and push notifications\nKnack for benchmarking and optimization\nProficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\nFamiliarity with continuous integration\n4 Years College Degree, Bachelor's Degree in Computer Science Preferred, will make some exceptions to non degreed code school graduates ONLY for exceptionally skilled programmers with previous experience\n\nRequired experience:\n\nSwift - 1-2 years\nObjective-C - 1-2 years\niOS SDK\nAppstore",
      "extensions": [
        "Full-time"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJFbnRyeSB0byBNaWQgTGV2ZWwgTW9iaWxlIEFwcCBEZXZlbG9wZXIuIiwiaHRpZG9jaWQiOiJmekVQMTFxQnpFQUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFWQkZNa2RYUW5WMFprSlVWRXhVYmtaTk1TMVNaVWRxVEVZeGMxWXlVeTB3WVVOQ00xOWlhRkpMY1UxT2QyNDRlbWwwZEVOdFNtTkRVR2x4YW14cmVXb3pObGRDT1VkeVRtTmpSSGQwTlRWVFJEQmZRV2haU1hwdVJGaDNUR2RxUVZJMmFuVjZXbEZzWW1WdmQxRmhNbEp0TmpCSVMzVjFaRGRSZFZZeVNHWjVkRVE0TVVSUVRWOVRaelpET0ZSTFJHMDVTREpST1RSc2NuTmpNemRqZDBwTlowaDNiMVZJYjFGaGFETlllSGxqVmxobWFWRmFXakV5Y0hKemIyODNWbk0xWm01TmNVdGpWa1pVZFhseGRVRlNTVFZ1YWtNNWFrZFJjVE0wUTNwT2R4SVhUMlpHWmxsekxVZEhUamRSYTFCSlVHdDJZWGd0UVc4YUlrRkVhbGRmTTBwT1JuaGZjV0YwT0c5bFdtOXhTaTFQVkVoWWVtMTBhbWxxUW1jIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWRpZGV2IFRlY2hub2xvZ2llcyBJbmMgLSBUcmFrc3RhciIsImxpbmsiOiJodHRwczovL2FkaWRldnRlY2hub2xvZ2llcy5oaXJlLnRyYWtzdGFyLmNvbS9qb2JzL2ZrMHFrNjYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Software engineer - Mobile app developer",
      "company_name": "Vegpalapp",
      "location": "Anywhere",
      "via": "via AngelList",
      "description": "We are seeking Mobile app developer, who is will engineer an application that will run across Android, and iOS. Ideal candidate is skilled in using flutter, and dart. We are looking for someone passionate about performance, and writing high quality, clean code. This person will be the lead developer for the company.\n\nThe ideal candidate will have experience building native applications... JavaScript knowledge, and a portfolio of applications already published either in the app store or self-hosted.\n\nQualifications:\n\nHave two or more iOS/Android apps developed with Flutter. Either deployed on the AppStore/Google Play or available on Github;\n\n5+ years in mobile software development;\n\nOver one year’s developing Flutter applications for mobile\n\nExperience with third-party libraries and APIs;\n\nUnderstanding of the Agile development life-cycle;\n\nExperience with automated testing and building;\n\nExperience with Git, SVN, or other version control tools;\n\nProven experience in writing readable code, creating extensive documentation for existing code, and refactoring previously written code\n\nVegpalapp focuses on Online Dating and Mobile Application. Their company has offices in Boston. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://vegpalapp.com",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0aeKzpYGpzzZ8kkngs-n_rX-6qSqG0-6TZES3r4k&s",
      "extensions": [
        "Work from home",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time",
        "work_from_home": true
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBlbmdpbmVlciAtIE1vYmlsZSBhcHAgZGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJLVjJqNW00ZjdUb0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUVVrelYyRlNSSFV0VUdSV2VESnNTRjlXZFdoSVNFNVNVVXBVU25ReE9WUm1ZeTFoTkRsd1MxSkdWazA0T0RSTmFHSmpOVmxZY21wa2JqTmthVmxXYTB0dGFqSkpNblJNUkZObWJWQnRXazg0Y3pCNmJtdFlkVkY1WDBaTFEyOUtSVzlCZWxKNFZ6WkNha0U1TTNscFZuSm9VSEo2TUZJdFdHTjFNUzF6UlhkR2JGWlBPVFJyV2s5SUxWSjVMVXRwZHpKcGVVOW5ibGhxTWxGMFF6Qk5VMk0xU0dGRVlsUjVjV1p3YTNsMlZUZEhWV1JDTkhWeVZVcFlXRms1WVdOWGFYSktVVUpSRWhkUlgwWm1XWEUyVVU5S1NFOTVkRTFRZGpsMVkzVkJXUm9pUVVScVYxOHpURlUwVFU1alJWRlRaSEIxTjFVM2JsUndjbWc0UzB4alMxSkNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gQW5nZWxMaXN0IiwibGluayI6Imh0dHBzOi8vYW5nZWwuY28vY29tcGFueS92ZWdwYWxhcHAvam9icy8xOTY0NDUxLXNvZnR3YXJlLWVuZ2luZWVyLW1vYmlsZS1hcHAtZGV2ZWxvcGVyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Sr. Mobile Developer (Android and iOS)",
      "company_name": "Medullan",
      "location": "Somerville, MA",
      "via": "via Tarta.ai",
      "description": "About US\n\nFor over 15 years, Medullan has assisted healthcare companies with digital transformation. Our work begins with digital strategy and customer research and continues to the development of human centered, commercially viable web, mobile, and multi-channel solutions...\n\nAlthough we serve clients across the healthcare ecosystem, our work today increasingly focuses on Life Sciences and Pharma, where our consulting and platform businesses partner to build personalized digital solutions for patient support programs, nutrition, and chronic disease management, with an increased focus on Software as a Medical Device (SaMD)\n\nAt Medullan, you’ll work with smart, fun people from diverse backgrounds to deliver world-class results to some of the largest names in healthcare. You’ll help us build a great company while impacting the lives of people around the world.\n\nPosition Overview\n\nAs a Mobile App Developer, you will work with Digital Strategy, User Experience and other Technology Teams to create highly interactive, responsive and secure mobile solutions. Guided by a core value of taking ownership, we have a highly collaborative environment to share insights and knowledge. You will provide the ‘mobile perspective’ for technology architecture and solutioning in the context of a Lean methodology. We use MVP’s/rapid prototyping for PoC’s and as such, help create pathways to products.\n\nResponsibilities include:\n• Have the flexibility to propose and implement your own ideas and solutions to challenging problems.\n• Maintain technical expertise in emerging mobile app dev technical trends while proposing new mobile tools, frameworks, and processes.\n• Collaborate with the product development team to architect solutions and establish reasonable timelines.\n• Assist in guiding offshore developers to develop mobile applications with code that follows Android and IOS best practices, is well-organized, easy to read, maintain, and optimized for its intended purpose.\n• Support the entire application lifecycle for mobile app development (concept, design, test, release, and support)\n• Participate in and be familiar with Agile (Scrum) project methodology and practices.\n• Provide support for any issue that is or may cause system downtime\n\nBasic requirements:\n• Minimum of 2 years of intensive Native Android and iOS mobile development experience.\n• iOS (Objective C, Swift 4+, iOS SDK); Android (Android Framework, Java);\n• UI design skills and knowledge of platform design specifications.\n• Knowledge of tooling and build systems.\n• At least one app released to the Google Play Store and Apple App Store.\n• Experience creating enterprise Applications, preferable in a healthcare setting.\n• Tooling: Android Studio and XCode\n\nNice to have:\n• Experience with cross-platform native frameworks (Xamarin or React Native)\n• Experience with CI/CD tools such as Visual Studio App Center or Fastlane\n• Experience developing using test automation frameworks for use with native or cross-platform mobile applications\n\nCharacter and Interests (The Edge):\n• Ability to multitask, absorb new technologies, and work in a fast-paced and dynamic team environment.\n• Ability to work with business clients, facilitating discussions, and assimilating processes, issues and needs\n• A strong sense of ownership and accountability; “can do” attitude\n• A determination to learn and grow your skills and capabilities",
      "extensions": [
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJTci4gTW9iaWxlIERldmVsb3BlciAoQW5kcm9pZCBhbmQgaU9TKSIsImh0aWRvY2lkIjoiYjk5N1ZOZGw5dkFBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVkJGTWtkWFEwNVVlSGxtTTFsMU1FVXdaVWx1TmxKMmIzUkpWMDU2VURjMVlUQlRhMFJDV0ZWQ1VEVnJOMEZtWkV4M2VXaENiVTFXVEd0NWFqRjFaRE5mVkROclVsSjFRbWREV0cxZmVHMUtZbUYxY3pkWGFXTkhXRFpEUkdka05ucDJWM0pRTFhOaE1qaDRiVFZUUTBSSVVHOXZibTluVEMwM2J6WktWbE5tUjNCb1FWTjFYMUpOYmxSNVlYVndSbUZ3YzJVNVZsWnhSVzlmVTFkRVdWOU5NRVF4YzNaNVRERTJjVUZhUlRSWWFqZzVZa1U0TjFWUVRXTndkbVJKU25veVJFZHZTRTF3Tm5sU1NqTnpUVXRLWVRKQlUxWjNZM2htUTJSblJVOUtRUklYVVY5R1psbHhObEZQU2toUGVYUk5VSFk1ZFdOMVFWa2FJa0ZFYWxkZk0weFlNMVl6Um1OaWFUaE9jVkJXTTJKcVYwUTFhbmxYYUdoeGNuYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGFydGEuYWkiLCJsaW5rIjoiaHR0cHM6Ly90YXJ0YS5haS9qL3kzTThHSDBCUFY0MDZsNlhZMjV4LXNyLW1vYmlsZS1kZXZlbG9wZXItYW5kcm9pZC1hbmQtaW9zLWluLXNvbWVydmlsbGUtbWEtYXQtbWVkdWxsYW4/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Remote Senior iOS Developer - Swift, Mobile",
      "company_name": "CyberCoders",
      "location": "Boston, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "If you are a Remote Senior iOS Developer with experience, please read on!\nWe are a leading mobile app development agency that creates apps for some of the leading Fortune 500 companies. We specialize in IoT applications and have worked with companies like Google, Twitter, and Facebook.\nWhat You Will Be Doing...\nAs a software developer, youll be focused on creating mobile applications using a variety of technologies. You will be asked to tackle various coding obstacles and make smart decisions, including weighing the pros and cons of different approaches. A typical project lasts 3-6 months, and there will be plenty of opportunities to move around, intermingle on various project/product teams and hone your skills. You should have an advanced ability to conceptualize, design and build product features. You will need to be able to take a feature and traverse the entire stack to build the pieces you will need to deliver a high-quality implementation.\nWhat You Need for this Position\n3+ years of experience building mobile applications in iOS (Swift)\nAbility to demonstrate knowledge of native iOS development\nWhat's In It for You\nCompetitive Base Salary (Up to $160k)\nVacation/PTO\nMedical\nDental\nVision\nBonus\n401k\nSo, if you are a Remote Senior iOS Developer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nDominik.Sobaszek@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : DS15-1649474 -- in the email subject line for your application to be considered.***\nDominik Sobaszek - Associate Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance",
      "extensions": [
        "2 days ago",
        "Full-time",
        "No degree mentioned",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSZW1vdGUgU2VuaW9yIGlPUyBEZXZlbG9wZXIgLSBTd2lmdCwgTW9iaWxlIiwiaHRpZG9jaWQiOiJtckx4Y25vTTB0OEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFWQkZNa2RYUW1kUVpHRmFVVlF3V1U1RmVrRjVjVlV5VERsbk5UQldaR1Z0ZGtGUE5FMUlNVk4wYlZkZldGOXhhRlZKT1RFdFVqbFVWamhqVW1veExXMW5kamxwWkVsR2JuTkNiVVJFZEZaTFl6VTVNRUpIY0hCSGRtcDNUbXBQV1doWlVFMVpOVloxZGswNFF6UndSVjlWV0V4amFXMXlWMlp3VTA5ZlgybzVUVXg1YmtwRWJIVnNZbUZITkdGUFoyWldjVFZaYzNjd1F6azJjVTFDWVdSb05FWTJPWFZ2T0hwSFZrZGlNMUZDVVUxVGNYcEVSMVpEWlhkcmEySjFiM0ZNYW10YVJGRnpjRXhTTVRnNWFrTlNjM2hJUzBWM1RVSnViRWRxUTJacVFSSVhVVjlHWmxseE5sRlBTa2hQZVhSTlVIWTVkV04xUVZrYUlrRkVhbGRmTTBwTWFWSkdYMGhyV2xWUmNFSlhhR1V4VEZsbFVucEtTelIxTVdjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTZWFyY2ggQW5kIEZpbmQgWW91ciBOZXcgSm9iIFRvZGF5IFdpdGggQmpvYnoiLCJsaW5rIjoiaHR0cHM6Ly9iLWpvYnouY29tL3VzL3dlYi9qb2Jwb3N0aW5nLzkzNzUwNDAzMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Application Development Manager | 100% Remote",
      "company_name": "Vaco Technology",
      "location": "Boston, MA",
      "via": "via Trabajo.org",
      "description": "• **Senior Software Engineer***\n• **100% Remote***\n• **Upto $200k + Paid Benefits...\n\nDescription:\n\nAbout Client:\n\nOur client is a start-up technology company based in Glen Allen, VA. They are the creators of an integrated, cloud-based, marketing and business management platform providing comprehensive tools for business owners and are on a mission to transform the way buyers and sellers connect. They are all about result\n\ns and are looking for people who want to change the game. If that's you, you've come to the right place\n\nNotes from the call with Hiring Manager:\n\nFirstly, must be Senior, 10 - 15yrs experience.\n\nMust Have:\n\nGoogle App Engine - 5-7 years on large web applications\n\nPython - Must be version 2.7\n\nDjango\n\nCSS, HTML, Java Script, Jquery\n\nNoSQL, Postgres, Bigtable - GCP\n\nThe ideal candidate is:\n\nA seasoned technologist versatile in the entire web application development stack and associated tools\n\nHighly motivated by constant challenges to build one of the largest websites in the US\n\nIndependent, analytical, and a critical thinker and problem solver\n\nA team player first and foremost, and comfortable establishing relationships and performing in an ambiguous and distributed environment\n\nResponsibilities:\n\nArchitect scalable and elegant solutions to meet end user needs\n\nManage timely and quality delivery of software projects in a highly agile team environment\n\nProvide technical feasibility assessments to bring product experience to the next level\n\nCollaborate during code reviews, paired programming, and other team activities\n\nCoach and mentor other team members, and willing to be coached and mentored\n\nResearch and adopt leading edge technology tools and frameworks\n\nQualifications:\n\nBS (MS preferred) in Computer Science, or equivalent\n\n7+ years of software development on large scale web-based applications\n\nThorough understanding of software development life cycle, and ability to adjust to a fast paced agile environment.\n\nExcellent collaboration and communication skills required.\n\nExcellent knowledge of web standards and related technologies, e.\n\ng.\n\n, HTTP, HTML, CSS, Javascript\n\nExperience with web application frameworks, e.\n\ng., Ruby on Rails, Django, ASP.NET, MVC\n\nFluent in database design and query languages\n\nJob Requirements:\nArchitect scalable and elegant solutions to meet end user needs Manage timely and quality delivery of software projects in a highly agile team environment Provide technical feasibility assessments to bring product experience to the next level",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKgzMK77-SP0GzrlUCJg1eF2JBMzs6gflKdx3y8YU&s",
      "extensions": [
        "2 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBEZXZlbG9wbWVudCBNYW5hZ2VyIHwgMTAwJSBSZW1vdGUiLCJodGlkb2NpZCI6ImxsUjFpazd1QzJVQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVZCRk1rZFhSSEZCWW1sUE5tczBZWGN6WWpoeU1ucFlRMWRZUms1NmJ6TkhSalJVT1c1TlRFMTBiVU5MTlU1UlozQkVaR3RpVEZwT1NHeGFOaTFDU1c1aVltMVdUVmRzVkZwbE1ESmxSMlpTTVdkRFRuUnNNVVZaWlRWUkxVZFpTMUpITFVsbVZIcGxjbk5JUlhjM2IyZzVZVVZXU1dOTU9GTldYemhZZWxwdmJFZE5RWGd4T1VOamFtcFdhbTB6ZFdRMFNUUnZXRGREVFUxTVZXZHdaMkUzTUc1WlZGWTJiR3RSY1ZSUU0xSnlkbEpETXpWeFNIVnVTMEZSTWt0emFVNVdjVWwxU1d0MlpYVnNFaGRSWDBabVdYRTJVVTlLU0U5NWRFMVFkamwxWTNWQldSb2lRVVJxVjE4elRHSkpkbU51Y0VWVFNWcHZhMlpSZG01U1gxSXdSUzFtWTBkRlp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3VzLnRyYWJham8ub3JnL2pvYi0xNjQwLTIwMjIwNDE4LWU4NmRiY2JmYjg4Y2M4ODgzYjRmNmQ1MTNiMDVkODQwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile Developer",
      "company_name": "Quanta Dialysis Technologies",
      "location": "Beverly, MA",
      "via": "via Trabajo.org",
      "description": "Job Description 5+ years developing Android Apps (using Android and 3rd party libraries/frameworks) 5+ years Java experience Prior Android Developer Lead experience a plus Prior experience with project planning with large size or highly complex projects A solid understanding of mobile application development processes, from the layout/user interface to backend systems and API integrations A solid... understanding and appreciation for Agile tools, processes, and methodology Ability to interact well in a team environment Strong organization skills to manage multiple timelines and complete tasks quickly within the constraints of clients timelines and budgets Participate in the application technical design process. Develop programming specifications. Design, code and unit test application code using SDLC best practices. Complete estimates and work plan as appropriate for design, development, implementation and rollout tasks. Create technical system documentation and ensure that this documentation remains current throughout all phases of the SDLC. Communicate timely status, including any potential risks/issues to the appropriate teams to ensure that assignment releases are managed appropriately and that completed assignments are of the highest quality. Support and maintain applications utilizing required tools and technologies. Provide support for applications, including involvement with the Support Center, NOC, Infrastructure teams, and vendors as appropriate. Build partnerships across the application, business and infrastructure teams. Key Responsibilities Lead and participate in the design and implementation of large and architecturally significant applications. Champion company standards and best practices. Work to continuously improve software delivery processes and practices. Develop programming specifications. Design, code and unit test application code using Software Development Life Cycle (SDLC) best practices. Work with Product team to plan new features, gather requirements and propose solutions. Acquire and interpret business requirements, creates a functional specification, and determines the most efficient/appropriate technologies. Research and implement new interface development techniques. Support the entire application lifecycle (concept, design, test, release and support) Ability to work with new technologies while showing drive, adaptability, and creative thinking. Establish development best practices and growth of mobile applications standards. Help foster a culture of innovation and out-of-the box thinking.\n\nby Jobble",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2-XCL_C85kNdXHe_5V8kf-_bc7jtOKebwdSMbGdY&s",
      "extensions": [
        "3 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJuTGJlWmZYWUY4NEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUTNGRlRrSlBTR0ZrTkZOVGRYRmhXRzVzYm5SM1UzQnBWR3N0YkUxelpVbHJOM05pUVd0Sk5raHdjWG8yTlVkWGNXMWlNVlJZWVZwTVRWaHRNek4xVGtwTlJsWlNXRUV4ZFd0c2NqY3hVV3htTURkVWJWZFJhWFJIVUdwWVIwWkpaMVpKTjBwbllWbEZObGhwVXpjdFFUWk9RblE1ZFZNNFJYUnJkV2xYUlZwTVZsZENjVTFKVDBkb1UxcFFjbmxOVERoWk0xTjFTVlowT1RScU0zaEpVV2RmWlhWRVNUVkNiRzlxZVZWSldGOUZVRGxIYlc4NGNqTlFiRmx4YlRVMk1WbHZZbGxoRWhkUlgwWm1XWEUyVVU5S1NFOTVkRTFRZGpsMVkzVkJXUm9pUVVScVYxOHpUSE56TVZCcFVUSk9NamN5WjFWMFZsWXRka3BqTjJGeGJXcGZVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVHJhYmFqby5vcmciLCJsaW5rIjoiaHR0cHM6Ly91cy50cmFiYWpvLm9yZy9qb2ItNjQwLTIwMjIwNDE3LWRlYWZhMDk0MzJkNWM0NjBhZmE5NmUxZDA1MmI1ODhhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
      "title": "Mobile Android SDK & Ad-Formats developer",
      "company_name": "Yahoo!",
      "location": "Boston, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in?\nA Little About Us\n...\nWe are an industry leading direct to Consumer and Ad tech solution for advertisers and publishers. Our innovative ad tech gives one stop access to Yahoo's trusted data, high quality inventory and demand, creative ad experiences and industry-leading machine learning, at global scale. Consumer Monetization team’s charter is to Find, Evaluate, Build, and Scale new monetization, subscription and internal campaign tools and products, ad formats and functionalities across all Yahoo's brands including Yahoo Homepage, Yahoo Sports, Yahoo Finance, and Yahoo News. This team is uniquely positioned to identify growth and revenue generation opportunities, design and implement solutions across consumer products and advertising platforms including video, display, native, and search.\n\nA Lot about You\n\nWork with designers and other App developers (Android) to design , build and integrate innovative ad formats into popular native apps like Yahoo Mail, Yahoo Sports, Yahoo Finance\n\nDesign, Develop and contribute to Architecture solutions for subscriptions and Ads delivery on Android SDK to achieve business and revenue growth.\n\nWrite highly scalable Java and/or Swift code that is maintainable and testable.\n\nBe able to assess business requirements, translate them to development effort and raise issues proactively whenever scope/deadline is impacted\n\nRespond to high impact production incidents due to SDKs delivered to various Native App customers - internal or external\n\nInteract with consumers of Monetization/Subscription SDK to understand their requirements, pain points and help them succeed.\n\nParticipate in full application lifecycle (ideation, design, develop, test, build and deploy)\n\nQualifications\n\nBS/MS in Computer Science or equivalent work experience\n\nExperience in building SDKs/libraries used by mobile app developers\n\nExperienced in API design and developing clean and maintainable code\n\nExperience in automated testing of mobile application SDK code\n\nPrior experience building SDK's involving integration/building of RestFUL APIs\n\nAbility to mentor and/or coach junior developers\n\nExperience developing in Java/Kotlin or Objective C/Swift\n\nPrior experience building mobile applications using React Native\n\nExperience working with large codebase and large enterprise environments.\n\nYahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form () or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response.\n\nAt Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion () page to learn more.\n\nUS Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law.\n\nCurrently work for Yahoo? Please apply on our internal career site.\n\nSummary\nLocation: US - Dulles; US - Baltimore; US - Boston; US - Atlanta; US - Dallas; US - Miami\nType: Full time",
      "extensions": [
        "4 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "4 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQW5kcm9pZCBTREsgXHUwMDI2IEFkLUZvcm1hdHMgZGV2ZWxvcGVyIiwiaHRpZG9jaWQiOiJnREZoblY2eDl5VUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFWQkZNa2RYUTI5SlZXcE1UbFZJVTFKNlZXcGtTMjh5VTJsMWRUZG1lRnBrVEdGVFkxSjBUSFIzUjFSaWJHdDZWMkUwWmxodlgyVmpOVEF3WmtWWVdreFlNWE5yYjFKSFpITTFWVkU0VVVOZmJrMWhiVTFUTVdac2FHWmhkMVJIWVVWcVptWk1SMVo0TmxsdFZrMUlWMWx6WDJGR1lsSnpSVEF3V2tOSVFXWkdjVGRFV1VSWWJIUmlaMnROTmtsalJHVmZTSGR1ZWxSdlFVUkVhRXd0TW1FdFJFVnFkMmd5Wmt0UFZXcGFiSFJHVW1SR1l6Sm1ZbkJGYW1sTFVtZExPWGQyUXpOclMzZHRWSGg1RWhkUlgwWm1XWEUyVVU5S1NFOTVkRTFRZGpsMVkzVkJXUm9pUVVScVYxOHpTbGhSY1Mxc05XTmtTSEJHYkhOYU1ESkRVVVZHUVZJM2FWOURadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2VhcmNoIEFuZCBGaW5kIFlvdXIgTmV3IEpvYiBUb2RheSBXaXRoIEJqb2J6IiwibGluayI6Imh0dHBzOi8vYi1qb2J6LmNvbS91cy93ZWIvam9icG9zdGluZy85Mjk1OTM1NTQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "Remote : Mobile Developer - Android",
      "company_name": "ActiveSoft, Inc",
      "location": "Boston, MA",
      "via": "via Trabajo.org",
      "description": "Mobile Developer - Android\n\nCincinnati, OH – Remote...\n\n6 months hire\n\nJob Description\n• 2+ yrs. developing Android Applications (using Android and or 3rd party frameworks)\n• 2+ yrs. experience in Java and or Kotlin (preferred)\n• A solid understanding and appreciation for Agile tools, methodologies, and frameworks.\n• A solid understanding of mobile application development processes, from layout/user interfaces to backend systems and API integrations.\n• Strong debugging skills is a must.\n• Strong organization skills to manage multiple timelines and complete tasks quickly within constraints of timeline and budget\n\nKey Responsibilities\n• Lead and participate in the design and implementation of large and architecturally significant applications.\n• Champion company standards and best practices. Work to continuously improve software delivery processes and practices.\n• Develop programming specifications. Design, code and unit test application code using\n• Software Development Life Cycle (SDLC) best practices.\n• Work with Product team to plan new features, gather requirements and propose solutions.\n• Acquire and interpret business requirements, creates a functional specification, and determines the most efficient/appropriate technologies.\n• Research and implement new interface development techniques.\n• Support the entire application lifecycle (concept, design, test, release and support)\n• Ability to work with new technologies while showing drive, adaptability, and creative thinking.\n• Establish development best practices and growth of mobile applications standards.\n• Help foster a culture of innovation and out-of-the box thinking.\n\nPowered by JazzHR\n\n50fJDI8no8",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQqyuN0XuTfjNP81Mcsny_KSr9xK8FXvAykPWt_5VU&s",
      "extensions": [
        "3 days ago",
        "Full-time",
        "No degree mentioned"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJSZW1vdGUgOiBNb2JpbGUgRGV2ZWxvcGVyIC0gQW5kcm9pZCIsImh0aWRvY2lkIjoiNXd6Vnk3ZWJlallBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVkJGTWtkWFFWaGxhamxmTldsSlYxbE9aVGd5ZVY5V1p6UTVTV1ZIYWpSUVVFRm9WV3hvYUdKM1RIWnlSVVl4TmswMWFsRnZhaTFaVVZaQmNIZHhkMDFLUzFSVlozbFBjV1pRVjBSa2RVcHZUbWMwVFRSUFNERTBNREJITm5WaVMzSjJhbVV5WlZoNFNUTnFUMWQwVERsdFNtUmxZa1puZG05SVZsaEVSWEEzWjB4WlJVbzBiRTVEUXpSWlUybExhMUZhTjJjd2RURmhSM0JIYTJsMmMyRTFlbVJ6Vm5OdWRraHpPWEYyZURneE0xVnZkRWN6UzI1b1JWOUJZbEF3TWpoWlFsVlFOell0WkRsTkVoZFJYMFptV1hFMlVVOUtTRTk1ZEUxUWRqbDFZM1ZCV1JvaVFVUnFWMTh6U2twRFZtOWlUamw0U1UxS1EzVkxabXBSU0hCclYzVnphVkpGWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3VzLnRyYWJham8ub3JnL2pvYi02NDAtMjAyMjA0MTctMGRmOWU4M2RjNGFmOTkwNjI2MzE2NTM3YzNhNWJmNmI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
      "title": "iOS Software Engineer, Blink Mobile Applications",
      "company_name": "Amazon",
      "location": "North Reading, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "DESCRIPTIONJob summaryAs part of the mobile development team, you'll directly contribute to the Blink mobile platform and work to make the customer experience the best it can be. As part of a cross-functional agile team you will:Develop and deliver mobile app features, UX flows, and UI componentsCollaborate with product and UX teams to develop and maintain featuresWork to continuously improve code quality, code maintainability and app performanceKey job responsibilitiesRing is looking for a Senior iOS Engineer to join our mobile application team.You will:Develop and deliver mobile app features, UX flows, and UI componentsCollaborate with product and UX teams to develop maintainable featuresWork to continuously improve code quality, code maintainability and app performanceWork along-side other app developers and help raise the mobile app development barWork with modern iOS development tools and principles such as Swift, MVVM, SwiftUI, ReactiveSwift, Combine, Alamofire, CoreBluetooth... SwiftGen, SwiftLint, and Instruments.A day in the lifeAs an iOS Engineer at Blink, you will:Have an opportunity to support and influence key decisions within the mobile platform and promote best coding practices.Develop features which are used by millions of customers each day.Work closely with other team members to ensure new features are implemented in extensible, maintainable ways.Regularly work with backend developers to help support how our app integrates with back-end services. - Write well-tested code using modern architectural principles.About the teamBlink is a team of builders that proudly develops connected consumer products completely in house using a fast paced and efficient process. Acquired by Amazon, we love seeing Blink on the amazon.com home page, in retail stores, and in the homes of millions of users. We combine our startup culture with the resources and scale of Amazon to create a vibrant, fun, and rewarding place to work.BASIC QUALIFICATIONSExperience with object-oriented design2+ years of professional non-internship experience with front end, web or mobile software development using JavaScript, HTML and CSSBachelor's Degree in Computer Science, Engineering, or equivalent experience3+ years of experience working in iOS development using Objective-C and Swift2+ years of experience with iOS frameworks such as UIKit, Core Data, SwiftUI, Combine2+ years of experience with cloud message APIs and client server interactions such as REST APIs, socket communication, web sockets2+ years of experience with CI/CD, automated unit testing, and integration testingPREFERRED QUALIFICATIONSDeep understanding of agile principles and exposure to various process implementationsUnderstanding of Apple’s design principles and interface guidelinesProficient understanding of code versioning tools such as GitSolid understanding of the full mobile development life cycle, including the iOS deployment/release systemWorking knowledge of general UI design principles, patterns, and best practicesWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesUnderstanding of MVVM, SwiftUI, ReactiveSwift, Combine, Alamofire, CoreBluetooth, SwiftGen, SwiftLint, and InstrumentsAmazon is committed to a diverse and inclusive workplace",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9lQIQ4_kN3X8BUTnov5-bYkC6EJDAzEedlHaM&s=0",
      "extensions": [
        "2 days ago",
        "Full-time"
      ],
      "detected_extensions": {
        "posted_at": "2 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgU29mdHdhcmUgRW5naW5lZXIsIEJsaW5rIE1vYmlsZSBBcHBsaWNhdGlvbnMiLCJodGlkb2NpZCI6IkV4ZmF6Vm1KWFNzQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVZCRk1rZFhRWEJmWlZKV0xXMUtkMDE2U3pWVVVUZElSbXR5VEV4T1RtbGlTM042TFc4NGRtMUpUMWhVWld4TGMxRlpjVVoyT0dOdFdsSkZkMVpFVEdWVk1uaERUSE5uVjFnemJpMVBSRXRxYmw5VmIzb3dObW80VUdSSlIyZzFZV2RmZEdGYWFESTJjemMwU2xFMVVEQkJMVjlsY2poSVQydEJPVGRVWjFSeWNFa3djVkkwUVZaMmFuSlFXbm8xTjNGS05rRjNjbmxMVkY5R1NWWkhiblZqUjJRMU1WbEhibUZIVDJKek9WZDFhM1pqVDA0eVZ6azJkazU1UVZoUU5YaGxXbE00TkU5S1Qyb3dPWE5KVkVkbGNFcFRTRTVrVm5kamJsUldkWFU0WnhJWFVWOUdabGx4TmxGUFNraFBlWFJOVUhZNWRXTjFRVmthSWtGRWFsZGZNMHRKYmpkaGNuQnRZa2hpYW5oamNsTTRkVEphWVZoT2JFcFRTV2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTZWFyY2ggQW5kIEZpbmQgWW91ciBOZXcgSm9iIFRvZGF5IFdpdGggQmpvYnoiLCJsaW5rIjoiaHR0cHM6Ly9iLWpvYnouY29tL3VzL3dlYi9qb2Jwb3N0aW5nLzBjN2JmODNjY2ZkNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Developer I - US Remote - Multiple Locations",
      "company_name": "Sunnova Energy",
      "location": "Boston, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "Brief Description of Sunnova Sunnova is a different kind of Power Company, offering solar and storage services to homeowners within the United States and its territories through our network of local solar dealers and solar standard community homebuilders. Our mission is powering energy independence TM and changing the energy industry. At Sunnova, we believe in achieving more by working together... our diverse workforce allows an inclusive and innovative culture to power our long-term growth. Our people focus on thinking beyond traditional limits – and to do that, we need the creativity and energy of every person. Come be a part of the fastest growing segment of the energy industry! The Mobile Developer I Position\nSunnova Energy is currently searching for a Mobile Developer to be responsible for building and maintaining Sunnova’s mobile applications. This position collaborates closely with leaders, product managers, user experience experts, and other technology colleagues to design and build the next generation of native iOS and Android apps for Sunnova’s customers and dealers.\nMobile Developer I Responsibilities\n\nProvides technical expertise throughout the mobile application development lifecycle (proof of concept, design, development, build, test, deployment, and support)\nPerforms hands-on mobile development tasks as an individual contributor\nActs as subject matter expert for mobile software products that the scrum team supports\nResearches and suggests new mobile architectures, applications, and protocols\nContinuously refines the mobile development pipeline (e.g., dev processes, environment management, testing strategy, CI/CD processes)\nWorks in all phases of the software development life cycle including functional analysis, development of technical requirements, technical design, prototyping, coding, building, testing, deployment, data migration, and support\nTakes ownership of problems and issues, proactively works with business stakeholders, product management, architects, other developers, business analysts, quality assurance, and release management\nFinds, analyzes, and fixes bugs and performance problems as they may occur\nCollaborates with Application Support team to respond to reported system issues\nOrganizes and prioritizes individual workload with scrum team to meet required deadlines\nWorks as a team member, accepts ownership of work, and actively contributes to team discussions\nParticipates in daily stand ups, works with scrum team on projects, and supports delivery timelines and priorities\nDesigns, documents, and presents solutions to senior leaders in IT\nWorks effectively in a matrixed environment where 1) day-to-day tasks are determined and executed on agile/scrum team under the leadership of a scrum master and 2) career development, coaching, goal setting, performance evaluations, and issue escalation are coordinated through a separate manager\nMinimum Requirements\n\nBachelor's; preferably computer science/engineering, electrical engineering, software engineering, information systems, or equivalent work experience\n1-2+ years of mobile development, native or cross-platform\nExtensive knowledge of at least one programming language commonly used in mobile app development, such as Swift, Objective C, Java/Kotlin, C#, or JavaScript\nFamiliar with OOP and MVC/MVVM design principles\nPreferred Qualifications\n\nExperience with native iOS/Android development\nExperience with Flutter, React Native or Xamarin. Forms\nExperience with third-party libraries and APIs\nAbility to identify opportunities for technical improvements across multiple processes or functional areas, recommend solutions, and advocate for implementation\nAdditional Knowledge, Skills And Abilities\n\nStrong problem solving and analytical skills\nStrong written and verbal communication skills\nWorking Conditions\n\nOpen office environment\nExtended periods of time working at computer workstation\nSome overtime required\nLocation: Remote\nBenefits\nSunnova offers a generous employee reward package that includes:\nComprehensive benefits, including medical, dental, vision, life insurance, healthcare flexible spending account, and 401(k) with employer match.\nCompetitive compensation & annual bonus\nPaid time off, including 10 holidays and Paid Parental Leave\nCell phone allowance for many roles\nFree access to onsite fitness center in Houston and/or discounted fitness memberships through health provider\nComplimentary garage parking in Houston\nWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.\nIf you are selected for a position, your employment will be contingent upon submission to and successful completion of a post-offer/pre-placement drug test (and medical examination if required by the role) as well as pre-placement verification of the information and qualifications provided during the selection process",
      "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSekoq7WbmssvXoCDwEMiTSvXS_AAwCHXV69iRS&s=0",
      "extensions": [
        "6 days ago",
        "Full-time",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "6 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIEkgLSBVUyBSZW1vdGUgLSBNdWx0aXBsZSBMb2NhdGlvbnMiLCJodGlkb2NpZCI6IndrXzVpNGRSVHdZQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVZCRk1rZFhRMFZLUlhaaVdEZDRSMGRQV21keVJGTlpjRUY2WDFCRlNERkdUa2xWTkU0NVFtRnJkVWRZUTNOVGRuRnpMVGgwUjBKR1REVk9jV0Z5Tm5aNGJqaDNhUzFYUzNKUE16SjZXa3hXZDBScmVrRnVPRnBwZEROUFp6UXRZVUUzVms1QmFsVldiM2gyWjB4UlQyNDNkRGxzVlhWSmFYSm5iakZxWmxaVmIyUjVlR2xmV21WUVVWTnRiWFV6Ums5emVWOHpYM0ZxTUVNemNqSlNVbUpIVWpoamFXMWZWR2d6ZFVSTVVraE5ibFprY0hBeVpYbzFVVGQ2TkVGQlUzbFFjVzgxVG5acVVXMHpaa0pKVEZseFNtMDNTa1ptVGt0S1J6bFBjRjlNVVJJWFVWOUdabGx4TmxGUFNraFBlWFJOVUhZNWRXTjFRVmthSWtGRWFsZGZNMHBpUjI5T1pIbEhiRGhIVUVwWVpsQTFkbE5aUW5ZeVYxSlVhRkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTZWFyY2ggQW5kIEZpbmQgWW91ciBOZXcgSm9iIFRvZGF5IFdpdGggQmpvYnoiLCJsaW5rIjoiaHR0cHM6Ly9iLWpvYnouY29tL3VzL3dlYi9qb2Jwb3N0aW5nLzkzNDMzMDM5NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
      "title": "Mobile Developer (iOS and Android) - FULL REMOTE",
      "company_name": "CyberCoders",
      "location": "Boston, MA",
      "via": "via Search And Find Your New Job Today With Bjobz",
      "description": "If you are a Mobile Apps Software Engineer with experience, please read on!\nTitle: Mobile Developer\nLocation: Southern Oregon or FULL REMOTE...\nBased in Rogue River and founded in 1965 and we are a established, industry leading and innovative meter measurement company that specializes in moisture. Due to growth and demand for our services, we are in need of hiring for a Mobile Developer.\nWhat You Will Be Doing\nYou will take lead on application development.\nYou will work on new products.\nYou will engineer on iOS and Android.\nWhat You Need for this Position\n4+ years of Mobile Development experience.\nRequirements\n\nAndroid and iOS development.\nWhat's In It for You\nCompetitive base salary and overall compensation package\nFull benefits: Medical, Dental, Vision\n401 (K) with generous company match\nGenerous Paid time off (PTO)\nVacation, sick, and paid holidays\nLife Insurance coverage\nSo, if you are a Mobile Apps Software Engineer with experience, please apply today!\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Rex Redjai\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRex.Redjai@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : RR7-1669820 -- in the email subject line for your application to be considered.***\nRex Redjai - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire",
      "extensions": [
        "3 days ago",
        "Full-time",
        "No degree mentioned",
        "Health insurance",
        "Dental insurance",
        "Paid time off"
      ],
      "detected_extensions": {
        "posted_at": "3 days ago",
        "schedule_type": "Full-time"
      },
      "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIChpT1MgYW5kIEFuZHJvaWQpIC0gRlVMTCBSRU1PVEUiLCJodGlkb2NpZCI6Inc2dTRYTVBNMVQ0QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVZCRk1rZFhRV2RYUmxSdU9FMHdPRkZzVWpOeFRrY3hOV3N3T1VaZk1XVTBhREpWVlhOTVluQndYMlF5VEhkNVVubHZjMk5yWkd3eGVGRlhVVUYyTVZCbmNubE5iMkpHVFZabVYybGtUVWxzY25Gb2JtMDROSFY0U205a1QycHpUMlIwZW05TGJVdDRSa0ZNVW1aek1GcE5SR3hHU1Y5bmJHVTVkMlU1ZDI5dmNVUTVZVU53U1dOVU1uWndXSE54V1hWaWVteEdUbTB5ZFZKRVpIZElRak5mWTBsQ1JVcDJXWEZyYW5SVVQyUnBkSGRtTkV4UFpIUlNjMXBXVVRGU2QyaFpOa1JIU21WMmFscFVTR3RKT0MxdlEwVlNiMGszU0ROdldYSnRWR1JZVVJJWFVWOUdabGx4TmxGUFNraFBlWFJOVUhZNWRXTjFRVmthSWtGRWFsZGZNMGxXWDI1cFpEUmpaRlYyT0ZkMVUyVmpiMFIxWTBkVGVYazVPVkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTZWFyY2ggQW5kIEZpbmQgWW91ciBOZXcgSm9iIFRvZGF5IFdpdGggQmpvYnoiLCJsaW5rIjoiaHR0cHM6Ly9iLWpvYnouY29tL3VzL3dlYi9qb2Jwb3N0aW5nLzkzNDU0OTE1ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    }
  ]
}